[
  {
    "Title": "Motsus + Idealus Maximus",
    "DateString": "2026-01-31T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/motsus-idealus-maximus/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/motsus-idealus-maximus-1.png",
    "Location": "Muziekclub 4AD",
    "Description": "MOTSUS Release show van de nieuwe plaat ‘ATLAS’. Dat er in de IJzer veel chemische substanties rondzwemmen, is een publiek geheim. Maar in Oudenburg moeten er nog veel kwaadaardigere viezigheden dobberen. Het stonertrio MOTSUS ontstond in die polderstad in 2012 en is sindsdien bezig zich een weg te banen door de heavy underground met een compromisloze mix van stonerriffs, hedendaagse sludge metal en oldschool doom . Dodelijk zwaar en traag, een beetje zoals de Belgische begrotingsonderhandelingen, maar soms ook messcherp snel en onverzettelijk. ATLAS markeert een belangrijke evolutie voor het trio. Het album, opgenomen in de Dunk!Studio’s in Zottegem en gemixt en gemasterd door Karl Daniel Lidén , neemt je mee op een sonische reis van intieme akoestische fluisteringen tot gedurfde nieuwe composities die dieper terrein verkennen binnen doom en atmosferische klanken. De releaseshow bij 4AD bevat een speciale uitvoering van de volledige “Exploder”-saga, waarbij “Exploder Pt. I” van Oumuamua (2018) naadloos overgaat in “Exploder Pt. II” van het nieuwe album—een carrière-overspannend verhaal dat voor het eerst als één geheel wordt gespeeld. Na Oumuamua (2018, uitgebracht via Polderrecords) deelde MOTSUS podia op festivals zoals de Gentse Feesten en Alcatraz , waarmee ze een reputatie opbouwden voor fysieke, fundamenten-doen-trillen­de liveshows. De releaseshow bestrijkt de volledige catalogus van de band—van hun rauwe demo’s uit 2014, via de interstellaire zwaarte van Oumuamua, tot het gloednieuwe ATLAS-materiaal dat integraal wordt uitgevoerd. Instagram | Facebook Idealus Maximus Instrumentaal rocktrio. Opgericht in 2004 door Fanio (drums), Erik (gitaar) en Pablo (bas) , heeft Idealus Maximus in de voorbije twee decennia een stevige reputatie opgebouwd binnen de Belgische stoner- en instrumentale rockscene. Bekend om hun hypnotiserende, door riffs gedreven klanklandschappen, deelde de band het podium met hun grootste inspiratiebronnen, waaronder Karma To Burn en The Atomic Bitchwax , en speelde ze op festivals zoals Yellowstock en Roadkill . Hun meest recente wapenfeit, Loofbos uit 2022 (uitgebracht via Polderrecords), toonde het vakmanschap van het trio in het opbouwen van atmosferische, psychedelische passages die uitmonden in verpletterende geluidsmuren. Met kersverse studiotracks op zak belooft Idealus Maximus een krachtige performance die naadloos aansluit bij de instrumentale doomesthetiek van MOTSUS. Verwacht verpletterende riffs, hypnotiserende grooves en het soort dynamische, instrumentale storytelling dat hen al meer dan twintig jaar een vaste waarde maakt in de Belgische heavy-muziekscene. Instagram | Facebook"
  }
]