[
  {
    "Title": "MISS ANGEL + MAHINA",
    "DateString": "2026-01-30T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/miss-angel-mahina-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f616/78/179803a6cb27e130000b4ef3c7526abf03ed7577.jpg",
    "Location": "De Kreun",
    "Description": "MISS ANGELMiss who? MISS ANGEL! Angela aka Miss Angel is een jonge lyriciste uit Antwerpen. Hip hop was altijd al een deel van haar leven, maar in 2016 ontdekte ze ook haar eigen stem en begon ze&amp;nbsp;nummers te schrijven. Het duurde niet lang voor ze met enkele beatmakers de studio induikte: daaruit kwamen straffe nummers als &#039;All of the Shmoke&#039;, &#039;Money Making Mami&#039; en &#039;Ghetto Supahstar&#039;. Nu als deelnemer aan &#039;Dancing with the Stars&#039; zette MISS ANGEL zich verder op de kaart. Miss Angel’s sound is sterk beïnvloed door UK grime, old school hip-hop and vrouwelijke MCs.&amp;nbsp;&amp;nbsp;MAHINAMahina Ngandu is een Brussels based artiest. In 2015 krijgt ze bij Mama’s Open Mic voor het eerst de kans haar zangtalent met een groot publiek te delen, waar ze meteen lovende commentaren op krijgt. Vanaf dan beslist ze om als zangeres haar stem te gebruiken en haar liefdevoor kunst via verschillende kunstdisciplines te uiten. Zo ontstond dan ook het concept &#039;Chameleon&#039;.&amp;nbsp;Dankzij haar sterke en veelzijdige persoonlijkheid, én als Afrikaanse vrouw, laat Mahina zich als zangeres uit op Afro pop, soul, RnB, Congolese melodieën en ritmes, reggae en meer. Ze maakt er haar artistieke uitdaging van om haar eigen stijl te vinden tussen die van ‘zwarte muziek’ uit verschillende tijden en plaatsen.De double bill &#039;MISS ANGEL &amp;amp; MAHINA&#039; zit in het CUBO-aanbod van Schouwburg Kortrijk. CUBO-tickets kun je enkel reserveren bij Ticketservice Kortrijk - telefonisch (056/23 98 55), aan de balie of via&amp;nbsp;ticketservice@kortrijk.be. Meer info over CUBO&amp;nbsp;vind je hier.Had je een ticket voor deze double bill op Blender (5/07)? Dan krijg je automatisch toegang tot dit concert. Heb je een ticket, maar kan je niet komen? Contacteer gerust tickets@wildewesten.be !"
  },
  {
    "Title": "XINK: AFSCHEIDSSHOW",
    "DateString": "2026-01-31T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/xink-afscheidsshow",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6545/d4/33ed9f495a6322c05327154cae8048a375cfdb1a.jpg",
    "Location": "De Kreun",
    "Description": "Na vier uitverkochte AB-shows en spots op Rock Werchter en Pukkelpop, keerde XINK sterk terug. Wat begon als een tienerband met hits als &quot;Laat Me Vrij&quot; en &quot;De Vriendschapsband&quot;, is uitgegroeid tot een volwassen band die hun roots niet vergeet, maar wel durft te vernieuwen. Met hun derde album &quot;Dag Nul&quot; slaat de band een frisse creatieve weg in. Nieuwkomer Jasper Mulier op bas en co-producer Simon de Wit (aka Blanks) zorgen voor frisse wind door de sound, zonder het vertrouwde XINK-DNA te verliezen.De band kondigde recent hun stop aan, waardoor deze show een van de laatste shows wordt die je live kan meemaken. Twijfel niet, koop snel je ticket!&amp;nbsp;support: BearscapeIndie-pop met een flinke portie variatie. Van trage, melancholische nummers voor regenachtige dagen tot vrolijke uptempo songs die spontaan een glimlach op je gezicht toveren."
  }
]