[
  {
    "Title": "WORKSHOPREEKS DIGITALE MUZIEKPRODUCTIE",
    "DateString": "2026-02-05T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/workshopreeks-digitale-muziekproductie",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/42e3/56/cabd9bb7375d86aa53f308ea534fb4b9c3aed913.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "Muziekproductie: van idee tot afgewerkte trackWilde Westen biedt in samenwerking met TRACK &amp;amp; yungsnem een intensief traject muziekproductie aan voor iedereen die zelf muziek wil maken en zijn ideeën wil uitwerken tot een volledige, afgewerkte track. In 10 workshops (elke week op donderdag) bouwen we stap voor stap op: van de basis van een DAW tot productie, vocalopname, mixing en mastering. De workshop start op 5/02 en gaat verder door op 12/02, 26/02, 5/03, 12/03, 19/03, 26/03, 2/04, 23/04 en 7/05.Deelnemers leren werken met een Digital Audio Workstation (DAW) (Ableton Live of FL Studio), ontwikkelen sterke loops en muzikale ideeën, en leren hoe ze structuur, vocals, mix en master samenbrengen in één coherente productie. Het traject is praktijkgericht en geschikt voor beginners met of zonder basiskennis.OpzetElke workshop bestaat uit:Theorie &amp;amp; demonstratie: duidelijke uitleg met concrete voorbeeldenPraktijk: meteen aan de slag met persoonlijke begeleiding en feedbackWe werken in kleine groepen tot 8 deelnemers, zodat er voldoende ruimte is voor individuele ondersteuning.Inhoud van het traject (10 sessies)Intro &amp;amp; kennismaking met de DAWVoorstelling van het traject&amp;nbsp;Kennismaking met de cursisten&amp;nbsp;Eerste kennismaking met het gekozen programma (+ nagaan of alles technisch klaar is om er volgende lessen te beginnen)Drumgrooves en audioloopsHoe maak je een goeie drumgroove en welke elementen heb ik hiervoor nodig (afhankelijk van het genre)?&amp;nbsp;Hoe kan je audioloops gebruiken in een beat (stretchen, pitchen, choppen)?MIDI, baslijnen en melodieënWat is MIDI en hoe kan ik het gebruiken in mijn producties?&amp;nbsp;Hoe maak ik een stevige baslijn?&amp;nbsp;Hoe maak ik een melodie die “juist” en mooi klinkt? Welke elementen gebruik ik hiervoor (vb. akkoorden en topline)?Van loop naar volledige trackstructuurHoe bouw ik een loop uit tot een volledige track met een goede structuur?Mixing (les 5, 6 en 7): setup, EQ, dynamiek en effectenHoe maak ik een project klaar om te mixen (orde brengen, mixer routing)?&amp;nbsp;Hoe werkt gain staging en headroom?&amp;nbsp;Werken met busses/group tracks&amp;nbsp;Werken met sends/fx tracks&amp;nbsp;Hoe werken filters?&amp;nbsp;Hoe werkt een EQ?Vocal recording&amp;nbsp;Hoe ziet een basis studio setup eruit (info over al het materiaal die nodig is om zelf opnames te maken)?&amp;nbsp;Hoe maak ik een goeie en cleane vocal opname? (demonstratie van een studiosessie met artiest erbij)vocal mixingHoe maak ik een vocal opname klaar om te mixen?&amp;nbsp;Hoe gebruik ik autotune?&amp;nbsp;Hoe pas ik EQ en compressie toe op een vocal om die op te schonen en naar voor te brengen in de mix?&amp;nbsp;Hoe voeg ik karakter toe aan mijn schoongemaakte vocals met reverb, delay, saturation, etc.?Hoe mix ik backing vocals en adlibs?Mastering en afwerking van de trackBasis over hoe je een goede master maakt en hoe je de aangeleerde mixconcepten hierop toepast (vb. EQ, compressie, limiting)Aan het einde van het traject beschikken deelnemers over de kennis én tools om zelfstandig een eigen productie af te werken.PraktischBenodigdheden: laptop met DAW + koptelefoonGroepsgrootte: max. 8 deelnemersLocatie: Multimedialab Track"
  },
  {
    "Title": "OZARK HENRY",
    "DateString": "2026-02-06T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ozark-henry-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/036d/42/0adbbd4a5c0d1ac5767a7fb28591c9581923e9da.jpg",
    "Location": "De Kreun",
    "Description": "Acht jaar lang was het stil rond Ozark Henry, maar dit najaar breekt hij die stilte met August Parker, zijn tiende studioalbum.&amp;nbsp;De thematiek van August Parker raakt aan verandering en veerkracht. Eén van de sleutelmomenten op de plaat is het aangrijpende ‘Light’. De inspiratie haalde Piet Goddaer dicht bij huis. “Ik heb iemand gekend die doofstom geboren is, maar rond zijn dertigste de kans kreeg om via een implantaat toch te kunnen horen. Het werd hem voorgesteld als iets geweldigs, maar na een week proberen vond hij het verschrikkelijk en wilde hij zijn oude leven terug. Het gaat, kortom, over in een situatie terecht komen die volgens anderen een vooruitgang betekent. Als een blinde de belofte krijgt dat hij zal kunnen zien is dat létterlijk iets om naar uit te kijken, maar tegelijk is er het besef dat je dan ook afscheid moet nemen van alles wat je tot op dat moment als vertrouwd hebt beschouwd.”&amp;nbsp;Voor de esthetische wereld rond August Parker sloeg Ozark Henry de handen ineen met filmmaker Lukas Desmet, die de kunst van Kintsugi – het Japanse ambacht waarbij breuken met goud worden hersteld – als leidmotief gebruikte. De boodschap is krachtig: schoonheid schuilt in imperfectie, barsten vertellen verhalen, en muziek verbindt de scherven.Live overstijgt Ozark Henry genres en verwachtingen—zijn meeslepende shows, van grote festivals tot uitverkochte zalen, zijn pure cinematografie in geluid.&amp;nbsp;Belangrijk: dit is een staand concert!&amp;nbsp;&amp;nbsp;support: Kris DaneDe voorbije jaren is Kris Dane uitgegroeid tot één van de meest authentieke singer/songwriters in België. Op zijn nieuwe, inmiddels negende plaat zet de Antwerpenaar zijn uniek parcours verder en slaat hij tegelijk weer nieuwe wegen in. Benieuwd hoe dat klinkt? Kom mee ontdekken op 6 februari!"
  },
  {
    "Title": "SPOETNIK @HOF",
    "DateString": "2026-02-07T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/spoetnik-hof-6",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7b38/5a/cca2f8c31b29a555cf9a1aa118b6228758db7620.jpg",
    "Location": "HOF",
    "Description": "Met &#039;Spoetnik&#039; ondersteunen we elk jaar een tiental opkomende muzikale talenten uit de streek. Gaande van jazz over klassiek, van rock naar hiphop en alles ertussen.Op zaterdag 7 februari, tijdens de Week van de Belgische Muziek lanceren we een gloednieuwe Spoetnik-sessie bij onze buren van HOF! Inkom is volledig gratis.Aan de beurt die avond: BILLY, ELISE en FOULON!"
  },
  {
    "Title": "DANSFEESTJE: De Belgische Editie",
    "DateString": "2026-02-07T21:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/dansfeestje-de-belgische-editie",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1322/86/e06995f121b0aa4f0e3a493ee7dd263a127982fc.png",
    "Location": "De Kreun",
    "Description": "Nog eens een goed dansfeestje? Als afsluiter van de Week van de Belgische Muziek duiken we met Muziekcafé HOF en Wilde Westen vol overgave in onze eigen muziekgeschiedenis.Geen saaie geschiedenisles maar wél pure, platte goeie schijven. Eppo Janssen en Nadiem Shah trekken een lijn door decennia Belgische clubgeschiedenis: van zweetdruppelende new beat tot hiphop van eigen bodem, van vergeten parels tot tijdloze knallers. Een dansvloer waar generaties elkaar ontmoeten en Belgische muziek doet waar ze het beste in is: mensen laten losgaan. Inkom = 6 euro incl. gratis drankje!&amp;nbsp;"
  },
  {
    "Title": "MATINEE: SPECTRA &amp; JULIEN LIBEER",
    "DateString": "2026-02-08T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-spectra-julien-libeer",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/5095/58/c42edb106a0036ec8fba8af7294ec236291d5a8b.jpg",
    "Location": "Concertstudio",
    "Description": "Tien beelden geboetseerd door piano&amp;nbsp;Aan het begin van de twintigste eeuw schreef de Franse impressionist Maurice Ravel zijn ‘Miroirs’, vijf karakterstukken voor piano. Elk stuk, opgedragen aan één van de leden van de controversiële kunstenaarscollectief ’Les Apaches’, is een beklijvend beeld, gereflecteerd door Ravels artistieke persoonlijkheid. In ‘Spiegel van Spiegels’ vertolkt Julien Libeer Ravels de vijf portretten op piano, terwijl SPECTRA ze reflecteert in evenveel parels uit een recent verleden.&amp;nbsp;Kaija Saariaho’s ‘Sept Papillons’ verdrijft de duistere sfeer van de nachtvlinders uit ‘Noctuelles’. De verdwaalde vogels in een somber woud onder een drukkende zomerhitte in ‘Oiseaux Tristes’ zetten hun lied verder in ‘The Birds in Warped Time II’ van Somei Satoh. Ook ‘Une Barque sur l’Océan’ vaart na ongeveer een eeuw bevreemdend verder in Murails ‘La barque Mystique’. De opzwepende Spaanse ritmes uit het ochtendlied van de nar (‘Alborada del Gracioso’) verstommen aan de rand van de nacht in Sciarrino’s ‘Ai limite della notte’ terwijl het Parijse klokkengelui op volle middag in ‘La vallée des cloches’ langzaamaan uitsterft in het mystiek ritueel van ‘Lettre Soufie: Sh(în)’ van Jean-Luc Fafchamps.&amp;nbsp;In totaal dus tien sublieme en intense klankschilderingen, spiegels van spiegels van hun tijd."
  },
  {
    "Title": "PETER DOHERTY",
    "DateString": "2026-02-08T18:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/peter-doherty",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/fd3d/c7/6e9989b0fe6cf6a977ced8d6b2e227c6d03f8edf.jpg",
    "Location": "De Kreun",
    "Description": "In 2025 tourde Peter Doherty met zijn band door het Verenigd Koninkrijk en Europa, met optredens op grote festivals en eigen headline-shows. Zijn nieuwste album Felt Better Alive werd zijn grootste UK-release tot nu toe, goed voor een Top 10-notering en lovende recensies in o.a. Mojo, The Times, Le Monde, Les Inrocks en Der Spiegel.Doherty’s band bestaat uit topmuzikanten als Mike Joyce (The Smiths), Mike Moore (Liam Gallagher), Mark Neary (Baxter Dury), Jack Jones (Trampolene) en Katia de Vidas — zijn vrouw — op toetsen.Met Felt Better Alive toont Doherty zich op zijn meest open en geïnspireerd. Het album — een speelse mix van folk, pop en poëtische reflectie — ademt warmte, melodisch vakmanschap en een nieuw soort rust.Als bezieler van The Libertines en Babyshambles is Peter Doherty uitgegroeid tot een icoon van de Britse indierock: een overlever, dichter en muzikant die blijft verrassen met oprechte, meeslepende muziek.&amp;nbsp;supports: LAMOUR + LuvcatLAMOURLAMOUR staat voor een compromisloos oprechte popbenadering waarin wellustige rock versmelt met gevoelige en provocerende ballads. Zoete melodieën gaan hand in hand met elektronische dance, in de traditie van Factory Records-iconen Rough Trade. Een scherpe elektrische gitaar vormt het decor voor gevoelige, brutale en bedwelmende teksten, doordrenkt van sarcasme en surrealistische humor. Bovenal is LAMOUR een croonersstem gedragen door een aanstekelijke punkenergie.&amp;nbsp;LuvcatLuvcat brak door met haar zwoele debuutsingle Matador en bracht ons in haar theatrale wereld vol romantiek, chaos en rock-’n-rolldecadentie. Gevoed door invloeden als Nick Cave, Cabaret en The Cure vermengt ze gothic swagger met glamoureuze allure, geworteld in haar eigen escapistische verhalen over liefde, obsessie en ontsporing.&amp;nbsp;"
  },
  {
    "Title": "ZING!",
    "DateString": "2026-02-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/zing",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4851/79/b4ffc66ef5857d4c55fc61a84b3168a105203d8f.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "ZING staat voor de magie van meerstemmig &amp;amp; vollenbak zingen. Opgezweept door DJ &amp;amp; zangmaker Lisa Jordens knallen we de heerlijkste popsongs in een warm bad van energie &amp;amp; verbinding. Je moet geen noten kunnen lezen en je muzikale niveau is van geen belang. Een grote groep maakt vanzelf muziek, en Lisa weet als geen ander hoe je daar samen iets moois -en vooral megaleuks- van maakt. Denk ABBA, Madonna, Taylor Swift. You name it, bij ZING zingen we het!&amp;nbsp;Gratis, maar registratie is verplicht, klik door hiernaast naar de website van Muziekcentrum Track om je te registreren.Locatie: Hal B Muziekcentrum Trackwww.zing.cool&amp;nbsp;@zing.cool&amp;nbsp;&amp;nbsp;Foto&#039;s: fotograaf Rembrand Neirinckx (Rembrand.be)&amp;nbsp;"
  },
  {
    "Title": "LEGENDS OF ROCK TRIBUTE FESTIVAL  - MONSTERS OF ROCK",
    "DateString": "2026-02-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/legends-of-rock-tribute-festival-monsters-of-rock",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6167/a7/b329eb8f2957d1f9c9ddd6a6e870315541654db2.jpg",
    "Location": "De Kreun",
    "Description": "Op vrijdag 13 februari komt de LEGENDS of ROCK Tribute Tour naar Kortrijk met een spectaculaire MONSTERS of ROCK-editie. De No.1 tribute bands van Metallica, AC/DC en Guns N’ Roses zullen alle hits en de beste albumsongs van hun muzikale helden op spectaculaire wijze en op het allerhoogste niveau het publiek in spelen. Met dynamische lichtshows, special effects en in een perfecte ambiance zorgen deze top bands voor een aaneenschakeling van rauwe en dampende concerten. Met dit monsterlijke programma zullen ze Kortrijk op haar grondvesten laten schudden.“De LEGENDS of ROCK Tribute Tour is in het leven geroepen om de beste tribute bands van Europa de mooiste podia te bieden waarop hun dynamische shows optimaal tot hun recht komen.&amp;nbsp;Hierdoor ondergaat het publiek de ultieme live-beleving!&amp;nbsp;Met onze No.1 tribute bands van Metallica, AC/DC en Guns N’ Roses&amp;nbsp;is dit een MONSTERS of ROCK-ervaring van het hoogste niveau!”&amp;nbsp;- aldus promoter/producer John Van den Borne."
  },
  {
    "Title": "BUZZCOCKS",
    "DateString": "2026-02-14T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/buzzcocks",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/39c0/78/e6534983fa666de9695808bd61291ce8aa50ebf0.jpg",
    "Location": "De Kreun",
    "Description": "In een steeds somberder wordend muzikaal landschap, waar virale rages en door AI gegenereerde nepnummers de hitlijsten delen met de egocentrische producten van de toneelscholen van het land, schitteren Buzzcocks als een stralend baken van hoop. De band is al 45 jaar een constante, steeds evoluerende aanwezigheid in de popcultuur en hun legendarische status zal in september letterlijk in steen worden gebeiteld met hun opname in de Music Walk Of Fame.De live shows van de band, die beter zijn dan ooit, zijn ondertussen een opwindende herinnering aan de kracht van rockmuziek om te inspireren, te onderwijzen en te informeren.Met Steve Diggle als &#039;high priest&#039; zijn Buzzcocks nog steeds de band om in te geloven.&amp;nbsp;support: Chiff ChaffsChiff Chaffs ontketenen een psychotische rock-’n-roll die je in zo’n razend tempo omver blaast dat je je afvraagt wat je net heeft geraakt. Gedreven door brute ritmes, grommende zang, priemende orgelklanken en primitieve riffs razen ze met ongeremde intensiteit door hun nummers."
  },
  {
    "Title": "OKAPI - Klankennest",
    "DateString": "2026-02-17T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/okapi-klankennest",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/bbca/6f/d5962375fb47b4ed2b7afd4052078ad0eb517bdb.jpg",
    "Location": "Concertstudio",
    "Description": "Klanken uit klei? Jawel, op vraag van Klankennest creëert kunstenares Gemma Luz Bosch sculpturen die door hun vorm en positie unieke geluiden produceren. In combinatie met de speelse vormen van de creaties ontstaat een wonderlijke wereld, die het publiek samen met de performers mag manipuleren, zodat steeds nieuwe klanken en vormen ontstaan.&amp;nbsp;Voor zijn nieuwste creatie inspireert Klankennest zich op Vlaamse polyfonie, vroege barokmuziek en de textuur en creatieve mogelijkheden van … klei. Klanken worden gevormd door unieke kleisculpturen die kunstenares Gemma Luz Bosch op vraag van Klankennest voor deze voorstelling creëert. Ze vormen ijkpunten in een landschap van natuurlijke klei dat door speelse manipulatie van performers én publiek voortdurend van uitzicht en geluid verandert. Net als het dier – sierlijk en speels, vertrouwd en mysterieus – neemt ‘OKAPI’ het publiek mee langsheen contrasterende werelden van oude en nieuwe muziek, vertrouwde en vernieuwende instrumenten, structuur en vrijheid… in een uitnodiging om eindeloos te spelen en te verkennen. &amp;nbsp;"
  },
  {
    "Title": "THE SERFS ✘ BODY TO BODY ✘ DEATH DISCO AFTERPARTY",
    "DateString": "2026-02-20T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/the-serfs-body-to-body-death-disco-afterparty",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/05a5/d9/d9c8e8862a6e7efd02bff97d2c8776d0fdc98979.jpg",
    "Location": "De Kreun",
    "Description": "The SerfsThe Serfs, met roots tussen de silo&#039;s in het zuidwesten van Ohio, is een duistere en industriële bende dansvloer-kunstenaars. Het is een band van gestoorde troubadours wier geluid en muzikale ideologie een logisch gevolg lijkt te zijn van hun directe omgeving: hard bekabelde en hypnotiserende gesynthetiseerde melodieën die zich voortbewegen op een kolkende en schrapende percussie met metaalachtige tonen.For fans of: Devo, Cabaret Voltair, Parade Ground, New Orderaftershow: Body to BodyBody To Body is het gloednieuwe project van Bram Coussement en Bert Libeert. Behalve hun Kortrijkse roots delen ze ook dezelfde muzikale smaak én dezelfde obsessie voor een strakke soundesthetiek.Beiden duiken al jaren op in allerlei bands (VAAG, Bloodbubble, GOOSE, B1980) en hebben een stevige stapel releases achter de kiezen. Met Body To Body bundelen ze hun eigenzinnige visies tot één frontale, zinderende aanval.Geïnspireerd door EBM-legendes als Front 242 en Nitzer Ebb, maar dan met een extra shot persoonlijkheid en een gezonde punkattitude, tillen ze het genre naar een andere dimensie.Live gaan ze all-in: volledig analoge machines, ronkende synths en old-school drumpads die je ribbenkast doen trillen. Verwacht donkere baslijnen, industriële beats en vocals met een boodschap. Eerste liveshow ooit — mis het niet!afterparty: Death DiscoDeath Disco is het dark-wave/EBM-feestconcept van Bram, Mich, Juju &amp;amp; co — een plek waar duistere vibes en dansbare beats elkaar ontmoeten in een rookgordijn van stroboscooplicht. Na de live shows serveren ze perfect passende, pikzwarte maar onweerstaanbaar swingende plaatjes. BRAMSKI BEAT x JUJU nemen het over met een all-vinyl set die je zonder pardon de nacht in sleurt. Zwart, luid en dansbaar. Zoals het hoort."
  },
  {
    "Title": "SONS",
    "DateString": "2026-02-21T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/sons-2",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/d43d/6f/5fcb906816f31449c8fe73fb33eb6576ca007137.jpg",
    "Location": "De Kreun",
    "Description": "Met hun debuutalbum ‘Family Dinner’ (2019) brak SONS door in de Benelux, en met opvolger ‘Sweet Boy’ (2022) veroverden ze ook Duitsland, Frankrijk, Zwitserland en Griekenland. Hun mix van rauwe energie, krachtige rock, catchy refreinen en stevige riffs bracht hen naar grote festivals als Rock Werchter, Pukkelpop, Pinkpop, Trans Musicales en Iceland Airwaves, én leverde hen supportshows op voor Royal Blood, Wolfmother en Jack White.Met ‘Do My Thing’ slaan ze een nieuwe weg in: de band laat hun vertrouwde explosieve garage-rockgeluid even achter zich en kiest voor een frisser, helderder geluid. Om dat universum verder uit te bouwen, schakelden ze Dave McCracken in – de man achter het sexy groove-geluid van “The Architect” van dEUS. Met samenwerkingen met Ian Brown (The Stone Roses), A$AP Rocky, Beyoncé en Depeche Mode op zijn palmares, tilt McCracken de sound van SONS naar een nieuw niveau.Hoe dat live klinkt? Ontdek het op 21 februari bij Wilde Westen!&amp;nbsp;support: PyoWat als Joy Division en Ekkstacy verdwaald waren geraakt in het neonverlichte Hongkong van de jaren 90? Zo klinkt Pyo, het zinderende project van de in Brussel gevestigde Karel Piot dat net geselecteerd werd voor de finale van De Nieuwe Lichting. Ergens tussen Ekkstacy, Mareux en The Haunted Youth in, is de muziek van Pyo een mix van moderne postpunk en de new wave-sounds van de jaren 80. Door zijn pakkende en introspectieve teksten dompelt Pyo je meteen onder in zijn retro cyberpunkuniversum."
  },
  {
    "Title": "KAMEEL",
    "DateString": "2026-02-22T20:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/kameel",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/e66b/b3/012a62c7a4d4da1cc927f13815f3263eb885adb7.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowKameel is een avontuurlijk trio dat moeiteloos laveert tussen jazz, rock, elektronica en vrije improvisatie, altijd met een filmische ondertoon die je meesleept van de eerste noot tot de laatste. Hun sound is tegelijk groovy en rauw, speels en onvoorspelbaar.In november 2025 verschijnt hun gloednieuwe plaat bij Pang Pang Records. Voor het eerst laat de band ook vocalen toe, met bijdragen van niemand minder dan Rudy Trouvé en Tim Vanhamel, wat hun universum een frisse en verrassende dimensie geeft.De afgelopen jaren bouwde Kameel gestaag aan een eigenzinnig repertoire met de albums Barkas (2020) en Trugschluss (2023). Met de nieuwe release zetten ze die zoektocht verder – compromisloos, gedurfd en altijd in beweging."
  },
  {
    "Title": "FEMKE GYSELINCK / GRIP &amp; B&#039;ROCK ORCHESTRA - Torment of Hearts + SCHNTZL",
    "DateString": "2026-02-27T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/femke-gyselinck-grip-b-rock-orchestra-torment-of-hearts-schntzl",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/b610/b7/df5667b1ea89f8da954459279aef70440db04d0d.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "Een dialoog tussen muziek en dansEnkele jaren geleden maakte Femke Gyselinck kennis met de dialoogcantates van Bach.&amp;nbsp;Johann Sebastian Bach, barokker kan het niet. In zijn oeuvre nemen de dialoogcantates een bijzondere plek in, een zeldzame kans om hemel en aarde in gesprek te horen.&amp;nbsp;Femke en B’Rock Orchestra stelden zich samen de volgende uitdaging: Welke andere muziek kan hieraan toegevoegd worden die een contrast creëert, maar geen chaos? Hoe kan een geheel ontstaan tussen muziekcomposities uit verschillende periodes en tijdsgeesten? Welke dansante taal kan er daarbij gehanteerd worden?&amp;nbsp;"
  },
  {
    "Title": "BOOTCAMP ABLETON (GEVORDERDEN)",
    "DateString": "2026-02-28T10:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/bootcamp-ableton-gevorderden",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7846/b3/b1189d6d2bca79500d3666d364e9fd1c7c40050d.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "Tweedaagse Ableton Live Advanced cursus&amp;nbsp;Data: 28 februari en 1 maart. Op 28 februari van 10-17 uur en op 1 maart van 9-16 uur.Volgde je al onze beginnerscursus voor Ableton Live? Of heb je zelf al je eerste stappen in het programma gezet? Dan is deze Advanced cursus iets voor jou!Ableton Live is meer dan een muziekproductie- en performance-tool. Deze krachtige DAW bevat alle tools die je nodig hebt om een professionele en hoogwaardige mix te maken!&amp;nbsp;Mixing en Mastering is een combinatie van &#039;technische vaardigheid&#039; en &#039;artistieke finesse&#039; - en je moet beide ontwikkelen om top resultaten te bereiken. In deze workshop wordt de kunst en de wetenschap van het mixen en masteren in Ableton Live verkend. Aan de hand van een bestaande track leer je alles over ‘4D Mixing’, mixing workflow en tips &amp;amp; tricks om het mix proces te versnellen. Alle mixing tools en -technieken komen aan bod: compressie, EQ, panning, reverb, Drum Buss device, en nog veel meer… Aan het einde van deze workshop heb je een beter begrip van hoe je geweldig klinkende 4-dimensionale mixen kunt maken.&amp;nbsp;Programma&amp;nbsp;Preparing to Mix - een blik op de tools die je nodig hebt om een goede mix te maken&amp;nbsp;Translation - hoe maak je mixen die goed klinken op elk systeem?&amp;nbsp;De 4 dimensies van een mix - het begrijpen van de verschillende dimensies van een mix en de tools die gebruikt worden om ermee te werken.&amp;nbsp;Mixing in Ableton Live - Ableton Live’s specifieke concepten en workflows voor het opbouwen van een perfecte mix&amp;nbsp;PluginsSpecifieke Tips &amp;amp; Tricks voor het mixen van beats, bass, synths, vocals, ...&amp;nbsp;Exporteer je mix - Nu het goed klinkt, wat moet ik doen?&amp;nbsp;Mastering - Wat is het, en wat is het niet? Heb ik het nodig, en hoe doe ik het?&amp;nbsp;Prijs: €152 / Leerlingen Conservatorium Kortrijk &amp;amp; jambox gebruikers: €102 (mail naar muziekcentrum@kortrijk.be) &amp;nbsp;/ Uitpas € 32"
  },
  {
    "Title": "TRIPLE BILL: BERTRAND CUILLER &amp; FRANCESCO TRISTANO + GOMEZ",
    "DateString": "2026-02-28T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/triple-bill-bertrand-cuiller-francesco-tristano-gomez",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f6de/4a/74ff59f8ee3df5eda6433fc25a8c1137261bfe84.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "De Luxemburgse pianovirtuoos Francesco Tristano en de Franse meesterklavecinist Bertrand Cuiller brengen voor de eerste keer samen een programma over de muzikale eeuwen heen.&amp;nbsp;Het lijkt misschien een bijzondere combinatie, het toetsengeweld van een moderne vleugel tegenover de frêle en breekbare klank van het klavecimbel, maar de twee virtuozen vullen elkaar heel goed aan en stelden een programma samen waarin die tegenstelling net versterkend werkt. Ze worden ook technisch ondersteund: de instrumenten worden op een respectvolle manier uitversterkt en in balans gebracht.&amp;nbsp;Op het programma: een spelletje muzikaal ping-pong met werken van Bach, Byrd, Gibbons, Froberger en Tristano zelf.&amp;nbsp;Deze werken vormen de basis van een muzikale uitwisseling tussen twee muzikanten met totaal verschillende achtergronden: ze dagen elkaar uit, zoeken elkaars grenzen op en laten de sonoriteit van beide instrumenten samensmelten tot een dialoog tussen traditie en hedendaags experiment.&amp;nbsp;Een vingervlugge tête-à-tête waarin virtuositeit en verrassing ten volle uitgespeeld worden!&amp;nbsp;&amp;nbsp;Aftershow GOMEZGomez is een fictief personage dat leeft tussen droom en het hiernamaals. Hij reist door een klankwereld vol harpen, banjo’s, casio’s, lapsteelgitaren en mystieke beats. De muziek van Gomez is een mengeling van zachte, vloeiende of pulserende klanken in een volledig ondefinieerbaar hybride genre.&amp;nbsp;De set voor diatonische harp, lapsteelgitaar en elektronica werd oorspronkelijk gecomponeerd als onderdeel van de geluidskunstinstallatie “one of us” van kunstenares Inger Elisabeth Gleditsch, opgebouwd uit afval uit zeeën en rivieren.&amp;nbsp;Met de steun van het Huis van het Groothertogdom Luxembourg in Brussel"
  }
]