[
  {
    "Title": "SCOTT MCCLOUD",
    "DateString": "2026-05-08T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/scott-mccloud",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0f34/54/1fbe088fb0a859c3adbce8dbc5018f5316bca3f9.jpg",
    "Location": "De Kreun Café",
    "Description": "Scott McCloud (Girls Against Boys, Soulside, Paramount Styles, AGRIO) brengt begin 2026 zijn eerste soloalbum Make it to Forever uit via God Unknown Records.&amp;nbsp;Voor McCloud zijn relaties gesprekken: soms vluchtig, soms levenslang, soms stilgevallen om later weer verder te gaan. Een magisch optreden met Girls Against Boys in Athene liet zo’n onuitwisbare indruk achter dat hij er jaren later besloot een plaat op te nemen. Athene werd decor én tijdcapsule.De songs draaien rond herinneringen, romances en ideeën die blijven bewegen. Over muziek als gesprek — tussen riffs, vragen, antwoorden en grapjes — en uiteindelijk het langste gesprek van allemaal: dat met jezelf.Het album werd opgenomen door Dimitris Dimitriades in Zero Gravity Studios (Athene) en begon als een rauw experiment: stem en akoestische gitaar, puur en kwetsbaar. Tijdens latere bezoeken groeiden de songs, met gastmuzikanten, zonder die intimiteit te verliezen.Scott McCloud was in de late jaren ’80 gitarist bij Soulside (Dischord) en richtte in de jaren ’90 Girls Against Boys op (Touch &amp;amp; Go, DGC).&amp;nbsp;"
  },
  {
    "Title": "JEROEN LEENDERS",
    "DateString": "2026-05-09T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/jeroen-leenders",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/cb9f/3c/459d9645c8021d225a5c683a1a2aeb140e916514.jpg",
    "Location": "De Kreun",
    "Description": "&amp;nbsp;De nieuwe generatie raast eraanGeschiedenis is een trein die genadeloos doordendert. Die onderweg denkbeelden verslindt om er nieuwe voor in de plaats te zetten. Jeroen beseft als geen ander dat hij deel uitmaakt van een generatie die met één been in het verleden en het andere in de toekomst staat. Een verleden waarin alles duidelijk was maar niemand echt vrij. Waarin het privilege van de één betaald werd met het ongemak van de ander.&amp;nbsp;&amp;nbsp;Hoe heftig zijn mede-dinosaurussen zich ook verzetten tegen hun uitsterven, het zijn hooguit de laatste stuiptrekkingen van een gedoemd bestaan. Aan de horizon kondigt de nieuwe, multipolaire wereld zich aan waarin geen grootmachten bestaan, waarin identiteit een hoogstpersoonlijke aangelegenheid is en waarin ook dieren personen zijn.&amp;nbsp;Anders dan voorheen volgen de veranderingen elkaar in razend tempo op. Je tijd uitzitten met je oude manier van bestaan is hoe langer hoe minder een optie. Haak aan en grijp de laatste kaartjes, want wie niet mee is raakt hopeloos achterop.&amp;nbsp;‘Laatste Kaartjes’ is een zaalshow voor wie de dingen liever niet aan het toeval overlaat, met afgewerkte grappen op volle snelheid. Uiteraard zal het er anarchistisch aan toe gaan. Jeroen streeft er immers naar de mens al lachend te laten instemmen met zaken waar die het stellig mee oneens is.&amp;nbsp;"
  },
  {
    "Title": "MATINEE: VICE VERSA",
    "DateString": "2026-05-10T11:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/matinee-vice-versa",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f1e1/27/87e8a477858c57b758ed7016b3c5de8d5514b77d.jpg",
    "Location": "Concertstudio",
    "Description": "Jazz door drie compositorische genieënVice Versa ontstond uit de nood van Belgische pianist Bram De Looze (LABtrio, Joey Baron, Hank Roberts) om met artiesten samen te werken die als een natuurlijke aanvulling aanvoelen. Al snel vond hij met de New Yorkse meesterdrummer Eric McPherson (Jackie Mclean, Andrew Hill, Fred Hersch) en het Berlijnse contrabastalent Felix Henkelhausen (Jim Black, Nate Wooley, Lotte Anker) twee gelijkgezinden: compositorische genieën met een eindeloze ritmische vindingrijkheid.Dit veelzijdige, experimenterende trio legt de lat hoog wat betreft expressieve interpretatie en inventieve creativiteit. Verwacht uitzonderlijke benaderingen waarbij de muzikale regels voortdurend veranderen zonder aan continuïteit en dynamiek in te boeten. Verwacht, kortom, een intrigerende muzikale synthese waarbij de geest van traditionele jazz spontaan opduikt tijdens een intuïtieve ontdekkingsreis geleid door vrije improvisatie.Debuutalbum ‘Vice Versa’ verscheen in 2023 bij Dox Records. In januari 2025, toen Bram De Looze Artist in Residence was op het Brussels Jazz Festival in Flagey, namen ze hun tweede album live op voor een uitverkochte Studio 1. Hun nieuwe album verschijnt begin 2026 bij het Nederlandse Challenge Records."
  },
  {
    "Title": "JEROEN LEENDERS - EXTRA SHOW",
    "DateString": "2026-05-10T20:15:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/jeroen-leenders-extra-show",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7ad8/24/9e29c888e4366d2f001a69535dbe85a1c504a829.jpg",
    "Location": "De Kreun",
    "Description": "Geschiedenis raast voort als een trein. Wie geen ticketje richting toekomst heeft, is gedoemd achter te blijven met zijn of haar oude manier van leven. Gelukkig vindt Jeroen Leenders dat allemaal maar om te lachen. En hij hoopt dat jij al lachend zal instemmen met de zaken waar je het eigenlijk niet mee eens bent.&amp;nbsp;Geschiedenis is een trein die genadeloos doordendert. Die onderweg denkbeelden verslindt om er nieuwe voor in de plaats te zetten. Jeroen beseft als geen ander dat hij deel uitmaakt van een generatie die met één been in het verleden en het andere in de toekomst staat. Een verleden waarin alles duidelijk was maar niemand echt vrij. Waarin het privilege van de één betaald werd met het ongemak van de ander.  &amp;nbsp;&amp;nbsp;Hoe heftig zijn mede-dinosaurussen zich ook verzetten tegen hun uitsterven, het zijn hooguit de laatste stuiptrekkingen van een gedoemd bestaan. Aan de horizon kondigt de nieuwe, multipolaire wereld zich aan waarin geen grootmachten bestaan, waarin identiteit een hoogstpersoonlijke aangelegenheid is en waarin ook dieren personen zijn. Anders dan voorheen volgen de veranderingen elkaar in razend tempo op. Je tijd uitzitten met je oude manier van bestaan is hoe langer hoe minder een optie. Haak aan en grijp de laatste kaartjes, want wie niet mee is raakt hopeloos achterop. &amp;nbsp;&amp;nbsp;‘Laatste Kaartjes’ is een zaalshow voor wie de dingen liever niet aan het toeval overlaat, met afgewerkte grappen op volle snelheid. Uiteraard zal het er anarchistisch aan toe gaan. Jeroen streeft er immers naar de mens al lachend te laten instemmen met zaken waar die het stellig mee oneens is. &amp;nbsp;Dit is een zittende voorstelling.&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "MICAH P. HINSON",
    "DateString": "2026-05-14T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/micah-p-hinson",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/60d6/70/e0096afaa33ccc0f4a1645e1bb5e805a2167eb6e.jpg",
    "Location": "De Kreun",
    "Description": "Na een geslaagde passage op Sonic City 2025 keert Micah P. Hinson terug naar Kortrijk!Begin 2020 stond Micah P. Hinson op het punt de muziek definitief achter zich te laten. De Amerikaans-Spaanse singer-songwriter, die toen al tien lovend ontvangen albums op zijn naam had en een trouwe schare fans, voelde zich creatief vastgelopen en kampte met een diepe depressie.De uitbraak van de COVID-19-pandemie bracht onverwacht ruimte voor reflectie. Hinson nam zich één duidelijke beslissing voor: voortaan zou hij alleen nog schrijven over het heden. Maar eerst moest hij afsluiten. Hij dook zijn archieven in en werkte nummers af die hij de voorbije 25 jaar had geschreven. Het resultaat was I Lie to You, zijn elfde album: een laatste terugblik, het einde van een hoofdstuk en tegelijk het begin van een nieuw tijdperk.I Lie to You betekent ook een belangrijk keerpunt in zijn carrière. Voor het eerst werkte Hinson samen met een externe producer: Alessandro “Asso” Stefana (PJ Harvey, Mike Patton). Die hielp de songs te ontdoen van franjes en terug te brengen tot hun emotionele kern. Via Stefana kwam Hinson bovendien terecht bij Ponderosa Music Records, het gerenommeerde Italiaanse label waar ook Patti Smith, Blonde Redhead en zijn vroege helden The Jesus and Mary Chain thuis zijn.Voor fans van: Sonic Youth, Dinosaur Jr., The Cure"
  },
  {
    "Title": "TUUR FLORIZOONE &amp; ANU JUNNONEN",
    "DateString": "2026-05-17T20:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/tuur-florizoone-anu-junnonen",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1923/77/7dcaad93d91fcc8a72e599e2b13b547c7738b37c.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowAnu Junnonen en Tuur Florizoone vormen al 20 jaar een uniek muzikaal duo. Hun liveoptredens zijn bekend van een eigentijdse crossover tussen jazz, hippe folk, diepgaande emotie en een portie humor. De Finse origines van Anu laten zich duidelijk voelen in haar composities. De samenwerking met de creatieve en virtuoze accordeonist Tuur Florizoone is dan ook op haar lijf geschreven. Tuur is een muzikale duizendpoot die zijn stempel heeft gedrukt op tal van indrukwekkende projecten.De samenwerking van Anu en Tuur begon tijdens hun studies aan het conservatorium van Brussel. Met de groep &#039;aNoo&#039; hebben ze samen twee albums uitgebracht: “The Luckless lands of the North” (Homerecords 2007) en &quot;Sinipiika” (Prova Records 2011). Voortbouwend op deze hechte band gaan de twee muzikanten nu op zoek naar nieuwe spelletjes, nieuwe woorden, risicovolle acrobatiek en gedurfde combinaties. Jazz, improvisatie, folk, techno of tango, alles is een bron van inspiratie. Met hun originele duo-formule (zang en accordeon) willen ze buiten de gebaande paden treden, weg van alledaagse geluiden.&amp;nbsp;"
  }
]