[
  {
    "Title": "MATINEE: REGINALD MOBLEY",
    "DateString": "2026-03-01T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-reginald-mobley",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/85f7/65/5754636c9dc542bb6a2249b83886459090cf400c.jpg",
    "Location": "Concertstudio",
    "Description": "De glinsterende stem van een contratenorNet zoals Bach, Mozart en Beethoven de ruggengraat vormden van het West-Europese muzikale canon, ontstond aan de overkant van de Atlantische Oceaan in de Amerikaanse koloniën een ander fundament: slavenliederen en negrospirituals. Deze muziek, geboren uit pijn en hoop, groeide uit tot de bron van ragtime, barbershop, jazz, gospel, blues, rock en zelfs techno en elektronische muziek. De universaliteit en kracht van deze traditie heeft zich wereldwijd verspreid en onze muzikale geschiedenis voorgoed veranderd.De Amerikaanse contratenor Reginald Mobley, genomineerd voor een Grammy en geroemd om zijn ‘glinsterende stem’, verkent dit erfgoed in een nieuw samengesteld programma samen met de Franse pianist Baptiste Trotignon. Ze brengen liederen van zwarte componisten als H.T. Burleigh, Florence Price en J. Rosamond Johnson, op teksten van grootheden zoals Langston Hughes en Paul Laurence Dunbar. Dit repertoire verscheen ook op het album Spirituals, uitgebracht door ALPHA Classics, Gramophone Label of the Year 2020."
  },
  {
    "Title": "SYMFONIEORKEST VLAANDEREN & KORTRIJKS SYMFONISCH ORKEST: Schubert X Mozart",
    "DateString": "2026-03-01T16:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/symfonieorkest-vlaanderen-kortrijks-symfonisch-orkest-schubert-x-mozart",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4655/b0/ca101e9b4723287461f2d837835e208644e9f37e.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "Twee orkesten in perfecte harmonieHet Kortrijks Symfonisch orkest bijt de spits van dit concert af met muziek van Gabriel Fauré: de Pelléas et Mélisande Suite. Deze suite, gecomponeerd in 1898 als toneelmuziek bij het symbolistische stuk van Maurice Maeterlinck, ademt een sfeer van verfijnde melancholie.&nbsp;Uit de suite worden drie delen gebracht: eerst de ingetogen Prélude (Quasi adagio), gevolgd door de sierlijke Sicilienne (Allegretto molto moderato), en tot slot het indringende La Mort de Mélisande (Molto adagio).'&nbsp;Een selectie die de essentie van Faurés poëtische en ingetogen stijl belichaamt. Het voorprogramma duurt ongeveer 15 minuten en zet meteen de toon voor een concert dat balanceert tussen lyrische schoonheid en de reflectie op vergankelijkheid.&nbsp;Mozart's Klarinetconcerto is het laatste werk dat hij voltooide in 1791, het jaar waarin hij stierf op amper vijfendertigjarige leeftijd. En wat ons betreft zijn mooiste.&nbsp;"
  },
  {
    "Title": "Trail up North: RAGAZZE QUARTET + ICTUS STRING TRIO",
    "DateString": "2026-03-06T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/trail-up-north-ragazze-quartet-ictus-string-trio",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/75fc/0d/63a7807dec3ddeb1530bbee694629c0eed17f3ba.jpg",
    "Location": "Concertstudio",
    "Description": "Ictus – Laure M. Hiendl&nbsp;Loops, samples, patronen: overgeërfd uit de pop- en elektrocultuur behoren nieuwe tools nu tot de gereedschapskist van componisten uit de klassieke traditie.&nbsp;Chronochromatic Variations III is een laatromantische evocatie. Laure M. Hiendl gebruikt melodieën uit een strijktrio van de Anglo-Ierse componist E.J. Moeran (1894–1950), die zijn opgeknipt, geloopt, bewerkt en opnieuw samengevoegd. Het resultaat is, in Hiendls eigen woorden, ‘een geanimeerd stilleven’: een stilgezette klank die verwijst naar een nostalgie naar het Engelse pastorale, maar ons onderhuids toch verontrust in zijn uitvoering.Aisha Orazbayeva, viool - Victor Guaita, altviool - Geert De Bièvre,&nbsp;cello"
  },
  {
    "Title": "NIGHT AIR @ Transfo Zwevegem met o.a. Natasha Pirard, Suzan Peeters & Marilou Dejans,...",
    "DateString": "2026-03-07T15:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/night-air-transfo-zwevegem-met-o-a-natasha-pirard-suzan-peeters-marilou-dejans",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7e6e/f9/8e1251929df354d0c6d60ba5f937572938fa84d7.jpg",
    "Location": "Transfo Zwevegem",
    "Description": "Night Air kleurt niet alleen graag buiten de lijntjes, het probeert die lijn gewoon te verleggen. Het experimentele minifestival binnen Festival Kortrijk brengt nationale en internationale artiesten uit verschillende genres samen op de Transfo Zwevegem. De verschillende tot de verbeelding sprekende locaties van de voormalige elektriciteitscentrale worden omgetoverd tot concertzalen, op maat gemaakt van de performances die we er presenteren.&nbsp;Als bezoeker kies je zelf wat je ziet: een ticket geeft toegang tot het volledige programma."
  },
  {
    "Title": "MATINEE: I SOLISTI - 'Nothing Happens, Twice'",
    "DateString": "2026-03-08T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-i-solisti-nothing-happens-twice",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/608c/09/36e1448442b595cf1245fa5314bd49c7c1fa28a7.jpg",
    "Location": "Concertstudio",
    "Description": "Zoeken naar wat zich in leegte verstopt&nbsp;Emile Souvagie – I SOLISTI Next Generation&nbsp;In 1953 opende John Cage de piano, maar besloot geen toets aan te raken. Datzelfde jaar liet Samuel Beckett vier acteurs de scène betreden om hen te laten wachten op iets dat wellicht nog altijd moet komen. Beiden braken met de erfenis van hun respectieve kunstvormen en maakten voor het eerst van de leegte een protagonist.In ‘Nothing happens, twice’ vragen twee acteurs en drie muzikanten zich af waarom beide kunstvormen tegelijkertijd tot stilstand leken te komen en wat dat vertelt over onze wereld. Als jonge kunstenaars in een tijdsgewricht met nieuwe krampen kijken ze naar de stilte tussen de woorden, de ruimte tussen de noten, de leegte en wat zich daar verstopt.Deze voorstelling zit in het CUBO-aanbod van Schouwburg Kortrijk. Word CUBO-lid en krijg onbeperkt toegang tot podium- en filmaanbod in Kortrijk voor slechts €20 per maand. CUBO tickets worden gecontroleerd aan de ingang. Deze voorstelling maakt deel uit van Festival Kortrijk 2026.&nbsp;"
  },
  {
    "Title": "FIREPLACE",
    "DateString": "2026-03-08T14:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/fireplace-3",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/d9a5/0f/288575d8c1d087ccc4227f292de12ff05f1e8b28.jpg",
    "Location": "H. Hart Kortrijk",
    "Description": "Op de slotdag van het tweede weekend van Festival Kortrijk nemen jonge muzikale avonturiers het over tijdens het sfeervolle minifestival Fireplace. Op zondagmiddag worden bezoekers getrakteerd op korte, maar krachtige liveoptredens van opkomend talent. De conservatoria van Brussel, Gent, Mons en Lille kiezen elk twee van hun beste masterstudenten of ensembles, die hun meest sprankelende repertoire delen. Verwacht een kleurrijke mix van stijlen: van jazz tot pop, van barok tot hedendaagse klanken – een fascinerende staalkaart van de nieuwe generatie muzikanten.&nbsp;Fireplace staat voor concerten van twintig minuten, verspreid over verrassende, unieke locaties. Jij bepaalt je eigen route en laat je meevoeren op een ontdekkingsreis, waarin elk muzikaal pad je iets anders laat ervaren. Perfect voor jong en oud!&nbsp;&nbsp;"
  },
  {
    "Title": "EX NIHILO",
    "DateString": "2026-03-08T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ex-nihilo",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f07e/2d/7d430565940e55891cf69337f69176a482b95f60.jpg",
    "Location": "Abby Kortrijk",
    "Description": "Het recital van Brecht Valckenaers vormt een doorlopend muzikaal geheel met drie lagen. Centraal staat Musica Ricercata van György Ligeti, een reeks van elf korte composities waarin de jonge Ligeti experimenteerde met de meest eenvoudige muzikale bouwstenen. Elk deel voegt een nieuwe noot toe, waardoor stap voor stap een rijker klankuniversum ontstaat – van pure eenvoud naar steeds complexere structuren.&nbsp;Tussen deze delen weeft Valckenaers twee aanvullende lijnen: korte werken van 20e-eeuwse componisten die verwant zijn aan Ligeti’s zoektocht, en vijf gloednieuwe intermezzi die hij speciaal voor dit recital componeerde. Het resultaat is een gelaagd programma dat het verleden, het heden en de toekomst met elkaar verbindt. Zo ontstaat een spannende dialoog tussen Bartóks invloed, Ligeti’s vernieuwingsdrang en Valckenaers’ eigen creatieve stem.&nbsp;"
  },
  {
    "Title": "SIEM REAP",
    "DateString": "2026-03-12T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/siem-reap",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/411a/af/f0c392f8e6decc5173361737a45b31ec4ddfac25.jpg",
    "Location": "De Kreun Café",
    "Description": "Wishin' I Was Fishin'Siem Reap is het soloproject van Gilles Demolder (bekend van Oathbreaker en Wiegedood). Samen met Wim Coppers (Wiegedood, Crouch) en Jasper Hollevoet (Ventilateur) verkent hij thema’s als mannelijkheid, familie en relaties. Dat gebeurt in een trage, intense en warme sound die doet denken aan bands als Spain, The Microphones, Codeine en Slint.Na het uiteenvallen van Oathbreaker en een stukgelopen relatie begon Demolder nummers te schrijven die nergens anders pasten. Met enkel een laptop en goedkope microfoons ontstond Siem Reap en het zelf opgenomen debuut Now What? (2023). Lo-fi, pijnlijk direct en biechtend in toon, klonk het als een mengeling van dagboekfragmenten en dronken voicemails — een meedogenloos eerlijke blik op de ruïnes van zijn twintiger jaren.In 2025 verschijnt opvolger Wishin’ I Was Fishin’, dit keer uitgebracht op zijn eigen label Heimlich Manoeuvres. De intimiteit blijft, maar het geluid opent zich: rijker, dynamischer en voller dankzij de bijdragen van Coppers (drums) en Hollevoet (bas). De nummers blijven geworteld in confessional songwriting en vervormde folk, met Demolders droge gevoel voor humor als rode draad.De songs van Siem Reap zijn geen klaagzangen, maar wrang-komische verhalen die schipperen tussen humor en verdriet. Demolder zet zichzelf neer als antiheld — met veel zelfspot en eerlijkheid — en schrijft over trauma, relaties en alledaagse absurditeit.Het klinkt minder zwaar dan zijn metalverleden, maar de intensiteit blijft, dit keer verpakt in vreemde beelden, nachtelijke monologen en een wrange glimlach die de spiegel voorhoudt.&nbsp;Support: Ignatz&nbsp;Ignatz is het alter ego van de Belgische muzikant Bram Devens. De naam komt uit de Krazy Kat-strips van George Herriman (1910), waarin Ignatz de muis graag bakstenen naar Krazy Kat gooit – iets wat Krazy Kat als liefde ziet. Ignazt komt zijn nieuwe plaat voorstellen die uitkomt in januari ‘I don’t know’&nbsp;Devens neemt die naam aan voor zijn eigen stapel “bakstenen”: sobere, emotionele songs vol effecten, tapeslijtage, improvisatie en spontaniteit. Zijn muziek vertrekt uit een minimale folkbasis, doet denken aan V.U. of Henry Flynt, maar klinkt omgekeerd en losgezongen, met ruwe versieringen, verstrengelde loops en een stem die wegzakt in een gebarsten drawl.Naast zijn solowerk speelde hij met de band De Stervende Honden, die begin 2023 stopte met optreden."
  },
  {
    "Title": "MARIA ISKARIOT",
    "DateString": "2026-03-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/maria-iskariot",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/3d64/99/624cf3ee66385fb7fa8140392a1a1f5a9730fb84.jpg",
    "Location": "De Kreun",
    "Description": "Maria Iskariot is de patroonheilige van betwistbaar gedrag. Het is punkrock uit Gent. Lawaaierig strofe, refrein, strofe. Liefde voor de onbeminden, vijgen na Pasen, maar in de eerste plaats een knieval voor de zondaars. Zoals het een band op platenlabel Burning Fik (Hang Youth, Gotu Jim) betaamt poogt Maria Iskariot een greintje hoop te vinden in schier allesomvattende hopeloosheid. Gelijke delen paniekaanval, pseudofilosofisch pamflet en vlam-in-de-pan nodigt de punkband uit Vlaanderen eenieder die zich eveneens op de limieten begeeft uit met hen te komen rellen – in een gecontroleerde setting welteverstaan. En niets slopen hoor, want er is al zoveel kapot.Hun EP EN/EN kwam uit op het Nederlandse label Burning Fik en ze zijn bekroond als winnaars van Humo’s Rock Rally 2024. Dat jaar speelde ze meer dan 100 concerten in binnen- en buitenland. &nbsp;Maria Iskariot is niet alleen een punkband, maar ook een artistiek en maatschappelijk statement. Ze laten zien dat Nederlandstalige punk niet alleen nostalgisch hoeft te zijn, maar ook urgent en vernieuwend kan klinken.Op 31 oktober 2025 releasen ze hun debuutplaat Wereldwaan, die nu al door critici wordt beschouwd als een tijdloze cultplaat die de wanen van de dag tegen het licht van de eeuwigheid houdt.&nbsp;support: StakattakStakattak is het Belgische familie trash pop trio en de zelfverklaarde voorloper van Raout Rock. Verwacht nummers uitgekookt tot de essentie en een explosieve liveshow met een minimale set-up. Drums, gitaar en zang verwringen de realiteit tot een onweerstaanbare trip."
  },
  {
    "Title": "SYNTHLAB",
    "DateString": "2026-03-14T14:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/synthlab",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/c352/5b/38691d0c625c972c6d39be68f245e791ca70101d.jpg",
    "Location": "De Kreun",
    "Description": "Synthlab met Janus Coorevits - zaterdag 14/03Tijdens deze workshop neemt Janus Coorevits je mee in de wereld van synthesizers. Leer hoe de intussen iconische Compact Disk Dummies-sounds ontstaan en hoe je zelf unieke klanken kunt creëren. Janus deelt zijn kennis over de basisprincipes van synths en demonstreert verschillende kleuren en texturen op zijn eigen collectie synths.&nbsp;"
  },
  {
    "Title": "CHANTAL ACDA & THE NORTH SEA DRIFTERS",
    "DateString": "2026-03-14T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/chantal-acda-the-north-sea-drifters",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/ff20/90/b9e06930f6c9ed91bc3be9390a00d546bb9caadc.jpg",
    "Location": "Kerk Sint-Denijs",
    "Description": "Op 3 mei 2024 verscheen Chantal Acda’s nieuwste album, Silently Held.Deze release sluit aan bij haar eerdere muzikale avonturen, waaronder Let Your Hands Be My Guide (2013), The Sparkle In Our Flaws (2015), Bounce Back (2017), Puwawau (2019) en Saturday Moon (2021). Elk van deze albums vond wereldwijd weerklank.In de stille omhelzing van de muziek onthult Chantal een rauwe en eerlijke reflectie op kwetsbaarheid, waar fouten en gevoelens een plek mogen krijgen. Silently Held biedt een toevluchtsoord en nodigt luisteraars uit deel te worden van een stille gemeenschap, waar de subtiliteiten van het mens-zijn centraal staan. Met elke noot en elk woord creëert Acda een ruimte waarin imperfecties niet alleen worden erkend, maar ook gevierd. Zo ontstaat een diepe, intieme verbinding tussen artiest en publiek.Het album klinkt als een getuigenis van de schoonheid die schuilt in onze gebreken en gevoelens, en nodigt ons uit om deze met gratie en oprechtheid te omarmen.Het project wordt live gebracht door Frederik Madou op contrabas, Eric Thielemans op drums, Hendrik Lasure op piano en Chantal Acda op gitaar en zang."
  },
  {
    "Title": "Matinee: Liederzeit - Die schöne Müllerin",
    "DateString": "2026-03-15T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-liederzeit-die-schone-mullerin",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0b14/93/9f4b866c3c76df4a7fe5437fc3acee88a50292c3.jpg",
    "Location": "Concertstudio",
    "Description": "Franz Schubert –&nbsp;Die schöne Müllerin D795&nbsp;Die schöne Müllerin&nbsp;behoort tot de absolute meesterwerken van&nbsp;Franz Schubert&nbsp;en van de romantische liedkunst. Deze ontroerende cyclus voltooide de 26-jarige Franz Schubert in november 1823 – die toen leed aan een slechte gezondheid en periodes van twijfel aan zichzelf. Deze liedcycli vertelt het&nbsp;lot&nbsp;van een jonge molenaarsgezel die hopeloos verliefd wordt op de mooie dochter van de molenaar.Schuberts muziek vangt op sublieme wijze het verlangen, de jaloezie, het verdriet en de berusting van de jonge man. Het resultaat is een&nbsp;meeslepende innerlijke reis&nbsp;– intiem, pijnlijk mooi en universeel herkenbaar."
  },
  {
    "Title": "YONG YELLO",
    "DateString": "2026-03-18T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/yong-yello",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/49e4/9c/930ba5b72ff38c851f690cbffebbee35412df701.jpg",
    "Location": "De Kreun",
    "Description": "Yong Yello is de alias van rapper en producer Yello Staelens. In een vorig leven was hij lid van het legendarische hiphopcollectief Eigen Makelij, waar hij samenwerkte met onder anderen Tourist LeMC. Later groeide hij uit tot de vaste producer van Glints.&nbsp;Vandaag is Yong Yello niet minder dan de kroonprins van het Antwerpse lied. Zijn muziek? Een broeierige cocktail van 90s-hiphop, soul, funk en filmsoundtracks uit de jaren ’60 en ’70. Voeg daar de pen van een chansonnier en het oor voor een poprefrein aan toe, en je hebt Yello: groovy én gevoelig.In 2020 haalde hij met zijn single ‘Als Ge Slaapt’ de finale van De Nieuwe Lichting, en dat bleek slechts het voorspel. Met zijn debuutplaat ‘Marcel &amp; Het Magnetisme Van De Goot’ (2021) dropte hij bommen als Cirkels, Waanzin en Luchtkasteel. Het publiek ging massaal overstag: uitverkochte zalen, festivalweides die “Yelloooooo” scandeerden, en een welverdiende MIA-nominatie in de categorie Hip-Hop/R&amp;B.Fast forward naar 2025: vier jaar later bevestigt Yong Yello zijn status met de nieuwe single ‘Ik moet dringend op vakantie’ – een titel die klinkt als een WhatsApp-status, maar ook best letterlijk te nemen is. De track is de voorbode van zijn langverwachte tweede album, dat dit najaar verschijnt. En hij komt het op 18 maart live bij ons voorstellen!De song snijdt een hyperactueel thema aan: een workaholic op het randje van een burn-out, slapeloos, gestrest, maar toch stug blijven doordoen – herkenbaar voor pakweg een kwart van de Belgen. Terwijl 20% ondertussen slaappillen knabbelt, stelt Yong Yello de vraag: werken we om te leven, of leven we om te werken?Zoals altijd verpakt Yong Yello zware maatschappelijke thema’s met ironie in aanstekelijke melodieën, terwijl zijn typische, cinescope hip hop sound wordt verrijkt met vintage samba.&nbsp;&nbsp;"
  },
  {
    "Title": "TUTU PUOANE",
    "DateString": "2026-03-19T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/tutu-puoane",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0449/85/3e8e41080452bd94d1c45cb4f996c85df98db5ca.jpg",
    "Location": "Concertstudio",
    "Description": "Tickets on sale 02/06, vanaf 17 uur.Jazz Cats ClubshowPoëzie op jazztonenZangeres Tutu Puoane (geboren in Zuid-Afrika maar sinds 2005 woonachtig in Antwerpen) liep bijna tien jaar rond met de dichtbundel ‘In A Ribbon Of Rhythm’ van haar land- en leeftijdsgenoot Lebo Mashile, wiens poëzie een uniek en zeer persoonlijk inzicht biedt in de realiteit en emotionele wereld van een jonge zwarte Afrikaanse vrouw van de eerste post-Apartheidsgeneratie. Telkens wanneer Tutu de gedichten las, hoorde ze muziek.&nbsp;Uiteindelijk schreef ze een aantal songs op basis van de bundel, met als resultaat een repertoire op haar eigen Afrikaanse kruispunt van jazz, singer-songwriting en soul.&nbsp;&nbsp;De muziek vormt de basis voor een dubbel-albumproject getiteld 'Wrapped In Rhythm', waarvan het eerste deel in 2024 werd uitgebracht in een productie van de Amerikaanse muzikant/bassist/producer Larry Klein (Joni Mitchell, Tracy Chapman, Herbie Hancock ...) en dat warm werd ontvangen, onder andere met 3 South African Jazz Awards in Tutu’s thuisland.Volume twee is een samenwerking met het wereldberoemde en Grammy-winnende Nederlandse Metropole Orkest (Vince Mendoza, Jacob Collier, Lizz Wright ...), dat op unieke wijze het geluid van klassiek ensemble combineert met bigband, voorzien van arrangementen van de Belgische trompettist en arrangeur Bert Joris. De release is gepland na zomer 2025.&nbsp;Wanneer Tutu Puoane optreedt, stellen de open en losse structuren van het repertoire haar en haar band in staat de nummers vrij, geïmproviseerd en communicatief aan te pakken. Met haar prachtige stem, nuchtere charisma en natuurlijke communicatievermogen, verovert ze moeiteloos het hart van elk publiek. &nbsp;Deze voorstelling zit in het CUBO-aanbod van Schouwburg Kortrijk. Word CUBO-lid en krijg onbeperkt toegang tot podium- en filmaanbod in Kortrijk voor slechts €20 per maand. CUBO tickets worden gecontroleerd aan de ingang."
  },
  {
    "Title": "ZLDR",
    "DateString": "2026-03-20T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/zldr-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/58de/19/0ac4f400c403c01388ad0f3383fbaa315ec98143.jpg",
    "Location": "De Kreun",
    "Description": "Album release show van debuutalbum 'Broederlijk Helen'.Half Belgisch, half Frans én een muzikale uppercut. Opkomend&nbsp;talent ZLDR brengt onvergetelijke liveshows. Maak kennis met de gebroeders Thomas &amp; Julien Jacquemain en hun producer Lennert Declercq. Met krullend kapsel, een uniek, persoonlijk verhaal en sterke invloed uit de Brusselse en Franse hip-hop scene, denk Le 77, ISHA &amp; Stikstof, breken ze grenzen. Hun shows? Rauw, vurig en altijd in directe verbinding met het publiek, hun grootste bron van energie. Met Franco-Belgische tracks die binnen knallen, sleuren ze elke toeschouwer mee. Op het podium, klimmend op een stelling of midden in de crowd: ZLDR gaat altijd tot het uiterste. Als winnaars van Sound Track en Lotto Wild Talent en optredens naast o.a. Brihang, Ploegendienst,&nbsp;‘t Hof van Commerce, Doodseskader, Bob Vylan en Low G, groeit ZLDR razendsnel uit tot een unieke hiphop-act die je niet meer kunt negeren."
  },
  {
    "Title": "MUZIEKBARBAR",
    "DateString": "2026-03-23T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/muziekbarbar-11",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/b562/c4/344b57a8684da5c79fa6f52fb1c21243591ec818.jpg",
    "Location": "Wilde Westen, Kortrijk",
    "Description": "tracks, demofeedback &amp; drinks&nbsp;1 keer per maand worden Track en De Kreun op maandagavond dé ontmoetingsplek voor al wie actief muziek maakt, creëert of versterkt. Muzikanten, producers, DJ’s, geluidswizards,… Jong of oud, amateur of pro: iedereen is welkom.Laat je nieuwste track of demo knallen door het professionele soundsystem van De Kreun of in de opnamestudio in Track. Wissel tips en tricks uit. Geef en krijg feedback. Ontmoet muziekmakers aan de bar, met een drankje erbij. De Muziekbarbar gaat afwisselend door in De Kreun en in de opnamestudio van Muziekcentrum Track.Dit seizoen nodigen we regelmatig een externe muzikant of producer uit om gericht feedback te geven. We kondigen die telkens vooraf aan via onze socials.We openen telkens vanaf 19u, het einde is voorzien rond 22u. Je hoeft niet in te schrijven, kom gewoon af! Wil je zeker op de hoogte blijven van de Muziekbarbars?&nbsp;Word dan zeker lid van onze Whatsappgroep.Onze workshops zijn een samenwerking tussen Muziekcentrum Track &amp; Wilde Westen.Data en locatie:29/09/25 - Track20/10/25 - De Kreun17/11/25 - Concerstudio TrackDeze editie is Johannes Leroy [FR] te gast. Leroy is een multi-instrumentalist, die via Loopstation en andere hardware live solo-performances geeft. Op deze muziekbarbar toont hij verschillende formules om muziek te maken met piano, bas, percussie-samples, live percussie, tablet en live spel met een MPC. Na de guest-talk is er nog even tijd om zoals steeds eigen muziek te beluisteren.15/12/25 - Opnamestudio23/02/26 - Track23/03/26 - De Kreun20/04/26 - Track18/05/26 - De Kreun&nbsp;"
  },
  {
    "Title": "GRÉGOIRE GERSTMANS - Piano Day",
    "DateString": "2026-03-26T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/gregoire-gerstmans-piano-day",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7bb3/f1/13866277f38038cec9bdbc7383f37e94b0eb6fa3.jpg",
    "Location": "Uitzicht",
    "Description": "Al generaties lang wordt de liefde voor muziek doorgegeven in de familie Gerstmans. Grootvader Julien was violist en oprichter van de Muziekacademie van Hannuit. Hij liet Grégoire als 7–jarige op zijn piano spelen. Eric, Grégoires vader, speelde altviool, wat hem van het Filharmonisch Orkest van Luik naar Alain Bashung, William Sheller en Robert Wyatt bracht.&nbsp;In zijn eigen muziek gaat Grégoire op zoek naar de puurheid en schoonheid van de vroege pianomuziek, maar evenzeer naar de naïviteit van zijn vroege jeugd. In een snelle maatschappij vertraagt Grégoire Gerstmans bewust de tijd. Alleen met zijn piano, ergens tussen moderniteit en respect voor traditie, haalt hij de droom in ons allemaal naar boven door de minimalistische puurheid van zijn melodie.&nbsp;Zijn belangrijkste artistieke referenties zijn Arvo Pärt, Aphex Twin en Philip Glass, maar ook Bill Viola en Yves Klein.Voor Piano Day brengt hij een volledig akoestische set en presenteert hij zijn debuutalbum Hypnagogie dat verscheen op PIAS.&nbsp;"
  },
  {
    "Title": "ERTEBREKERS",
    "DateString": "2026-03-26T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ertebrekers-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7cc7/eb/8905c5da351cb8515fd2f778e00080728bb941b6.jpg",
    "Location": "De Kreun",
    "Description": "‘Waar hangen die dekselse Ertebrekers toch uit?’ Je hoorde het – als je goed luisterde – fluisteren onder fans. Met het onderliggende ietwat angstige sentiment: ze zijn toch niet gesplit? In een vlaag van verstandsverbijstering en een krachtige ‘Schluss damit!’? Wel, in het geheel niet. Ze leven nog. Kwamen uit hun hibernatie als vurige vlinders, met een nieuw album … ‘Cocon’. Al is er in die Ertebrekers-cocon toch het een en het ander veranderd.&nbsp;Bijna tien jaar geleden lieten ze ‘Otel’ op de mensheid los – met de bekende single ‘De Zji’ nestelden ze zich in een niche waar ze meteen king waren – om drie jaar later – met ‘Crème’ – dat verhaal lekker verder te zetten. Ja, corona wierp wat roet in het eten, al wisten Ertebrekers hun plaat wel te verzilveren met de singles ‘Paranoïa’ en ‘Shimokitazawa’ …&nbsp;&nbsp;En nu zijn ze er weer. Met dat verschil: Flip Kowlier maakt geen deel meer uit van de band. Of dat de harten van Peter Lesage en Jeffrey Bearelle brak? Neen. Of zoals Lesage het zelf verwoordt: “Jammer, zeker. Maar het is geen sinecure om drie succesvolle bands én een solocarrière te combineren: ’t Hof Van Commerce, Flips nieuwe soloplaat én een nieuw album van Ertebrekers … Flip speelt wel nog mee op twee songs, ‘Kon ik maar een beetje beter dansen’ en ‘El Narcistico’. De andere songs komen uit de koker van Jeffrey en mezelf.”&nbsp;Waar de vorige Ertebrekers-platen nog een groter singer-songwriteraandeel hadden, konden Bearelle en Lesage het soul-laken nu volledig naar zich toetrekken: het resultaat is een compromisloze plaat – meer soul &amp; disco, funk en hip-hop-georiënteerd, zeker wat de tempo’s en beats betreft – waarop de stem van Bearelle mooi blendt met de melodieuze arrangementen van Lesage. Twee soulbrothers in één ruimte, dat geeft coole resultaten. ‘Cocon’ is rijk gearrangeerd, met een knipoog naar oude en nieuwe soul-legends. Een plaat die mikt op de benen én op het hart, want ook qua thematiek laten Lesage en Bearelle in hun hart kijken.&nbsp; &nbsp;&nbsp;support: HONEYHONEY is een instrumentaal trio, dat ontstond uit jarenlange vriendschap en connectie als ritmesectie. eclectische grooves, lyriek en lekker eten vormen de voedingsbodem voor hun eigen muzikale taal — met echo’s van Al Green, D’Angelo en Ahmad Jamal. HONEY is Lukas Somers op gitaar, Gerben Brys op bas en Olivier Penu op drums.&nbsp;&nbsp;"
  },
  {
    "Title": "RAMONES ALIVE – 50 jaar Ramones",
    "DateString": "2026-03-27T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ramones-alive-50-jaar-ramones",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/acc9/9b/8d19f872eb1791adb33665672416b1dacfa5aefc.jpg",
    "Location": "De Kreun",
    "Description": "RAMONES ALIVE – 50 jaar Ramones (1976)&amp; 25 YEARS THAT’S ALL PUNKS! (genoeg redenen om te vieren dus!)De legendarische debuutplaat Ramones viert haar 50ste verjaardag, en dat vraagt om een ode met punkattitude! Ramones Alive brengt het iconische album integraal op het podium, met de energie en rauwe bravoure die het verdient.Het collectief bestaat uit topmuzikanten uit de Benelux-rockscene: Marco Roelofs (Heideroosjes) op zang, Bart Nederhand (Peter Pan Speedrock) op drums, Oeds Beydals (The Devil’s Blood / Iron Jinn) op gitaar en Harold Gielen (Legion of the Damned) op bas. Samen bundelen ze hun uiteenlopende karakters in een vurige liefdesverklaring aan pure rock ’n roll.In 2024 toerden ze al langs Belgische en Nederlandse zalen met een greep uit vijftig jaar Ramones-classics. Dit keer keren ze terug met een frisse insteek, maar dezelfde compromisloze energie. Verwacht een strakke, explosieve show die recht naar de kern van punkrock gaat.One, two, three, four! Gabba Gabba Hey!&nbsp;&nbsp;"
  },
  {
    "Title": "JAZZ CATS 2026",
    "DateString": "2026-03-28T17:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/jazz-cats-2026",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/623f/f7/200b7c47cf732831695cc45000fa4fcb711723af.png",
    "Location": "Muziekcentrum Track &amp; De Kreun",
    "Description": "Op 28 maart transformeren we voor de zevende maal De Kreun en Muziekcentrum Track om tot een broeinest van jazz.&nbsp;Zoals elk jaar gooien we de conventionele jazzregels overboord en varen we zo ver buiten de lijntjes dat je achteraf zou kunnen denken: “Jazz? Waar?”. Eén ding is zeker: je oren krijgen een all-you-can-eat buffet van experimenten voorgeschoteld, en je gaat gegarandeerd muzikaal voldaan naar huis.&nbsp;"
  }
]