[
  {
    "Title": "LICHTTECHNIEK VOOR BEGINNERS",
    "DateString": "2026-04-01T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/lichttechniek-voor-beginners",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/aee3/2a/06f156e30a962fa568d067b0b935bec27b8d7dc5.jpg",
    "Location": "De Kreun",
    "Description": "Leer alle basics van de lichttechniek en ga aan de slag met een lichttafel, een lichtplan en veel meer! Altijd al eens achter een lichttafel willen staan en een concertzaal tot leven willen wekken door het bedienen de spots op een podium? Tijdens deze cursus leer je alle basics van de lichttechniek. Hoe werkt een lichttafel, wat voor lichtbronnen zijn er, wat zijn de belangrijkste do’s en dont’s als het op kleuren aankomt en wat houdt deze job nog meer in buiten het uitdenken van een lichtplan en het bedienen van de tafel. Er is geen voorkennis nodig.Dit is een tweedelige lessenreeks, de eerste vindt plaats op 1 april en de tweede op 8 april. Telkens van 19 - 22 uur."
  },
  {
    "Title": "PSYCHONAUT",
    "DateString": "2026-04-02T20:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/psychonaut-2",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6cdd/72/033865a2f0dd746b638bb5583754a137f471456c.jpg",
    "Location": "De Kreun",
    "Description": "Tickets on sale vanaf 31/10, 10u!De Belgische psychedelische post-metalband Psychonaut is al jaren een toonaangevende kracht binnen de moderne heavy music. Hun traditionele trio-opstelling maskeerde lang de compositorische kracht, verhalende diepgang en intense livepresence waarmee ze het genre blijven vernieuwen.Na hun indrukwekkende doorbraak met Unfold the God Man (2020) en het spiritueel geladen Violate Consensus Reality (2022), stond de band op festivals als Alcatraz, Rock Herk, Boomtown, Soulcrusher, Roadburn Redux en A Colossal Weekend, en deelde het podium met o.a. Amenra, Brutus en The Ocean.Het nieuwe album World Maker ontstond toen gitarist/zanger Stefan De Graef vader werd. Deze gebeurtenis bracht een verschuiving teweeg: van filosofische en spirituele thema’s naar persoonlijke reflecties en levenslessen voor zijn zoon — een muzikale nalatenschap van liefde. De plaat ademt een zeldzaam optimisme, met invloeden van wereldmuziek, elektronica en jazz, en gastbijdragen van Anthe Huybrechts (Anthe/Helion Creek) op o.a. Origins, waar ook Indiase tabla’s te horen zijn.&nbsp;support: WIJFWijf staat voor empowerment en een goeie smack in your face. 3voor12 omschrijft noemt het iets als:\"Energiek gitaarwerk, heftige baslijnen en zangeres Marie die intens tekeer gaat. Stonerrock met creatieve uitstapjes richting metal en zelfs hiphoptrekjes, volledig beheerst en vol plezier.\""
  },
  {
    "Title": "NENIA - REVUE BLANCHE",
    "DateString": "2026-04-03T20:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/nenia-revue-blanche",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/beac/61/e1f45c232c7065733958a8da1e4ea59fcc34b92c.jpg",
    "Location": "Concertstudio",
    "Description": "Hoe ga je om met de dood van een dierbare? Wat betekent het om voort te leven in de aanwezigheid van afwezigheid? Schuilt er hoop in herinnering, in de kunsten, in de ontmoeting met de ander? En is elk afscheid ook echt een nieuw begin? Na het meeslepende Misia&nbsp;maakt het ensemble Revue Blanche een nieuwe voorstelling met audiokunstenaar Katharina Smets. Nenia – letterlijk ‘lied voor de doden’ – houdt het midden tussen concert, hoorspel en klankgedicht. Componist Frederik Neyrinck schrijft een gloednieuwe partituur op maat van dit unieke kwintet. Daarbij laat hij zich inspireren door Monteverdi’s opera L’Orfeo,&nbsp;over de mythische dichter-zanger die afdaalt in de onderwereld om zijn geliefde terug te halen. Katharina Smets, de vier musici en videaste Lise Bruyneel gidsen de luisteraar door een magisch-realistische wereld tussen droom en parabel, duisternis en licht.&nbsp;"
  },
  {
    "Title": "REHAB INVITES CARBON MUSIC",
    "DateString": "2026-04-03T21:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/rehab-invites-carbon-music",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/cb56/5f/f3fdc47e13c92942a79df3865e64579dca959eb4.png",
    "Location": "De Kreun",
    "Description": "JUBEIJubei is a highly respected electronic music producer and DJ, known for his precise, no-nonsense approach. Rising to prominence with Metalheadz in 2010, he made history by releasing nine tracks in a single year. His debut album To Have &amp; Have Not was widely acclaimed for its cinematic yet club-ready sound. In 2021, he founded his own label, Carbon Music, launching it successfully with the track Show Me alongside dBridge. Jubei continues to push the boundaries of drum &amp; bass with a forward-thinking vision and sound.&nbsp;SP:MCSP:MC has been a leading drum &amp; bass MC for over two decades, gaining recognition after legendary MC GQ invited him and Jubei to perform at Camden’s Emcee Sessions in 2001. He built his reputation through extensive touring with Friction and as dBridge’s preferred MC, while hosting events for top labels like Metalheadz, Shogun Audio, Hospital Records, and many more.&nbsp;Known for versatility and quality, SP:MC has been consistently recognized in awards, including Best MC at the D&amp;BArena Awards in 2011, and remains one of the most respected voices in the scene.&nbsp;TyroneTyrone is a Newcastle‑born drum &amp; bass producer and DJ known for his deep, rolling sound and razor‑sharp production. After first emerging as part of the trio Chroma, he has built a strong solo identity with releases on influential labels including Metalheadz, Ram Records, The North Quarter, Guidance, and Carbon Music.&nbsp;His tracks are a favourite among top‑tier selectors, blending weighty basslines with crisp drums and a dark, atmospheric edge. As a DJ, Tyrone brings over a decade of experience, delivering powerful sets across clubs and festivals throughout the UK and Europe.&nbsp;Walk:rWalk:r is a Bristol‑based drum &amp; bass producer known for his emotive, atmospheric sound and clean, rolling grooves. With releases on respected labels like Soulvent, Shogun Audio, and Guidance, he has quickly become a standout voice in the scene.On stage, Walk:r delivers DJ sets that flow effortlessly between liquid, deep rollers, and more driving selections. His performances are known for their smooth progression, emotional depth, and an instinctive sense of groove that keeps dancefloors locked in from start to finish.&nbsp;Sisley &amp; BenOneShotSisley &amp; BenOneShot are a must-see duo on the belgium Drum and Bass scene. This explosive tandem is known for their powerful and energetic sets, capable of electrifying any crowd. Their unique style spans from jungle to “dancefloor killers”, “rolling steppers” and soulful drum and bass, always seeking out the rhythms that make people move.Regularly featured at the biggest Drum and Bass events in Belgium, they’ve made their mark at Dour, Tomorrowland and Starwarz, to name just a few. With a perfect blend of musicality and raw energy, their performances strike a delicate balance between power and harmony. Each performance is a thrilling journey, with seamless transitions and a high energy atmosphere.&nbsp;MC MUSHGhent-based lyrical wizard MC MUSH, is one of the most distinctive voices in the Belgian Drum &amp; Bass scene.Active since the early 2000s, MC MUSH has collaborated with nearly every major player and A-list artist in the international DnB community. Star Warz, Tomorrowland, Dour, Rampage... the list of iconic events he has enhanced with his vocals, presence and crowd control is virtually endless!&nbsp;ResidentsTwogun &amp; .ComLikewize&nbsp;&nbsp;"
  },
  {
    "Title": "ADMIRAL FREEBEE",
    "DateString": "2026-04-04T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/admiral-freebee-3",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1a9a/b3/377d4bba0aaef1d4fa731b97ee7075b3edec1186.jpg",
    "Location": "De Kreun",
    "Description": "Tickets on sale vanaf 7/11, 11u.&nbsp;Waarom zijn er eigenlijk geen speeltuinen voor volwassenen? Tom Van Laere, aka Admiral Freebee, vraagt het zich oprecht af. Een plek waar men even aan niks hoeft te denken en onbevangen kan spelen, pure fun! Met eenzelfde gevoel sloot hij vorig jaar de jubileumtour rond zijn tijdloze debuutplaat af: dit spelplezier met deze band, dat gaan we vasthouden. Meteen weer het repetitiehok en de studio in en spelen vanuit de buik. Gitaar omgorden, voet op het pedaal en gaan. Resultaat? Tien tracks die volgend voorjaar in plaatvorm verschijnen, en nu al een vooruitgeschoven single om de smaakpapillen te prikkelen, Q&amp;A With Myself. Een uptempo, groovy rocktrack van net geen 3 minuten, met dansbare gitaren en synths, en enkele welgemikte HEYs die denkbeeldige air punches begeleiden. Complexloos, zo klinkt de speeltuin van Admiral Freebee, terwijl het inhoudelijk over ghosten zou kúnnen gaan:&nbsp;Questions, I have a few&nbsp;Answers I have none&nbsp;The only thing I know is that I know nothing&nbsp;The only thing I want is for you to come back home&nbsp;Q&amp;A With Myself kondigt de komst aan van Admiral Freebee’s achtste studioalbum, opvolger van The Gardener uit 2021. Het album verschijnt begin 2026."
  },
  {
    "Title": "KING KONG invites MATT SASSARI",
    "DateString": "2026-04-05T22:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/king-kong-invites-matt-sassari",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4ace/af/c1c9985c1752a1b157f377c1e674cfed3bde7bf2.jpg",
    "Location": "De Kreun",
    "Description": "MATT SASSARIMatt Sassari (born March 8, 1992, Marseille, France) is a rising star in the French techno scene. With releases on SCI+TEC, Tronic, Bitten, Deeperfect, and more, he has quickly established himself as a strong and versatile producer. His career began with Potobolo Records, where, alongside Ron Costa, he released over 15 tracks that opened doors to labels like Sincopat and Time Has Changed.Deeperfect, Stefano Noferini’s imprint, recognized his talent early on, resulting in 9 releases, remixes, and Beatport production packs. Matt continues to collaborate with top artists such as Ant Brooks, Miguel Bastida, Spencer K, and Enrico Sangiuliano, releasing on labels including Bitten, Rusted, Kinetika, Alleanza, and Rawthentic.A self-made artist, Matt co-founded his own imprint, Panterre Musique, with Matt Mor, showcasing his personal vision of techno. Inspired by legends like John Digweed, Richie Hawtin, Carl Cox, Dubfire, and Laurent Garnier, his groove transcends genres, captivating audiences far beyond the techno world. The best is yet to come for Matt Sassari.&nbsp;FRED HUSHFRED HUSH is a key name in Belgium’s house and techno underground. After years of performing across Belgium, Eastern Europe and Asia, he developed a versatile sound that blends acid techno, melodic house and trancy elements. His productions have been released on respected labels such as Relief, Fokalm, Sonar Kollektiv, Materia, Viva Music UK and Rush Hour.He gained international recognition with the cult classic “Open Your Eyes”, recently remastered and added to major Spotify playlists. Fred also runs the labels Secret and Fantasia Artists with Triple Vision (NL) and Decks (DE), continuing to shape his own musical identity beyond traditional genres.On stage, he has performed at Babylon Festival, OZORA, Elrow @ Extrema Outdoor, Nature One, Aquasella, and iconic clubs like Berghain, Space, Pacha and Tomorrowland. He hosts nights at Magazine Club (FR) and King Kong Club (BE), and frequently appears at leading Belgian venues such as Lagoa and Kompass.&nbsp;&nbsp;+ WOODRUFF + VILALICA"
  },
  {
    "Title": "ZU + DÄLEK",
    "DateString": "2026-04-16T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/zu-dalek",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/acc9/d8/b1364fa56a22d60121778dafcecc227a52d1e050.jpg",
    "Location": "De Kreun",
    "Description": "Double bill: ZU + DÄLEK (+ after DJ TBA)ZUZu is een van de meest eigenzinnige en grensverleggende bands van Europa. Sinds hun ontstaan in 1997 transformeert het Italiaanse trio invloeden uit metal, noise, elektronica, prog en hedendaagse muziek tot een volledig eigen, razend intense sound. Pitchfork omschreef hen ooit als “honderd bands in één” – en toch onmiskenbaar Zu.Door de jaren heen werkten ze samen met een indrukwekkende lijst iconen, waaronder Mike Patton, David Tibet, Tatsuya Yoshida, leden van Fugazi, The Melvins en Einstürzende Neubauten.Op 9 januari 2026 verschijnt Ferrum Sidereum, hun nieuwe album op House of Mythology, geproduceerd door Marc Urselli. De eerste single “Golgotha” laat horen dat Zu nog altijd even compromisloos en verrassend klinkt. Zoals John Zorn het verwoordde: “A powerful and expressive music that totally blows away what most bands do these days.”&nbsp;DÄLEKDälek reist al meer dan twintig jaar langs de randen van hiphop. Het duo – MC dälek en Mike Mare – bouwt dikke beats, gruizige drones en gelaagde noise om teksten die hard, helder en ongefilterd binnenkomen. Hun sound is donker, intens en eigenzinnig: hiphop als slagveld, waar shoegaze, industrial en politieke urgentie elkaar ontmoeten.In 2026 verschijnt hun nieuwe album: terug naar de essentie, zonder ballast. MPC 3000, vervormde gitaren, directe energie – alles in dienst van de track, niets teveel. Muziek dat je voelt in je ribbenkast: rauw, scherp en tot op het bot uitgepuurd."
  },
  {
    "Title": "FOUTLOOS",
    "DateString": "2026-04-19T20:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/foutloos",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/8030/ed/9b09b600880f6489418ec75503686c666cc267b4.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowᖴOᑌTᒪOOᔕ is een instrumentaal trio dat bestaat uit Esther Coorevits (Nemø ensemble, Tourist LeMC), Jonas Bruyneel (momoyo, Philemon, Vincent Coomans) en Renaud Debruyne (Mirek Coutigny, Mergel). In Foutloos gaan sferische improvisaties op altviool samen met funky baslijnen en snedige hiphopgrooves. Verwacht je aan verrassende akkoordenprogressies, gewaagde tempowissels en een verfrissende sound die de grenzen van genres oprekt.&nbsp;\"The mood is sparkling, bright, full of life. This is modern, fresh, and groovy from the first second.\"&nbsp;Dystopian (IT)&nbsp;"
  },
  {
    "Title": "VIDEOMAPPING VOOR LIVE MUZIEK",
    "DateString": "2026-04-22T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/videomapping-voor-live-muziek",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/e9c3/12/ab37a3ab6f109ad13ad9743638f2434865828972.jpg",
    "Location": "De Kreun",
    "Description": "Over video mappingVideo mapping - ook wel projection mapping genoemd - is een techniek waarbij (vaak raar gevormde) objecten worden omgevormd tot een projectiescherm.Via beweging en aanpassingen in het beeld worden stilstaande objecten - zoals gebouwen, decors, ... - tot leven gewekt. De techniek wordt vaak toegepast bij elektronische muziek (als decor) en als advertentietechniek. De techniek laat je toe zelf creatief om te spelen met objecten/ruimtes. Ideaal om je fuif / project / jeugdhuis net dat ietsje meer te geven! In deze workshop leer je de basistechnieken van video mapping Timing en locatie:- 22 april 2026 - 19u tot 23u- De Kreun concertzaal Begeleider: Thomas Delbeke aka TheloocaThomas Delbeke aka @Thelooca projecteert bewegende beelden op haast alles, behalve projectieschermen. Van mapping, maskings tot volledige installaties doet hij er alles aan om het traditionele 16:9 formaat te vermijden.Een overzicht van zijn werk kun je vinden op www.thelooca.be ! Praktisch + hoe inschrijven + meer info? &nbsp;Ervaring in het digitaal bewerken van beeldmateriaal is niet vereist! Vooral goesting om creatief aan de slag te gaan is nodig! Wat je nodig hebt? Een laptop (mac of windows is hetzelfde) met daarop geïnstalleerd: de trial versie van Resolume Arena (http://resolume.com/download/)&nbsp;"
  }
]