[
  {
    "Title": "Ertebrekers (try-out)",
    "DateString": "2026-01-30 19:30:00",
    "Url": "https://www.4ad.be/event/ertebrekers-try-out/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/ertebrekers-try-out-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EERTEBREKERS\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003ETry-out van de nieuwe plaat.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EZe zijn terug! Alé, grotendeels toch. De heerlijke, zwoele West-Vlaamse soul van Ertebrekers keert terug naar 4AD met een nieuwe plaat, maar met één groot verschil: Flip Kowlier maakt geen deel meer uit van de band. \u003C/p\u003E\n\u003Cp\u003EOf dat de harten van Peter Lesage en Jeffrey Bearelle brak? Neen. Of zoals Lesage het zelf verwoordt: “Jammer, zeker. Maar het is geen sinecure om drie succesvolle bands én een solocarrière te combineren:’t Hof Van Commerce, Flips nieuwe soloplaat én een nieuw album van Ertebrekers\u0026#8230; Flip speelt wel nog mee op twee songs, ‘Kon ik maar een beetje beter dansen’ en ‘El Narcistico’. De andere songs komen uit de koker van Jeffrey en mezelf.”\u003C/p\u003E\n\u003Cp\u003EJe zou de totstandkoming van de nieuwe plaat een beetje kunnen beschouwen als een geval van ‘reculer pour mieux sauter’. Dat Kowlier andere horizonten opzocht, gaf meer ruimte aan de songsmid Lesage die het album een iets nadrukkelijker soul-signatuur gaf. Waar de vorige Ertebrekers-platen nog een groter singer-songwriter aandeel hadden, konden Bearelle en Lesage het soullaken nu volledig naar zich toetrekken: het resultaat is een compromisloze plaat–meer soul \u0026amp; disco, funk en hip-hop-georiënteerd, zeker wat de tempo’s en beats betreft–waarop de stem van Bearelle mooi blendt met de melodieuze arrangementen van Lesage. Twee soulbrothers in één ruimte, dat geeft coole resultaten.\u003C/p\u003E\n\u003Cp\u003EDe plaat is rijk gearrangeerd, met een knipoog naar oude en nieuwe soul-legends. Een plaat die mikt op de benen én op het hart, want ook qua thematiek laten Lesage en Bearelle in hun hart kijken.“Waar we voorheen nog iets meer tongue-in-cheek-humor de plaat binnensmokkelden, leunen we qua thema’s nu iets dichter aan bij zaken waar we allemaal mee bezig zijn; er is meer zelfreflectie, meer introspectie en meer zelfliefde. De jongensachtige branie is er nog steeds, maar er hangt een laagje serieux over, zonder zwaar op de hand te klinken.”\u003C/p\u003E\n\u003Cp\u003EHet allereerste concert van Ertebrekers 2.0 is op vrijdag 30 januari bij 4AD. Tickets zijn nu te koop!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/ertebrekers/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/search/top?q=ertebrekers\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Motsus \u002B Idealus Maximus",
    "DateString": "2026-01-31 19:30:00",
    "Url": "https://www.4ad.be/event/motsus-idealus-maximus/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/motsus-idealus-maximus-1.png",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EMOTSUS\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003ERelease show van de nieuwe plaat \u0026#8216;ATLAS\u0026#8217;.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EDat er in de IJzer veel chemische substanties rondzwemmen, is een publiek geheim. Maar in Oudenburg moeten er nog veel kwaadaardigere viezigheden dobberen. Het stonertrio \u003Cstrong\u003EMOTSUS\u003C/strong\u003E ontstond in die polderstad in 2012 en is sindsdien bezig zich een weg te banen door de heavy underground met een compromisloze mix van \u003Cstrong\u003Estonerriffs, hedendaagse sludge metal en oldschool doom\u003C/strong\u003E. Dodelijk zwaar en traag, een beetje zoals de Belgische begrotingsonderhandelingen, maar soms ook messcherp snel en onverzettelijk.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EATLAS\u003C/strong\u003E markeert een belangrijke evolutie voor het trio. Het album, opgenomen in de \u003Cstrong\u003EDunk!Studio’s\u003C/strong\u003E in Zottegem en gemixt en gemasterd door \u003Cstrong\u003EKarl Daniel Lidén\u003C/strong\u003E, neemt je mee op een sonische reis van intieme akoestische fluisteringen tot gedurfde nieuwe composities die dieper terrein verkennen binnen doom en atmosferische klanken. De \u003Cstrong\u003Ereleaseshow bij 4AD\u003C/strong\u003E bevat een speciale uitvoering van de volledige “Exploder”-saga, waarbij “Exploder Pt. I” van Oumuamua (2018) naadloos overgaat in “Exploder Pt. II” van het nieuwe album—een carrière-overspannend verhaal dat voor het eerst als één geheel wordt gespeeld.\u003C/p\u003E\n\u003Cp\u003ENa \u003Cstrong\u003EOumuamua\u003C/strong\u003E (2018, uitgebracht via Polderrecords) deelde MOTSUS podia op festivals zoals de Gentse Feesten en \u003Cstrong\u003EAlcatraz\u003C/strong\u003E, waarmee ze een reputatie opbouwden voor fysieke, fundamenten-doen-trillen­de liveshows.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EDe releaseshow bestrijkt de volledige catalogus van de band—van hun rauwe demo’s uit 2014, via de interstellaire zwaarte van Oumuamua, tot het gloednieuwe ATLAS-materiaal dat integraal wordt uitgevoerd.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/motsus_be/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/MOTSUS.BE\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EIdealus Maximus\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EInstrumentaal rocktrio.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EOpgericht in 2004 door \u003Cstrong\u003EFanio (drums), Erik (gitaar) en Pablo (bas)\u003C/strong\u003E, heeft Idealus Maximus in de voorbije twee decennia een stevige reputatie opgebouwd binnen de Belgische stoner- en instrumentale rockscene. Bekend om hun hypnotiserende, door riffs gedreven klanklandschappen, deelde de band het podium met hun grootste inspiratiebronnen, waaronder \u003Cstrong\u003EKarma To Burn en The Atomic Bitchwax\u003C/strong\u003E, en speelde ze op festivals zoals \u003Cstrong\u003EYellowstock en Roadkill\u003C/strong\u003E.\u003C/p\u003E\n\u003Cp\u003EHun meest recente wapenfeit, \u003Cstrong\u003ELoofbos\u003C/strong\u003E uit 2022 (uitgebracht via Polderrecords), toonde het vakmanschap van het trio in het opbouwen van atmosferische, psychedelische passages die uitmonden in verpletterende geluidsmuren.\u003C/p\u003E\n\u003Cp\u003EMet kersverse studiotracks op zak belooft Idealus Maximus een krachtige performance die naadloos aansluit bij de instrumentale doomesthetiek van MOTSUS. Verwacht verpletterende riffs, hypnotiserende grooves en het soort dynamische, instrumentale storytelling dat hen al meer dan twintig jaar een vaste waarde maakt in de Belgische heavy-muziekscene.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/idealusmaximus/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/IdealusMaximus\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Luminous Belge",
    "DateString": "2026-02-06 19:30:00",
    "Url": "https://www.4ad.be/event/luminous-belge/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/luminous-belge.png",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Cp\u003E\u003Cstrong\u003EWe vieren, samen met Luminous Dash, de Week van de Belgische Muziek met Malfait, Head on Stone, Gros Coeur en Dj François du Painlait!\u003C/strong\u003E\u003C/p\u003E\n\u003Ch3\u003EMALFAIT\u003C/h3\u003E\n\u003Cp\u003EMalfait laat elektronica en indie samensmelten tot een unieke en meeslepende sound. Atmosferische synths, pulserende drums en een stem die je niet meer loslaat staan garant voor een ware sonische trip. Met invloeden van Britse indie tot Bicep en M83 creëert Malfait een ervaring die tegelijk dansbaar en melancholisch is.\u003Cbr /\u003EDe producer en zanger werkte in het verleden onder de naam LXNGTN. Met zijn door house geïnspireerde livesets speelde hij onder meer op Tomorrowland en Amsterdam Dance Event.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/malfait_music/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/profile.php?id=61566791594775\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EHEAD ON STONE\u003C/h3\u003E\n\u003Cp\u003EHead on Stone is het soloproject van Nele Janssen (Peuk), waarop ze een totaal andere kant van haar persoonlijkheid laat zien. Met enkel haar stem en een piano neemt ze de luisteraar mee in haar diep persoonlijke wereld. De songs zijn tegelijk fantasierijk en integer, droevig en hoopvol, virtuoos en afwijkend.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/headonstonemusic/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/headonstone\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EGROS COEUR\u003C/h3\u003E\n\u003Cp\u003EDe Brussels-Luikse band GROS COEUR serveert heerlijk vettige, tropisch-psychedelische rock. Na hun debuutalbum ‘Gros Disque’ (2023) trokken ze door heel Europa, met honderden shows op de fijnste festivals, waar ze hun sterke livereputatie nog verder wisten te versterken.\u003Cbr /\u003EDit voorjaar bracht het viertal de single en video ‘Sacrifice’ uit: acht minuten gezonde waanzin en een voorsmaakje van hun tweede album ‘Vague Scélérate’, dat enkele weken geleden het levenslicht zag. Een heerlijk geschift Belgisch feest om de avond af te sluiten!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/groscoeurband/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/GrosCoeurBand\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "A.A. Williams \u002B Spotlights",
    "DateString": "2026-02-07 19:30:00",
    "Url": "https://www.4ad.be/event/a-a-williams-spotlights/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/a-a-williams-spotlights-2.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EA.A. Williams (vk)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EOverweldigende post-rock en duistere folk.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003ENa haar indrukwekkende debuut op \u003Cstrong\u003ERoadburn\u003C/strong\u003E heeft de Britse \u003Cstrong\u003EA.A. Williams\u003C/strong\u003E een straffe opmars gemaakt binnen de internationale muziekscene. Met een sound die laveert tussen post-rock, neoklassiek en donkere folk, tourde ze inmiddels met zwaargewichten als Cult of Luna, Explosions In The Sky, Russian Circles, Sleep Token en The Sisters of Mercy. Intussen bouwde ze ook aan een eigen parcours, met als hoogtepunt een soloshow in de iconische Queen Elizabeth Hall in Londen.\u003C/p\u003E\n\u003Cp\u003EWilliams’ albums \u003Cstrong\u003EForever Blue\u003C/strong\u003E (2020) en \u003Cstrong\u003EAs The Moon Rests\u003C/strong\u003E (2022) konden op heel wat applaus rekenen van zowel pers als publiek. Haar meeslepende songs, doordrenkt van melancholie en intensiteit, maken van haar een unieke artieste met een eigen stempel.\u003C/p\u003E\n\u003Cp\u003ETijdens de lockdown verraste ze met \u003Cstrong\u003ESongs From Isolation\u003C/strong\u003E, een intieme coverplaat die lof oogstte van niemand minder dan Robert Smith (The Cure) en Billy Corgan (Smashing Pumpkins). Haar samenwerking met de Japanse post-rockband \u003Cstrong\u003EMONO\u003C/strong\u003E (Exit in Darkness) en haar klassieke herwerking van haar debuut-EP in het adembenemende arco tonen haar veelzijdigheid als multi-instrumentalist en componist. Ze bracht net ook een live-EP uit van haar \u003Cstrong\u003EAudiotree-sessie\u003C/strong\u003E, een mooi voorproefje de live-ervaring in februari.\u003C/p\u003E\n\u003Cp\u003EA.A. Williams en 4AD, het gaat een hele mooi combinatie worden.\u003C/p\u003E\n\u003Cp\u003E\u003Cem\u003EVoor fans van o.a. MONO, Emma Ruth Rundle, This Will Destroy You en Chelsea Wolfe.\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/aawilliamsmusic/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/aawilliamsmusic\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003ESpotlights (vs)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003ESfeervolle, brute en straffe post-metal.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EKlaar voor je nieuwe favoriete ontdekking?\u003Cbr /\u003ESpotlights is een bijzonder Amerikaans trio dat doom vermengt met \u003Cstrong\u003Eshoegaze, post-rock koppelt aan sludge\u003C/strong\u003E en bovenal op zoek gaat naar een dromerige, melodieuze trip.\u003C/p\u003E\n\u003Cp\u003EHun muziek is sfeervol – misschien zelfs romantisch – maar tegelijkertijd ruw, bruut en loeizwaar. Verwacht hier geen agressieve, schreeuwende New Yorkers: ze onderscheiden zich met een pure kracht die eerder een dromerige klankenwereld oproept dan één vol haat.\u003C/p\u003E\n\u003Cp\u003EMy Bloody Valentine meets Smashing Pumpkins. Misschien zoiets – maar dan weer helemaal anders. Ze mochten al mee op tour met Deftones en deelden het podium met Melvins, Hum, Glassjaw en Pelican. Het beroemde Ipecac Recordings nam hen onder zijn vleugels, met Seismic (2017) en Love and Decay (2019) als resultaat.\u003C/p\u003E\n\u003Cp\u003EDe verwachtingen zijn hoog – kom op tijd!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/spotlightsmusic/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/spotlightsband\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Scott Hepple and The Sun Band",
    "DateString": "2026-02-13 19:30:00",
    "Url": "https://www.4ad.be/event/scott-hepple-and-the-sun-band/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/scott-hepple-and-the-sun-band-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EScott Hepple and The Sun Band (vk)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EOld school rock-\u0026#8216;n-roll!\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003ETijd om de rock terug in rock-‘n-roll te zetten. Scott Hepple and The Sun Band doet precies dat: old school rock met frisse teksten van een straffe, jonge songwriter. Deze Britse knapen brengen aanstekelijke psychedelische garagerock en zijn getekend bij het gerenommeerde label Rise Above/Popclaw Records.\u003C/p\u003E\n\u003Cp\u003EZe werken hard aan hun carrière, met resultaat. Na het in eigen beheer uitbrengen van twee platen in 2023 en 2024 kondigden ze een mooie tour aan, met zelfs een concert bij Jack White’s \u003Cstrong\u003EThird Man Records\u003C/strong\u003E in Londen. Dit jaar brachten ze hun derde plaat English Mustard uit.\u003C/p\u003E\n\u003Cp\u003ELouder Than War over die plaat: \u003Cem\u003E“Na drie albums laat English Mustard een volwassenheid en zelfvertrouwen horen in hun muziek. Ze weten een heerlijk levendig, direct en opwindend geluid neer te zetten. (…) De band vermengt invloeden en riffs uit de jaren ’60 en ’70 – van heavy tot folk – met een moderne gevoeligheid die zorgt voor een spannende mix. De drums zijn krachtig en energiek, de bas dreunend, de gitaren rauw en fel, en de zang is urgent en vol passie.”\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003EEnglish Mustard werd geproduceerd door Liam Watson (bekend van The White Stripes, Tame Impala, Electric Wizard) in Mike Oldfields Tilehouse Studios, volledig met analoge apparatuur. Ze trekken op tour met de plaat — en ze hebben onze uitnodiging niet afgeslagen.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/scottheppleandthesunband/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/scotthepplemusic\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003ELiquid Silver\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EPsychrock van eigen West-Vlaamse bodem.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EDeze vier West-Vlaamse rockers nemen je mee op een trip die tijd en ruimte doet vervagen met hun heerlijke psychedelische klanken. Vaak trippy, soms ook heavy, met invloeden van Black Sabbath, Hawkwind en Slift, en alles daartussen.\u003C/p\u003E\n\u003Cp\u003EMet een publieksprijs op Red Rock Rally, airplay op radiozender Willy, concerten bij onder meer Campo Solar, Wilde Westen en Cactus en supportshows voor onder meer RHEA en Crooked Steps op hun cv, bouwen ze gestaag aan een onmiskenbare livereputatie.\u003C/p\u003E\n\u003Cp\u003EKom vroeg en support your local scene!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://luminousdash.be/interview/liquid-silver-als-ik-naar-muziek-luister-wil-ik-iets-voelen-of-dat-nu-oorpijn-hartpijn-of-panische-angst-is-maakt-niet-uit/\u0022\u003EInterview Luminous Dash\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/liquidsilverband/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/liquidsilverband\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Ão (try-out)",
    "DateString": "2026-02-20 19:30:00",
    "Url": "https://www.4ad.be/event/ao-try-out-2/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/ao-try-out-2.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Cp\u003EÃo heeft zichzelf de afgelopen jaren stevig op de kaart gezet in België en Europa. Hun genre-overschrijdende muziek – die reist langs \u003Cstrong\u003Eelektronica, artpop, saudade en alternative Latin\u003C/strong\u003E – is uniek in zijn soort. Een hybride sound die door dit viertal compleet zelf is uitgevonden.\u003C/p\u003E\n\u003Cp\u003EFrontvrouw \u003Cstrong\u003EBrenda Corijn\u003C/strong\u003E, die put uit haar Mozambikaans-Portugese roots, zingt zowel in het Portugees als in het Engels. Haar warme stem versmelt met het zuiderse gitaarspel van \u003Cstrong\u003ESiebe Chau\u003C/strong\u003E, de gelaagde elektronica van \u003Cstrong\u003EJolan Decaestecker\u003C/strong\u003E en \u003Cstrong\u003EBert Peyffers\u003C/strong\u003E’ eclectische percussiewerk.\u003C/p\u003E\n\u003Cp\u003EIn 2023 brachten ze de prachtplaat \u003Cstrong\u003E\u0026#8216;Ao Mar\u0026#8217;\u003C/strong\u003E uit, waarmee we ze ook voor een uitverkochte try-out mochten ontvangen. De plaat werd hier en op veel andere plekken grijsgedraaid; het concert werd er eentje om te koesteren.\u003C/p\u003E\n\u003Cp\u003EIn 2026 zijn ze terug (van helemaal niet weggeweest te zijn) om de definitieve doorbraak vast te leggen met \u003Cstrong\u003E\u0026#8216;Malandra\u0026#8217;\u003C/strong\u003E: een ode aan complexiteit, veelvormigheid en aan het zoeken in al haar gedaanten. Aan schaamte en glans, chaos en rust, liefde en escapisme.\u003C/p\u003E\n\u003Cp\u003EWellicht voor een laatste keer in zo’n ongelooflijk klein Belgisch clubje te beleven.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/ao.band.ao\u0022\u003EFacebook\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/ao.band/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Johnny Dowd",
    "DateString": "2026-03-06 19:30:00",
    "Url": "https://www.4ad.be/event/johnny-dowd/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/johnny-dowd-3.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EJohnny Dowd (vs)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EAmerikaanse alt-country legend.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EJohnny Dowd is een Amerikaanse singer-songwriter die sinds de jaren negentig een eigenzinnige positie inneemt binnen de alt-country en americana. Zijn muziek laveert tussen country, blues, punk en spoken word, altijd gekleurd door een duistere flair en een vaak cynische (of realistische) blik op het leven.\u003C/p\u003E\n\u003Cp\u003EPas op latere leeftijd begon Dowd aan zijn muzikale pad — rond zijn veertigste, in Ithaca, New York, waar hij zijn eerste nummers schreef. Zijn debuutalbum Wrong Side of Memphis uit 1995 bezorgde hem meteen een cultstatus. Recensenten omschrijven hem als “Willie Nelson die verandert in Mr. Hyde” en prijzen zijn gruizige stem, gitzwarte humor en nietsontziende teksten.\u003C/p\u003E\n\u003Cp\u003EIn de jaren die volgden bracht Dowd bijna twintig albums uit, tourde hij door de VS en Europa, en werkte hij samen met onder meer The Mekons, Sally Timms en Jon Langford. Zijn meest recente plaat, Is Heaven Real? (How Would I Know?), grijpt terug op de soul en R\u0026amp;B uit zijn jeugd in Oklahoma en Memphis, maar dan met zijn kenmerkend eigenwijze stijl.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/johnny.dowd/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/JohnnyDowdOfficial\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003ECiska Ciska\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EBeloftevolle Belgische songwriter.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EDe 25-jarige Ciska Dhaenens uit Gent is bezig met een stevige doorbraak in het muzieklandschap. Samen met haar band maakt ze breekbare, maar toch krachtige songs, geïnspireerd door persoonlijke idolen als Julia Jacklin, Big Thief en Aldous Harding.\u003C/p\u003E\n\u003Cp\u003EDebuutsingle ‘Biotope’ is alvast een sterke opener waarmee ze elke reviewsite het voorbije jaar naar meer liet hunkeren. Intussen werken Ciska en haar band hard aan de eerste volledige plaat. Dhaenens: “Met de release van mijn debuutalbum wil ik een levenshoofdstuk vol twijfels en angsten afsluiten. Ik durf mezelf en mijn kwetsbaarheid eindelijk op een piëdestal te plaatsen en daar zal het album ook symbool voor staan. Voor mij voelt het aan als één groot coming-of-ageverhaal.”\u003C/p\u003E\n\u003Cp\u003ECiska Ciska veroverde al heel wat straffe podiumplekken, o.a. op Best Kept Secret, Leffingeleuren en AFF. Blogsite Dansende Beren classificeert haar tot Grote Beer van Morgen. Om maar te zeggen: kom vroeg en ontdek beloftevol talent van eigen bodem!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/ciska_ciska_/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Emma Hessels \u002B Aghogho",
    "DateString": "2026-03-07 19:30:00",
    "Url": "https://www.4ad.be/event/emma-hessels-aghogho/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/emma-hessels-aghogho-3.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Cp\u003E\u003Cstrong\u003EConcerten ten voordele van Punt vzw, in het kader van Internationale Vrouwendag.\u003C/strong\u003E\u003Cbr /\u003E\u003Cem\u003EPer verkocht ticket doneert 4AD €5 aan Punt vzw, een organisatie die slachtoffers ondersteunt van alle vormen van seksueel geweld.\u003C/em\u003E\u003C/p\u003E\n\u003Ch3\u003EEmma Hessels\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EGrote Belgische belofte met intieme nummers die stevig binnenkomen.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EEmma Hessels is langzaam maar zeker de muzikale harten van het land aan het veroveren. Sinds haar selectie als laureaat van Sound Track in 2023 bewijst ze voor steeds meer publiek dat ze een artieste is om stevig in het vizier te houden. Ze stond al op Best Kept Secret en mocht het voorprogramma verzorgen van Cat Power en Mavis Staples.\u003C/p\u003E\n\u003Cp\u003EGewapend met een gitaar en haar kenmerkende stem balanceert ze moeiteloos over de diepste kloven van verlangen, liefde en eenzaamheid. Kleine nummers over universele thema’s, die regelmatig een krop in de keel bezorgen.\u003C/p\u003E\n\u003Cp\u003EHaar debuut-EP ‘Constant Distance’ verscheen onlangs bij Unday Records.\u003Cbr /\u003ELuminous Dash over die plaat: “Constant Distance is een stevige binnenkomer van een artiest die aan het begin staat van een veelbelovende carrière.”\u003C/p\u003E\n\u003Cp\u003ELive met band op 07.03.26 bij 4AD!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/emmahessels/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EAghogho\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003ESoul, afropop en funky vibes.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EMet Aghogho wil Caro Abutoh haar Nigeriaanse roots en muzikale nieuwsgierigheid verkennen, en tegelijk ook mensen in beweging brengen. Ze bracht onlangs haar debuut-EP 17 uit en maakt warme, ritmische afropop die meteen een zomers gevoel geeft.\u003C/p\u003E\n\u003Cp\u003ESamen met Simon Pas (drums), Michiel Los (gitaar), Julia Warmerdam (trompet) en Caro zelf (zang \u0026amp; bas) ontstond Aghogho tijdens een residentie in Het Bos. De naam Aghogho – Caro’s Nigeriaanse naam – betekent ‘kind van God’.\u003C/p\u003E\n\u003Cp\u003ECaro zingt al van jongs af aan en ontwikkelde haar muzikale stijl tijdens haar opleiding Kleinkunst aan het Conservatorium van Antwerpen. Haar muziek is warm, ritmisch en experimenteel, en doet denken aan artiesten als Nilüfer Yanya en Zap Mama.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/__aghogho__/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Sophie Straat",
    "DateString": "2026-03-20 19:30:00",
    "Url": "https://www.4ad.be/event/sophie-straat/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/sophie-straat-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003ESOPHIE STRAAT (nl)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EMoeilijke onderwerpen, straffe songs en vooral recht door zee.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EZe maakte een bliksemstart met haar carrière dankzij haar debuut-ep \u003Cstrong\u003E\u0026#8216;’T Is Niet Mijn Schuld\u0026#8217;\u003C/strong\u003E (2020), waarmee ze een Edison won. Voor haar debuutalbum \u003Cstrong\u003E\u0026#8216;Smartlap Is Niet Dood\u0026#8217;\u003C/strong\u003E (2023) volgden nominaties voor 3FM Awards, Edisons en de Amsterdamprijs voor de Kunst. \u003C/p\u003E\n\u003Cp\u003EDe ep \u003Cstrong\u003E\u0026#8216;Gebroken Spiegels\u0026#8217;\u003C/strong\u003E verscheen in 2024 en bestaat uit één lang lied, opgenomen met het Metropole Orkest. Volgens De Groene Amsterdammer is het “zeldzaam groots opgezet en gedurfd”. Binnen een paar jaar groeide Sophie Straat zo uit tot “het boegbeeld van de generatie twintigers die maatschappelijk betrokken is” (de Volkskrant) en verzamelde haar muziek meer dan vijftien miljoen streams. \u003C/p\u003E\n\u003Cp\u003EDe band maakte indruk op festivals van ITGWO tot BKS, en van Wildeburg tot Lowlands en Pukkelpop – maar ook met uitverkochte clubtours en het eigen festival Protestfest: al drie jaar op rij in een volledig uitverkocht Paradiso, Amsterdam.\u003C/p\u003E\n\u003Cp\u003ENaast haar muziek maakt Sophie als multidisciplinair kunstenaar ook artwork, foto’s en films, zoals de korte film Mooier Als Je Lacht, die draait om drie albumsongs. \u003C/p\u003E\n\u003Cp\u003EZe komt mét band en een album vol nieuwe muziek naar Diksmuide.\u003Cbr /\u003ERevolutie en protest op vrijdag 20 maart bij 4AD!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/sophiestraat/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EFritzi (nl)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EMelancholische, elektronische pop.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EFritzi experimenteert erop los en glipt tussen genres door, maar als we er toch een naam aan willen geven, zetten we ons geld op ‘melancholische, elektronische pop’. Met haar zelfgeproduceerde bassen en scherpe beats creëert ze een mix van harmonie en emotie die je meeneemt in haar leefwereld van een jonge vrouw in de grote stad. Samen met Groove God Jaïr Darnoud en Kiki Margari brengt ze een liveshow die diep, rauw en extreem dansbaar is. Kom vroeg, blijf laat!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/f.ritzi/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Stinstage Takeover: Kameel \u002B FC Atlaska",
    "DateString": "2026-04-04 18:30:00",
    "Url": "https://www.4ad.be/event/stinstage-takeover-kameel-fc-atlaska/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/stinstage-takeover-kameel-fc-atlaska.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Cp\u003E\u003Cstrong\u003ESTINSTAGE TAKEOVER\u003C/strong\u003E: we geven opnieuw de sleutels van onze club uit handen. Dit keer is het aan de heren van STINSTAGE!\u003C/p\u003E\n\u003Ch3\u003EFC ATLASKA\u003C/h3\u003E\n\u003Cp\u003EFC Atlaska speelt ritmische roadtripmuziek. Mochten de Vlaamse Ardennen iets dichter bij de evenaar liggen, schreven deze Gents-Gaverse exoten er ongetwijfeld de gepaste soundtrack voor.\u003Cbr /\u003EMet hun debuut-EP ‘Rhythms from the Schelde Valley’, geproduceerd door Jasper Segers (o.a. Sylvie Kreusch), zet FC Atlaska meteen een eigenzinnige stempel. Hun eerste single ‘I See You Turn East’ ademt sixties-psychedelica en meditatieve snaarklanken, terwijl opvolger ‘Two Moons Away’ je meeneemt op een dromerige, kosmische trip met echo’s van Pink Floyd, Khruangbin en Balthvs.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.youtube.com/watch?v=ywNllz1w030\u0022\u003EYOUTUBE\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://fcatlaska.bandcamp.com\u0022\u003EBANDCAMP\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EKAMEEL\u003C/h3\u003E\n\u003Cp\u003EKameel is terug!\u003Cbr /\u003EHet avontuurlijke trio van Hans Mullens, Patrick Steenaerts en Geert Roelofs presenteert hun derde langspeler “Variomatic”. Verwacht een meeslepende mix van jazz, rock, elektronica en improvisatie, altijd met die herkenbare filmische ondertoon.\u003C/p\u003E\n\u003Cp\u003EMet dit nieuwe album, geïnspireerd door electroclash, schuift Kameel elektronica nadrukkelijker naar voren en voegen ze voor het eerst ook vocale nummers toe – een frisse dimensie in hun eigenzinnige geluid.\u003Cbr /\u003ENa de eerdere releases Barkas (2020) en Trugschluss (2023) bewijst Kameel opnieuw dat ze grenzen verleggen en genres doen samensmelten.\u003Cbr /\u003ELive vertaalt zich dat in een avond vol energie: dansbaar, verrassend en onweerstaanbaar.\u003C/p\u003E\n\u003Cp\u003EEen unieke band. Een unieke avond. Mis het niet!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://youtu.be/dalHZG7nbc0?si=veg3H1I-M9XYT3P\u0022\u003EYOUTUBE\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://luminousdash.be/live/kameel-geel-cc-de-werft-31-10-2025\u0022\u003EREVIEW LUMINOUS DASH\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003ESTINSTAGE DJ\u0026#8217;S\u003C/h3\u003E\n\u003Cp\u003EVoor wie houdt van verrassende feestjes zijn de eigenzinnige Stinstage DJ’s geen onbekenden meer. Dit dynamische duo bracht inmiddels diverse pubs, clubs en festivals op temperatuur. In hun eclectische sets hoor je zowel jong, onontdekt talent als invloedrijke bands die wat in de plooien van de muziekgeschiedenis zijn verdwenen. Alles wat rockt, swingt, doet heupwiegen of de boel laat knallen, krijgt een plaats in hun sets. Onder het motto “No rules, great music” duiken ze diep in de betere rock, garage, punk, funk, soul, jazz, ska, surf, blues, country, rockabilly en aanverwante rootsgenres.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022http://www.mixcloud.com/Stinstage\u0022\u003EMIXCLOUD\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/Stinstage\u0022\u003EFACEBOOK\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Faze \u002B Yesnomaybe",
    "DateString": "2026-04-11 18:30:00",
    "Url": "https://www.4ad.be/event/faze-yesnomaybe/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/faze-yesnomaybe.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EFaze (ca)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EChaotische punk-rock-hardcore-dans-ennogvannallesband uit Canada.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EDeze bonte bende uit het levendige Montréal maakt nietsontziende hardcorepunk met psych-invloeden en verslavende ritmes. Samengesteld uit leden met uiteenlopende muzikale achtergronden \u0026#8211; crust, hardcore, punk en psych \u0026#8211; belichaamt hun sound de chaotische energie van een Canadese sneeuwstorm, met een scheurende trombone die er met alle moeite bovenuit stijgt.\u003C/p\u003E\n\u003Cp\u003EFaze staat symbool voor de geest van Montréal en haar indrukwekkende harcordepunkscene, en is bovenal een \u003Cstrong\u003Emust-see-live-band\u003C/strong\u003E! Must, zeggen we!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022http://\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://fazefazefaze.bandcamp.com/album/big-upsetter\u0022\u003EBandcamp\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EYesnomaybe\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EMelodieuze punkrock en een alles-moet-kapot-attitude.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EDe vier heren van Yesnomaybe wonnen in 2024 \u003Cstrong\u003E‘De Nieuwe Lichting\u003C/strong\u003E’ van \u003Cstrong\u003EStudio Brussel\u003C/strong\u003E en zijn sindsdien aan een stevige veroveringstocht bezig. Met hun rauwe \u003Cstrong\u003E90’s punkrock en grunge\u003C/strong\u003E, sterke attitude en scherpe teksten komen ze je op een podium bij jou in de buurt een geweten recht in je muil schoppen. Ontbrak nog in hun lijst: Diksmuide. Fixen we: jazeker.\u003C/p\u003E\n\u003Cp\u003EFrontman \u003Cstrong\u003EFerre Achten\u003C/strong\u003E laat er alvast geen twijfel over bestaan: \u003Cem\u003E“Het doel is de Belgische muziekscene helemaal overhoop te halen. Of dat gaat lukken? Zeker!”\u003C/em\u003E Kom het zelf ontdekken op 11 april. Zweet, chaos en een ‘what the fuck?’-gevoel gegarandeerd.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/yesnomaybe420/?locale=nl_BE\u0022\u003EFacebook\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/yesnomaybe._/\u0022\u003EInstagram\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Primitive Man \u002B Bloed \u002B Kollaps",
    "DateString": "2026-04-17 18:00:00",
    "Url": "https://www.4ad.be/event/primitive-man-bloed-kollaps/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/primitive-man-bloed-kollaps.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EPrimitive Man (vs)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EAmerikaanse doomdenkers komen met nieuwe plaat \u0026#8216;Observance\u0026#8217; naar Diksmuide.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EEthan McCarthy, Jonathan Campos en Joe Linden zijn al sinds 2012 over de hele wereld muzikale breinen aan het smelten. Ze combineren sludge metal, doom en noise rock tijdens energieke en krachtige liveconcerten die gegarandeerd een blijvende indruk nalaten. Ze werden in korte tijd cultartiesten binnen het genre, zo\u0026#8217;n band die we tot in de verdoemenis zullen blijven afspelen.\u003C/p\u003E\n\u003Cp\u003EDe nieuwe plaat Observance is anders dan hoe we Primitive Man tot nu toe kennen. Met motieven en symbolen die doorheen de teksten en het artwork (dat ook door McCarthy werd gemaakt) terugkeren, en geïnspireerd door het werk van Tongo Eisen-Martin – specifiek Blood on the Fog – biedt McCarthy geen antwoorden, hij probeert enkel zijn ervaringen te delen. Persoonlijke en professionele valkuilen worden onderzocht tegen de achtergrond van een gebroken sociaal contract dat het leven van de werkende klasse vernietigt. Terwijl partijpolitiek de media domineert, is er een meer insidieuze verdeeldheid die McCarthy bezighoudt, aangezien hij achtervolgd wordt door technofeodalisme en de toekomst van mensenrechten en sociale onrust.\u003C/p\u003E\n\u003Cp\u003EOndanks dat ze meer leunen naar hun experimentele kant, behouden PRIMITIVE MAN een stevige grip op het zware geluid dat hen al jaren definieert. Observance is nog steeds een uitdagend album, dat de aandacht van de luisteraar op elke draai vereist. Het geluid van Observance is doordrongen van een nieuw element voor de band – verdriet. Toch beschrijft McCarthy dit als het meest positieve PRIMITIVE MAN-album tot nu toe; zelfs terwijl ze de karkassen van desillusie uitpluizen, blijven ze een uitweg zoeken, een pad naar het licht.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/primitivemandoom/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/primitivemandoom/\u0022\u003EFacebook\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.youtube.com/watch?v=F1E50l2Ttx4\u0022\u003ELive on Audiotree\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EBloed (be)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EBeloftevol project van de broers Toon (Mother) en Tuur (Mother), en hun zus Fieke (Lightspeed, Ratmosphere) Soete.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003ESynth- en industrial metal van eigen bodem waar we nog zéér veel van gaan horen. De familie Soete begon pas in 2022 met hun schrijfsessies, maar het duurde niet lang voor ze hun eigen sound en identiteit wisten te vinden. In 2023 schopten ze het al meteen tot winnaar van Sound Track, de wedstrijd die 4AD samen met de rest van de Vlaamse muzieksector elke twee jaar organiseert. Sindsdien hebben ze al menig concertzaal omver mogen knallen, nu is het éindelijk aan ons. Een band die je boven alles live moet komen ervaren. Afkomen dus!\u003Cbr /\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/bloedband/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/bloedband\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EKollaps (aus)\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EBijzonder industrial-project van down under.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EKollaps is een Australisch post-industrieel project wiens geschiedenis onlosmakelijk verbonden is met geweld—zowel als onderwerp als fysieke werkwijze. Gevormd aan de rand van ineenstorting en persoonlijke desintegratie, heeft de band een reputatie opgebouwd voor optredens die confronterend, ascetisch en onwrikbaar zijn in hun toewijding aan realisme. De band is recentelijk verhuisd naar IJsland, een stap die de voortdurende zoektocht naar isolatie, ernst en een ongenadigere creatieve omgeving weerspiegelt.\u003C/p\u003E\n\u003Cp\u003EHun concerten draaien om een set van instrumenten en gereedschappen die uit lijkenhuizen afkomstig zijn: bloed- en speekselbesmeurde hoofdsteunen, kniestukken, hackzagen, keel-expanders, en andere apparaten die ooit werden gebruikt om het menselijk lichaam te manipuleren, openen en te weerhouden. Deze objecten zijn niet symbolisch. Ze functioneren als percussie-instrumenten en structurele componenten in de performance, waarbij ze het residu van hun oorspronkelijke doel meenemen in de sonische architectuur van het project. Mentale voorbereiding voor deze set is aangeraden.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/kollapsmusic/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/Kollapsmusic\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "La Jungle",
    "DateString": "2026-04-24 18:30:00",
    "Url": "https://www.4ad.be/event/la-jungle/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/la-jungle.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003ELa Jungle\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EExtra drummer, extra dansen.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EWanneer we een e-mail krijgen van de heren van La Jungle, met daarin het blije nieuws dat een extra drummer (bij ons beter bekend als Landrose) hen zal vervoegen voor een nieuw project, hebben wij maar één antwoord: WANNEER?\u003C/p\u003E\n\u003Cp\u003EWe zinderen nog altijd na van hun machtige passage op ons WATER\u0026amp;4-festival afgelopen zomer, maar nu schakelt La Jungle nog een versnelling hoger. Het duo wordt een trio met hun zevende studioalbum: \u003Cstrong\u003E‘An Order Of Things’\u003C/strong\u003E. Negen nummers die gezamenlijk werden geschreven in Bergen, aan de oevers van de altijd onheilspellende La Trouille, en opgenomen in de bossen van Normandië. In 2026 stellen Roxie, Jim en hun vriend Da, na 750 duo-shows, een andere orde der dingen voor.\u003Cbr /\u003E\u003Cstrong\u003EDubbele kick, dubbele snare, drievoudige trance.\u003C/strong\u003E Altijd dansend.\u003C/p\u003E\n\u003Cp\u003E‘An Order Of Things’ verschijnt op 17 april 2026 via Hyperjungle Recordings, het label dat door de band zelf werd opgericht.\u003C/p\u003E\n\u003Cp\u003EWij zijn enthousiast. Héél enthousiast.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://lajungle.bandcamp.com/\u0022\u003EBandcamp\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/lajungleband\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/lajungleband\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EStakattak\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EFamily trashpop trio.\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003EMinimalistisch, explosief en wild als een hondsdolle hond. Da’s wat we onthouden na een eerste livebeleving met het Belgische trashpop-punktrio \u003Cstrong\u003EStakattak\u003C/strong\u003E. Nick Defour, Lotte Beckwé en Thijs Beckwé maken al sinds 2017 wilde geluidsgolven met hun korte, catchy en onvoorspelbare nummers.\u003C/p\u003E\n\u003Cp\u003EVorig jaar brachten ze hun vierde plaat \u003Cstrong\u003E\u0026#8216;Bullseye in the Opera\u0026#8217;\u003C/strong\u003E uit en verstevigden ze hun positie als vaste waarde binnen de Europese undergroundscene. Hoog tijd dat ze bij ons komen demonstreren wat zo’n onofficiële award precies wil zeggen.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://stakattak.bandcamp.com/album/bullseye-in-the-opera\u0022\u003EBandcamp\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/stakattakofficial/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/stakattakofficial\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Kiss The Anus Of A Black Cat",
    "DateString": "2026-04-25 18:30:00",
    "Url": "https://www.4ad.be/event/kiss-the-anus-of-a-black-cat/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/kiss-the-anus-of-a-black-cat-1.png",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EKISS THE ANUS OF A BLACK CAT\u003C/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003ETerug in haar oorspronkelijke bezetting!\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003ENa een tijdje missing in action te zijn, gaat Kiss the Anus of a Black Cat terug op pad voor een speciale reeks reünieconcerten met zijn oorspronkelijke folkensemble om de 15e verjaardag te vieren van het alom geprezen album Hewers of Wood and Drawers of Water! De première is voor Roadburn Festival; het zou bijna illegaal zijn om 4AD niet in de reeks op te nemen. Correctie: het zou absoluut illegaal zijn.\u003C/p\u003E\n\u003Cp\u003EKTAOABC is het project van de Belgische songwriter en multi-instrumentalist Stef Heeren, onlangs nog bij ons op bezoek met Use Knife. De band ontstond begin jaren 2000 in Gent en blonk uit met haar hypnotische, duistere en psychedelische folk en de zwevende stem van Heeren.\u003C/p\u003E\n\u003Cp\u003EDe eerste platen If The Sky Falls, We Shall Catch Larks (2005), An Interlude to the Outermost (2007) en The Nebulous Dreams (2008) leverden KTAOABC meteen een trouwe groep fans op binnen de alternatieve muziekscene. De release van de plaat Hewers of Wood and Drawers of Water in 2010 zorgde voor een definitieve cultstatus, waarbij de band hun hypnotische folksound wist te transformeren tot oerdegelijke songwriting.\u003C/p\u003E\n\u003Cp\u003EIn de jaren die volgden breidde Heeren’s band geleidelijk zijn klankpalet uit, waarbij ze opschoven naar meer elektronische texturen en postpunk-invloeden, met Stefs stem en hun duistere psychedelische sound als de kern van het werk van de band op de albums Weltuntergangsstimmung (2012) en To Live Vicariously (2015).\u003C/p\u003E\n\u003Cp\u003EMet deze nieuwe tournee speelt KTAOABC niet alleen de 15 jaar oude cultplaat, maar gaat de band ook dieper in op haar roots en de nummers die hun eerdere jaren bepaalden.\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/kisstheanusofablackcatofficial/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/kisstheanusofablackcat\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "Knotwilg Festival",
    "DateString": "2026-05-09 16:00:00",
    "Url": "https://www.4ad.be/event/knotwilg-festival/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/knotwilg-festival-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Cp\u003E\u003Cstrong\u003EHet iconische Knotwilg Festival komt in 2026 naar Diksmuide! Knotwilg Records is het label dat bekendstaat als een portaal naar experimentele muziek en obscure acts. De volledige line-up zal binnenkort bekend worden gemaakt!\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003E\u003Cem\u003ETot nu toe aangekondigd: Eternal Music Society, pFeM en Split Apex!\u003C/em\u003E\u003C/p\u003E\n\u003Ch3\u003EETERNAL MUSIC SOCIETY (swe)\u003C/h3\u003E\n\u003Cp\u003EEternal Music Society is een Zweedse supergroep die is ontstaan uit de vruchtbare experimentele scene van Göteborg en Malmö, gecentreerd rond het visionaire Discreet-label. De band verenigt leden van enkele van de meest eigenzinnige undergroundprojecten van het afgelopen decennium:  Enhet För Fri Musik (Discreet), Skeppet, Frihet, Neutral, Leda (Knotwilg) en Kröppskanedom (Morc).  Elk bekend om het verleggen van de grenzen van vrije muziek, drone en avant-rock.\u003C/p\u003E\n\u003Cp\u003ESamen vormen ze een collectief dat de ruwe geest van improvisatie omzet in een dichte, hypnotiserende wervelstroom van fuzzy noiserock. Hun geluid draait om gruizige, overstuurde gitaren, een diep groovende bas en onophoudelijk repetitieve drumpatronen die samensmelten tot een trance-achtige puls. De twee drummers zorgen niet alleen voor strakke ritmes, maar creëren ook een subtiele, bijna psycho-akoestische fasewerking die de grens tussen structuur en chaos doet vervagen. Verslavende, repeterende riffs golven op en neer, met een euforische kracht die uitnodigt tot wat je alleen maar ‘cloud-busting psych headbanging’ kunt noemen.\u003C/p\u003E\n\u003Cp\u003EIn aanloop naar het festival brengt Knotwilg Records een gelimiteerde LP van de groep uit, voorzien rond februari/maart 2026. Na hun in eigen beheer uitgebrachte debuutsingle Eternal Return / Impasse (2025) belooft dit album de meeslepende live-energie van de band in volle analoge glorie vast te leggen.\u003C/p\u003E\n\u003Cp\u003ESelectieve discografie:\u003Cbr /\u003EEternal Return / Impasse7” (eigen beheer, 2025)\u003Cbr /\u003ETBALP (Knotwilg Records, 2026)\u003Cbr /\u003EVoor liefhebbers van: Water Damage, France, Spacemen 3 / Loop, Shellac, Steve Reich\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://eternalmusicsociety.bandcamp.com/\u0022\u003EBandcamp\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003EPFEM (fr)\u003C/h3\u003E\n\u003Cp\u003EBrutalistische gitaarnoise in haar puurste vorm. pFeM is het compromisloze duo van Pierre Faure (Sun Stabbed, La Morte Young) en Erik Minkkinen (Sister Iodine), twee zwaargewichten uit de Franse experimentele ondergrond. Hun geluid: aangetaste feedbacklagen en massieve drones die traag verschuiven, instorten en weer herrijzen als aardplaten in beweging.\u003C/p\u003E\n\u003Cp\u003ETijdens Knotwilg Festival gaan ze de confrontatie aan met de IJzer in een sidderend bombardement van gitaargolven dat de oevers van Diksmuide uitdaagt. Houdt 4AD stand? Natuurlijk. Maar niet zonder trillingen in de fundamenten.\u003C/p\u003E\n\u003Cp\u003EVoor het eerst op een Belgisch podium.\u003Cbr /\u003EZware guitardrones. Kom voorbereid.\u003C/p\u003E\n\u003Cp\u003EGreep uit de discografie:\u003Cbr /\u003EpFeM – Before Rising Waters(Knotwilg Records, 2024)\u003Cbr /\u003ESun Stabbed – In Girum Imus Nocte Et Consumimur Igni(Doubtful Sounds, 2020)\u003Cbr /\u003ESister Iodine – Hollozone(Nashazphone, 2023)\u003Cbr /\u003EVoor fans van: Surface of the Earth, Sunn O))), Gate, Flying Saucer Attack (de harde variant)\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://dysmusie.bandcamp.com/\u0022\u003EBandcamp\u003C/a\u003E\u003C/p\u003E\n\u003Ch3\u003ESPLIT APEX (UK)\u003C/h3\u003E\n\u003Cp\u003EHet uithollen van krabbepoten is een ambacht dat even precies en intens is als het wegschrapen van overtollige klanken uit een songstructuur. Precies dát beheerst Split Apex als geen ander.\u003Cbr /\u003EHet duo Peter Blundell en Jussi Palmussari bouwt aan een wereld van diepe, pulserende baslijnen, minimale, poëtische maar dreigende vocals, inventieve elektronica, noisy doch ingehouden gitaarimplosies, gedragen door subtiele, trefzekere ritmes. Muziek die niet aandikt, maar uitbeent; niet stapelt, maar snijdt.\u003C/p\u003E\n\u003Cp\u003EEcho’s van Blundells verleden bij Mosquitoes sijpelen onmiskenbaar door en voelen tegelijk als een logisch vervolg. Hun debuut-LP Thoughts In 3D (Ever/Never) werkt hypnotiserend, bezwerend en haast ademloos: gedeconstrueerde postpunkdub die je dwingt te luisteren tussen de klanken, op zoek naar houvast.\u003C/p\u003E\n\u003Cp\u003EReferentiepunten lijken te ontbreken, tot ze zich plots aandienen. Een uitgemergelde Shadow Ring. Public Image Ltd. ten tijde van Metal Box. En ja, zelfs een onwaarschijnlijke alliantie tussen Throbbing Gristle en Captain Beefheart voelt hier niet vergezocht.\u003C/p\u003E\n\u003Cp\u003ESplit Apex past naadloos binnen het universum van Knotwilg Festival: compromisloos, intens en eigenzinnig. Net als pFeM en Eternal Music Society is hun optreden een primeur en exclusief voor België (en omstreken).\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://evernever-records.bandcamp.com/album/thoughts-in-3d\u0022\u003EThoughts In 3D (Ever/Never)\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://knotwilg.bandcamp.com/album/reverse-drift-reverse-charge\u0022\u003EBandcamp\u003C/a\u003E\u003C/p\u003E"
  },
  {
    "Title": "EYEHATEGOD",
    "DateString": "2026-06-23 18:30:00",
    "Url": "https://www.4ad.be/event/eyehategod/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/eyehategod.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "\u003Ch3\u003EEYEHATEGOD (vs)\u003C/h3\u003E\n\u003Cp\u003ETijd om nog eens absolute levende legendes op ons podium te halen. \u003Cstrong\u003EEYEHATEGOD\u003C/strong\u003E is al sinds 1988 het toonbeeld van de \u003Cstrong\u003ESouthern sludge metal\u003C/strong\u003E en komt helemaal naar het meest verdoemde verdoemishoekje van het land: Diksmuide!\u003C/p\u003E\n\u003Cp\u003EDebuutplaat \u003Cstrong\u003E\u0026#8216;In the Name of Suffering\u0026#8217;\u003C/strong\u003E uit 1990 maakte de belofte van zijn titel waar met gekwelde zang, logge powerchords, misantropische teksten en slepende sludgeriffs die zich ontvouwen tot explosies van hardcorepunksnelheid. EYEHATEGOD ontpopte zich al snel tot een van de sleutelfiguren van de NOLA-scene, een positie die ze verder verankerden met hun tweede album \u003Cstrong\u003E\u0026#8216;Take as Needed for Pain\u0026#8217;\u003C/strong\u003E (1993), een feest van ellende, doordrenkt in diepe sludge. Die lijn wordt doorgetrokken op \u003Cstrong\u003E\u0026#8216;Dopesick\u0026#8217;\u003C/strong\u003E (1996), dat balanceert tussen lange, verstikkende doomnummers en kortere, met punk doordrenkte tracks, met Mike Williams’ stem als verbindend element — aangedreven door een leven vol brute pech en nog rampzaligere keuzes. Onmiskenbaar een van de kernplaten binnen het sludgegenre en verplichte luisterkost voor liefhebbers.\u003C/p\u003E\n\u003Cp\u003EHun meest recente plaat \u003Cstrong\u003E\u0026#8216;A History of Nomadic Behaviour\u0026#8217;\u003C/strong\u003E (2021) kwam voort uit de driejarige tour waar ze in 2017 op vertrokken en de twee jaar durende pandemie vol politieke woelingen en eindeloze hypocrisie. Het resultaat is een combinatie van door blues doordrenkte en met benzine overgoten vervormde klanken, bestaande uit grotendeels mid-tempo nummers, doorboord met schrijnende pijn en ontredderde woede.\u003C/p\u003E\n\u003Cp\u003EIn 2026 trekken ze opnieuw de lange baan op, met \u003Cstrong\u003EMike IX Williams\u003C/strong\u003E op zang, \u003Cstrong\u003EJimmy Bower\u003C/strong\u003E op gitaar, \u003Cstrong\u003EGary Mader\u003C/strong\u003E op bas en \u003Cstrong\u003EAaron Hill\u003C/strong\u003E aan de drums. Een essentiële band om op je \u0026#8216;heb ik ooit nog live gezien\u0026#8217;-bingokaart te doorstrepen!\u003C/p\u003E\n\u003Cp\u003E\u003Ca target=\u0027_blank\u0027 href=\u0022https://www.instagram.com/eyehategodnola/\u0022\u003EInstagram\u003C/a\u003E | \u003Ca target=\u0027_blank\u0027 href=\u0022https://www.facebook.com/OfficialEyeHateGod\u0022\u003EFacebook\u003C/a\u003E\u003C/p\u003E"
  }
]