[
  {
    "Title": "MISS ANGEL + MAHINA",
    "DateString": "2026-01-30T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/miss-angel-mahina-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f616/78/179803a6cb27e130000b4ef3c7526abf03ed7577.jpg",
    "Location": "De Kreun",
    "Description": "MISS ANGELMiss who? MISS ANGEL! Angela aka Miss Angel is een jonge lyriciste uit Antwerpen. Hip hop was altijd al een deel van haar leven, maar in 2016 ontdekte ze ook haar eigen stem en begon ze&amp;nbsp;nummers te schrijven. Het duurde niet lang voor ze met enkele beatmakers de studio induikte: daaruit kwamen straffe nummers als &#039;All of the Shmoke&#039;, &#039;Money Making Mami&#039; en &#039;Ghetto Supahstar&#039;. Nu als deelnemer aan &#039;Dancing with the Stars&#039; zette MISS ANGEL zich verder op de kaart. Miss Angel’s sound is sterk beïnvloed door UK grime, old school hip-hop and vrouwelijke MCs.&amp;nbsp;&amp;nbsp;MAHINAMahina Ngandu is een Brussels based artiest. In 2015 krijgt ze bij Mama’s Open Mic voor het eerst de kans haar zangtalent met een groot publiek te delen, waar ze meteen lovende commentaren op krijgt. Vanaf dan beslist ze om als zangeres haar stem te gebruiken en haar liefdevoor kunst via verschillende kunstdisciplines te uiten. Zo ontstond dan ook het concept &#039;Chameleon&#039;.&amp;nbsp;Dankzij haar sterke en veelzijdige persoonlijkheid, én als Afrikaanse vrouw, laat Mahina zich als zangeres uit op Afro pop, soul, RnB, Congolese melodieën en ritmes, reggae en meer. Ze maakt er haar artistieke uitdaging van om haar eigen stijl te vinden tussen die van ‘zwarte muziek’ uit verschillende tijden en plaatsen.De double bill &#039;MISS ANGEL &amp;amp; MAHINA&#039; zit in het CUBO-aanbod van Schouwburg Kortrijk. CUBO-tickets kun je enkel reserveren bij Ticketservice Kortrijk - telefonisch (056/23 98 55), aan de balie of via&amp;nbsp;ticketservice@kortrijk.be. Meer info over CUBO&amp;nbsp;vind je hier.Had je een ticket voor deze double bill op Blender (5/07)? Dan krijg je automatisch toegang tot dit concert. Heb je een ticket, maar kan je niet komen? Contacteer gerust tickets@wildewesten.be !"
  },
  {
    "Title": "XINK: AFSCHEIDSSHOW",
    "DateString": "2026-01-31T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/xink-afscheidsshow",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6545/d4/33ed9f495a6322c05327154cae8048a375cfdb1a.jpg",
    "Location": "De Kreun",
    "Description": "Na vier uitverkochte AB-shows en spots op Rock Werchter en Pukkelpop, keerde XINK sterk terug. Wat begon als een tienerband met hits als &quot;Laat Me Vrij&quot; en &quot;De Vriendschapsband&quot;, is uitgegroeid tot een volwassen band die hun roots niet vergeet, maar wel durft te vernieuwen. Met hun derde album &quot;Dag Nul&quot; slaat de band een frisse creatieve weg in. Nieuwkomer Jasper Mulier op bas en co-producer Simon de Wit (aka Blanks) zorgen voor frisse wind door de sound, zonder het vertrouwde XINK-DNA te verliezen.De band kondigde recent hun stop aan, waardoor deze show een van de laatste shows wordt die je live kan meemaken. Twijfel niet, koop snel je ticket!&amp;nbsp;support: BearscapeIndie-pop met een flinke portie variatie. Van trage, melancholische nummers voor regenachtige dagen tot vrolijke uptempo songs die spontaan een glimlach op je gezicht toveren."
  },
  {
    "Title": "WORKSHOPREEKS DIGITALE MUZIEKPRODUCTIE",
    "DateString": "2026-02-05T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/workshopreeks-digitale-muziekproductie",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/42e3/56/cabd9bb7375d86aa53f308ea534fb4b9c3aed913.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "Muziekproductie: van idee tot afgewerkte trackWilde Westen biedt in samenwerking met TRACK &amp;amp; yungsnem een intensief traject muziekproductie aan voor iedereen die zelf muziek wil maken en zijn ideeën wil uitwerken tot een volledige, afgewerkte track. In 10 workshops (elke week op donderdag) bouwen we stap voor stap op: van de basis van een DAW tot productie, vocalopname, mixing en mastering. De workshop start op 5/02 en gaat verder door op 12/02, 26/02, 5/03, 12/03, 19/03, 26/03, 2/04, 23/04 en 7/05.Deelnemers leren werken met een Digital Audio Workstation (DAW) (Ableton Live of FL Studio), ontwikkelen sterke loops en muzikale ideeën, en leren hoe ze structuur, vocals, mix en master samenbrengen in één coherente productie. Het traject is praktijkgericht en geschikt voor beginners met of zonder basiskennis.OpzetElke workshop bestaat uit:Theorie &amp;amp; demonstratie: duidelijke uitleg met concrete voorbeeldenPraktijk: meteen aan de slag met persoonlijke begeleiding en feedbackWe werken in kleine groepen tot 8 deelnemers, zodat er voldoende ruimte is voor individuele ondersteuning.Inhoud van het traject (10 sessies)Intro &amp;amp; kennismaking met de DAWVoorstelling van het traject&amp;nbsp;Kennismaking met de cursisten&amp;nbsp;Eerste kennismaking met het gekozen programma (+ nagaan of alles technisch klaar is om er volgende lessen te beginnen)Drumgrooves en audioloopsHoe maak je een goeie drumgroove en welke elementen heb ik hiervoor nodig (afhankelijk van het genre)?&amp;nbsp;Hoe kan je audioloops gebruiken in een beat (stretchen, pitchen, choppen)?MIDI, baslijnen en melodieënWat is MIDI en hoe kan ik het gebruiken in mijn producties?&amp;nbsp;Hoe maak ik een stevige baslijn?&amp;nbsp;Hoe maak ik een melodie die “juist” en mooi klinkt? Welke elementen gebruik ik hiervoor (vb. akkoorden en topline)?Van loop naar volledige trackstructuurHoe bouw ik een loop uit tot een volledige track met een goede structuur?Mixing (les 5, 6 en 7): setup, EQ, dynamiek en effectenHoe maak ik een project klaar om te mixen (orde brengen, mixer routing)?&amp;nbsp;Hoe werkt gain staging en headroom?&amp;nbsp;Werken met busses/group tracks&amp;nbsp;Werken met sends/fx tracks&amp;nbsp;Hoe werken filters?&amp;nbsp;Hoe werkt een EQ?Vocal recording&amp;nbsp;Hoe ziet een basis studio setup eruit (info over al het materiaal die nodig is om zelf opnames te maken)?&amp;nbsp;Hoe maak ik een goeie en cleane vocal opname? (demonstratie van een studiosessie met artiest erbij)vocal mixingHoe maak ik een vocal opname klaar om te mixen?&amp;nbsp;Hoe gebruik ik autotune?&amp;nbsp;Hoe pas ik EQ en compressie toe op een vocal om die op te schonen en naar voor te brengen in de mix?&amp;nbsp;Hoe voeg ik karakter toe aan mijn schoongemaakte vocals met reverb, delay, saturation, etc.?Hoe mix ik backing vocals en adlibs?Mastering en afwerking van de trackBasis over hoe je een goede master maakt en hoe je de aangeleerde mixconcepten hierop toepast (vb. EQ, compressie, limiting)Aan het einde van het traject beschikken deelnemers over de kennis én tools om zelfstandig een eigen productie af te werken.PraktischBenodigdheden: laptop met DAW + koptelefoonGroepsgrootte: max. 8 deelnemersLocatie: Multimedialab Track"
  },
  {
    "Title": "OZARK HENRY",
    "DateString": "2026-02-06T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ozark-henry-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/036d/42/0adbbd4a5c0d1ac5767a7fb28591c9581923e9da.jpg",
    "Location": "De Kreun",
    "Description": "Acht jaar lang was het stil rond Ozark Henry, maar dit najaar breekt hij die stilte met August Parker, zijn tiende studioalbum.&amp;nbsp;De thematiek van August Parker raakt aan verandering en veerkracht. Eén van de sleutelmomenten op de plaat is het aangrijpende ‘Light’. De inspiratie haalde Piet Goddaer dicht bij huis. “Ik heb iemand gekend die doofstom geboren is, maar rond zijn dertigste de kans kreeg om via een implantaat toch te kunnen horen. Het werd hem voorgesteld als iets geweldigs, maar na een week proberen vond hij het verschrikkelijk en wilde hij zijn oude leven terug. Het gaat, kortom, over in een situatie terecht komen die volgens anderen een vooruitgang betekent. Als een blinde de belofte krijgt dat hij zal kunnen zien is dat létterlijk iets om naar uit te kijken, maar tegelijk is er het besef dat je dan ook afscheid moet nemen van alles wat je tot op dat moment als vertrouwd hebt beschouwd.”&amp;nbsp;Voor de esthetische wereld rond August Parker sloeg Ozark Henry de handen ineen met filmmaker Lukas Desmet, die de kunst van Kintsugi – het Japanse ambacht waarbij breuken met goud worden hersteld – als leidmotief gebruikte. De boodschap is krachtig: schoonheid schuilt in imperfectie, barsten vertellen verhalen, en muziek verbindt de scherven.Live overstijgt Ozark Henry genres en verwachtingen—zijn meeslepende shows, van grote festivals tot uitverkochte zalen, zijn pure cinematografie in geluid.&amp;nbsp;Belangrijk: dit is een staand concert!&amp;nbsp;&amp;nbsp;support: Kris DaneDe voorbije jaren is Kris Dane uitgegroeid tot één van de meest authentieke singer/songwriters in België. Op zijn nieuwe, inmiddels negende plaat zet de Antwerpenaar zijn uniek parcours verder en slaat hij tegelijk weer nieuwe wegen in. Benieuwd hoe dat klinkt? Kom mee ontdekken op 6 februari!"
  },
  {
    "Title": "SPOETNIK @HOF",
    "DateString": "2026-02-07T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/spoetnik-hof-6",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7b38/5a/cca2f8c31b29a555cf9a1aa118b6228758db7620.jpg",
    "Location": "HOF",
    "Description": "Met &#039;Spoetnik&#039; ondersteunen we elk jaar een tiental opkomende muzikale talenten uit de streek. Gaande van jazz over klassiek, van rock naar hiphop en alles ertussen.Op zaterdag 7 februari, tijdens de Week van de Belgische Muziek lanceren we een gloednieuwe Spoetnik-sessie bij onze buren van HOF! Inkom is volledig gratis.Aan de beurt die avond: BILLY, ELISE en FOULON!"
  },
  {
    "Title": "DANSFEESTJE: De Belgische Editie",
    "DateString": "2026-02-07T21:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/dansfeestje-de-belgische-editie",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1322/86/e06995f121b0aa4f0e3a493ee7dd263a127982fc.png",
    "Location": "De Kreun",
    "Description": "Nog eens een goed dansfeestje? Als afsluiter van de Week van de Belgische Muziek duiken we met Muziekcafé HOF en Wilde Westen vol overgave in onze eigen muziekgeschiedenis.Geen saaie geschiedenisles maar wél pure, platte goeie schijven. Eppo Janssen en Nadiem Shah trekken een lijn door decennia Belgische clubgeschiedenis: van zweetdruppelende new beat tot hiphop van eigen bodem, van vergeten parels tot tijdloze knallers. Een dansvloer waar generaties elkaar ontmoeten en Belgische muziek doet waar ze het beste in is: mensen laten losgaan. Inkom = 6 euro incl. gratis drankje!&amp;nbsp;"
  },
  {
    "Title": "MATINEE: SPECTRA &amp; JULIEN LIBEER",
    "DateString": "2026-02-08T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-spectra-julien-libeer",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/5095/58/c42edb106a0036ec8fba8af7294ec236291d5a8b.jpg",
    "Location": "Concertstudio",
    "Description": "Tien beelden geboetseerd door piano&amp;nbsp;Aan het begin van de twintigste eeuw schreef de Franse impressionist Maurice Ravel zijn ‘Miroirs’, vijf karakterstukken voor piano. Elk stuk, opgedragen aan één van de leden van de controversiële kunstenaarscollectief ’Les Apaches’, is een beklijvend beeld, gereflecteerd door Ravels artistieke persoonlijkheid. In ‘Spiegel van Spiegels’ vertolkt Julien Libeer Ravels de vijf portretten op piano, terwijl SPECTRA ze reflecteert in evenveel parels uit een recent verleden.&amp;nbsp;Kaija Saariaho’s ‘Sept Papillons’ verdrijft de duistere sfeer van de nachtvlinders uit ‘Noctuelles’. De verdwaalde vogels in een somber woud onder een drukkende zomerhitte in ‘Oiseaux Tristes’ zetten hun lied verder in ‘The Birds in Warped Time II’ van Somei Satoh. Ook ‘Une Barque sur l’Océan’ vaart na ongeveer een eeuw bevreemdend verder in Murails ‘La barque Mystique’. De opzwepende Spaanse ritmes uit het ochtendlied van de nar (‘Alborada del Gracioso’) verstommen aan de rand van de nacht in Sciarrino’s ‘Ai limite della notte’ terwijl het Parijse klokkengelui op volle middag in ‘La vallée des cloches’ langzaamaan uitsterft in het mystiek ritueel van ‘Lettre Soufie: Sh(în)’ van Jean-Luc Fafchamps.&amp;nbsp;In totaal dus tien sublieme en intense klankschilderingen, spiegels van spiegels van hun tijd."
  },
  {
    "Title": "PETER DOHERTY",
    "DateString": "2026-02-08T18:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/peter-doherty",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/fd3d/c7/6e9989b0fe6cf6a977ced8d6b2e227c6d03f8edf.jpg",
    "Location": "De Kreun",
    "Description": "In 2025 tourde Peter Doherty met zijn band door het Verenigd Koninkrijk en Europa, met optredens op grote festivals en eigen headline-shows. Zijn nieuwste album Felt Better Alive werd zijn grootste UK-release tot nu toe, goed voor een Top 10-notering en lovende recensies in o.a. Mojo, The Times, Le Monde, Les Inrocks en Der Spiegel.Doherty’s band bestaat uit topmuzikanten als Mike Joyce (The Smiths), Mike Moore (Liam Gallagher), Mark Neary (Baxter Dury), Jack Jones (Trampolene) en Katia de Vidas — zijn vrouw — op toetsen.Met Felt Better Alive toont Doherty zich op zijn meest open en geïnspireerd. Het album — een speelse mix van folk, pop en poëtische reflectie — ademt warmte, melodisch vakmanschap en een nieuw soort rust.Als bezieler van The Libertines en Babyshambles is Peter Doherty uitgegroeid tot een icoon van de Britse indierock: een overlever, dichter en muzikant die blijft verrassen met oprechte, meeslepende muziek.&amp;nbsp;supports: LAMOUR + LuvcatLAMOURLAMOUR staat voor een compromisloos oprechte popbenadering waarin wellustige rock versmelt met gevoelige en provocerende ballads. Zoete melodieën gaan hand in hand met elektronische dance, in de traditie van Factory Records-iconen Rough Trade. Een scherpe elektrische gitaar vormt het decor voor gevoelige, brutale en bedwelmende teksten, doordrenkt van sarcasme en surrealistische humor. Bovenal is LAMOUR een croonersstem gedragen door een aanstekelijke punkenergie.&amp;nbsp;LuvcatLuvcat brak door met haar zwoele debuutsingle Matador en bracht ons in haar theatrale wereld vol romantiek, chaos en rock-’n-rolldecadentie. Gevoed door invloeden als Nick Cave, Cabaret en The Cure vermengt ze gothic swagger met glamoureuze allure, geworteld in haar eigen escapistische verhalen over liefde, obsessie en ontsporing.&amp;nbsp;"
  },
  {
    "Title": "ZING!",
    "DateString": "2026-02-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/zing",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4851/79/b4ffc66ef5857d4c55fc61a84b3168a105203d8f.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "ZING staat voor de magie van meerstemmig &amp;amp; vollenbak zingen. Opgezweept door DJ &amp;amp; zangmaker Lisa Jordens knallen we de heerlijkste popsongs in een warm bad van energie &amp;amp; verbinding. Je moet geen noten kunnen lezen en je muzikale niveau is van geen belang. Een grote groep maakt vanzelf muziek, en Lisa weet als geen ander hoe je daar samen iets moois -en vooral megaleuks- van maakt. Denk ABBA, Madonna, Taylor Swift. You name it, bij ZING zingen we het!&amp;nbsp;Gratis, maar registratie is verplicht, klik door hiernaast naar de website van Muziekcentrum Track om je te registreren.Locatie: Hal B Muziekcentrum Trackwww.zing.cool&amp;nbsp;@zing.cool&amp;nbsp;&amp;nbsp;Foto&#039;s: fotograaf Rembrand Neirinckx (Rembrand.be)&amp;nbsp;"
  },
  {
    "Title": "LEGENDS OF ROCK TRIBUTE FESTIVAL  - MONSTERS OF ROCK",
    "DateString": "2026-02-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/legends-of-rock-tribute-festival-monsters-of-rock",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6167/a7/b329eb8f2957d1f9c9ddd6a6e870315541654db2.jpg",
    "Location": "De Kreun",
    "Description": "Op vrijdag 13 februari komt de LEGENDS of ROCK Tribute Tour naar Kortrijk met een spectaculaire MONSTERS of ROCK-editie. De No.1 tribute bands van Metallica, AC/DC en Guns N’ Roses zullen alle hits en de beste albumsongs van hun muzikale helden op spectaculaire wijze en op het allerhoogste niveau het publiek in spelen. Met dynamische lichtshows, special effects en in een perfecte ambiance zorgen deze top bands voor een aaneenschakeling van rauwe en dampende concerten. Met dit monsterlijke programma zullen ze Kortrijk op haar grondvesten laten schudden.“De LEGENDS of ROCK Tribute Tour is in het leven geroepen om de beste tribute bands van Europa de mooiste podia te bieden waarop hun dynamische shows optimaal tot hun recht komen.&amp;nbsp;Hierdoor ondergaat het publiek de ultieme live-beleving!&amp;nbsp;Met onze No.1 tribute bands van Metallica, AC/DC en Guns N’ Roses&amp;nbsp;is dit een MONSTERS of ROCK-ervaring van het hoogste niveau!”&amp;nbsp;- aldus promoter/producer John Van den Borne."
  },
  {
    "Title": "BUZZCOCKS",
    "DateString": "2026-02-14T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/buzzcocks",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/39c0/78/e6534983fa666de9695808bd61291ce8aa50ebf0.jpg",
    "Location": "De Kreun",
    "Description": "In een steeds somberder wordend muzikaal landschap, waar virale rages en door AI gegenereerde nepnummers de hitlijsten delen met de egocentrische producten van de toneelscholen van het land, schitteren Buzzcocks als een stralend baken van hoop. De band is al 45 jaar een constante, steeds evoluerende aanwezigheid in de popcultuur en hun legendarische status zal in september letterlijk in steen worden gebeiteld met hun opname in de Music Walk Of Fame.De live shows van de band, die beter zijn dan ooit, zijn ondertussen een opwindende herinnering aan de kracht van rockmuziek om te inspireren, te onderwijzen en te informeren.Met Steve Diggle als &#039;high priest&#039; zijn Buzzcocks nog steeds de band om in te geloven.&amp;nbsp;support: Chiff ChaffsChiff Chaffs ontketenen een psychotische rock-’n-roll die je in zo’n razend tempo omver blaast dat je je afvraagt wat je net heeft geraakt. Gedreven door brute ritmes, grommende zang, priemende orgelklanken en primitieve riffs razen ze met ongeremde intensiteit door hun nummers."
  },
  {
    "Title": "OKAPI - Klankennest",
    "DateString": "2026-02-17T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/okapi-klankennest",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/bbca/6f/d5962375fb47b4ed2b7afd4052078ad0eb517bdb.jpg",
    "Location": "Concertstudio",
    "Description": "Klanken uit klei? Jawel, op vraag van Klankennest creëert kunstenares Gemma Luz Bosch sculpturen die door hun vorm en positie unieke geluiden produceren. In combinatie met de speelse vormen van de creaties ontstaat een wonderlijke wereld, die het publiek samen met de performers mag manipuleren, zodat steeds nieuwe klanken en vormen ontstaan.&amp;nbsp;Voor zijn nieuwste creatie inspireert Klankennest zich op Vlaamse polyfonie, vroege barokmuziek en de textuur en creatieve mogelijkheden van … klei. Klanken worden gevormd door unieke kleisculpturen die kunstenares Gemma Luz Bosch op vraag van Klankennest voor deze voorstelling creëert. Ze vormen ijkpunten in een landschap van natuurlijke klei dat door speelse manipulatie van performers én publiek voortdurend van uitzicht en geluid verandert. Net als het dier – sierlijk en speels, vertrouwd en mysterieus – neemt ‘OKAPI’ het publiek mee langsheen contrasterende werelden van oude en nieuwe muziek, vertrouwde en vernieuwende instrumenten, structuur en vrijheid… in een uitnodiging om eindeloos te spelen en te verkennen. &amp;nbsp;"
  },
  {
    "Title": "THE SERFS ✘ BODY TO BODY ✘ DEATH DISCO AFTERPARTY",
    "DateString": "2026-02-20T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/the-serfs-body-to-body-death-disco-afterparty",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/05a5/d9/d9c8e8862a6e7efd02bff97d2c8776d0fdc98979.jpg",
    "Location": "De Kreun",
    "Description": "The SerfsThe Serfs, met roots tussen de silo&#039;s in het zuidwesten van Ohio, is een duistere en industriële bende dansvloer-kunstenaars. Het is een band van gestoorde troubadours wier geluid en muzikale ideologie een logisch gevolg lijkt te zijn van hun directe omgeving: hard bekabelde en hypnotiserende gesynthetiseerde melodieën die zich voortbewegen op een kolkende en schrapende percussie met metaalachtige tonen.For fans of: Devo, Cabaret Voltair, Parade Ground, New Orderaftershow: Body to BodyBody To Body is het gloednieuwe project van Bram Coussement en Bert Libeert. Behalve hun Kortrijkse roots delen ze ook dezelfde muzikale smaak én dezelfde obsessie voor een strakke soundesthetiek.Beiden duiken al jaren op in allerlei bands (VAAG, Bloodbubble, GOOSE, B1980) en hebben een stevige stapel releases achter de kiezen. Met Body To Body bundelen ze hun eigenzinnige visies tot één frontale, zinderende aanval.Geïnspireerd door EBM-legendes als Front 242 en Nitzer Ebb, maar dan met een extra shot persoonlijkheid en een gezonde punkattitude, tillen ze het genre naar een andere dimensie.Live gaan ze all-in: volledig analoge machines, ronkende synths en old-school drumpads die je ribbenkast doen trillen. Verwacht donkere baslijnen, industriële beats en vocals met een boodschap. Eerste liveshow ooit — mis het niet!afterparty: Death DiscoDeath Disco is het dark-wave/EBM-feestconcept van Bram, Mich, Juju &amp;amp; co — een plek waar duistere vibes en dansbare beats elkaar ontmoeten in een rookgordijn van stroboscooplicht. Na de live shows serveren ze perfect passende, pikzwarte maar onweerstaanbaar swingende plaatjes. BRAMSKI BEAT x JUJU nemen het over met een all-vinyl set die je zonder pardon de nacht in sleurt. Zwart, luid en dansbaar. Zoals het hoort."
  },
  {
    "Title": "SONS",
    "DateString": "2026-02-21T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/sons-2",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/d43d/6f/5fcb906816f31449c8fe73fb33eb6576ca007137.jpg",
    "Location": "De Kreun",
    "Description": "Met hun debuutalbum ‘Family Dinner’ (2019) brak SONS door in de Benelux, en met opvolger ‘Sweet Boy’ (2022) veroverden ze ook Duitsland, Frankrijk, Zwitserland en Griekenland. Hun mix van rauwe energie, krachtige rock, catchy refreinen en stevige riffs bracht hen naar grote festivals als Rock Werchter, Pukkelpop, Pinkpop, Trans Musicales en Iceland Airwaves, én leverde hen supportshows op voor Royal Blood, Wolfmother en Jack White.Met ‘Do My Thing’ slaan ze een nieuwe weg in: de band laat hun vertrouwde explosieve garage-rockgeluid even achter zich en kiest voor een frisser, helderder geluid. Om dat universum verder uit te bouwen, schakelden ze Dave McCracken in – de man achter het sexy groove-geluid van “The Architect” van dEUS. Met samenwerkingen met Ian Brown (The Stone Roses), A$AP Rocky, Beyoncé en Depeche Mode op zijn palmares, tilt McCracken de sound van SONS naar een nieuw niveau.Hoe dat live klinkt? Ontdek het op 21 februari bij Wilde Westen!&amp;nbsp;support: PyoWat als Joy Division en Ekkstacy verdwaald waren geraakt in het neonverlichte Hongkong van de jaren 90? Zo klinkt Pyo, het zinderende project van de in Brussel gevestigde Karel Piot dat net geselecteerd werd voor de finale van De Nieuwe Lichting. Ergens tussen Ekkstacy, Mareux en The Haunted Youth in, is de muziek van Pyo een mix van moderne postpunk en de new wave-sounds van de jaren 80. Door zijn pakkende en introspectieve teksten dompelt Pyo je meteen onder in zijn retro cyberpunkuniversum."
  },
  {
    "Title": "KAMEEL",
    "DateString": "2026-02-22T20:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/kameel",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/e66b/b3/012a62c7a4d4da1cc927f13815f3263eb885adb7.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowKameel is een avontuurlijk trio dat moeiteloos laveert tussen jazz, rock, elektronica en vrije improvisatie, altijd met een filmische ondertoon die je meesleept van de eerste noot tot de laatste. Hun sound is tegelijk groovy en rauw, speels en onvoorspelbaar.In november 2025 verschijnt hun gloednieuwe plaat bij Pang Pang Records. Voor het eerst laat de band ook vocalen toe, met bijdragen van niemand minder dan Rudy Trouvé en Tim Vanhamel, wat hun universum een frisse en verrassende dimensie geeft.De afgelopen jaren bouwde Kameel gestaag aan een eigenzinnig repertoire met de albums Barkas (2020) en Trugschluss (2023). Met de nieuwe release zetten ze die zoektocht verder – compromisloos, gedurfd en altijd in beweging."
  },
  {
    "Title": "FEMKE GYSELINCK / GRIP &amp; B&#039;ROCK ORCHESTRA - Torment of Hearts + SCHNTZL",
    "DateString": "2026-02-27T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/femke-gyselinck-grip-b-rock-orchestra-torment-of-hearts-schntzl",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/b610/b7/df5667b1ea89f8da954459279aef70440db04d0d.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "Een dialoog tussen muziek en dansEnkele jaren geleden maakte Femke Gyselinck kennis met de dialoogcantates van Bach.&amp;nbsp;Johann Sebastian Bach, barokker kan het niet. In zijn oeuvre nemen de dialoogcantates een bijzondere plek in, een zeldzame kans om hemel en aarde in gesprek te horen.&amp;nbsp;Femke en B’Rock Orchestra stelden zich samen de volgende uitdaging: Welke andere muziek kan hieraan toegevoegd worden die een contrast creëert, maar geen chaos? Hoe kan een geheel ontstaan tussen muziekcomposities uit verschillende periodes en tijdsgeesten? Welke dansante taal kan er daarbij gehanteerd worden?&amp;nbsp;"
  },
  {
    "Title": "BOOTCAMP ABLETON (GEVORDERDEN)",
    "DateString": "2026-02-28T10:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/bootcamp-ableton-gevorderden",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7846/b3/b1189d6d2bca79500d3666d364e9fd1c7c40050d.jpg",
    "Location": "Muziekcentrum Track",
    "Description": "Tweedaagse Ableton Live Advanced cursus&amp;nbsp;Data: 28 februari en 1 maart. Op 28 februari van 10-17 uur en op 1 maart van 9-16 uur.Volgde je al onze beginnerscursus voor Ableton Live? Of heb je zelf al je eerste stappen in het programma gezet? Dan is deze Advanced cursus iets voor jou!Ableton Live is meer dan een muziekproductie- en performance-tool. Deze krachtige DAW bevat alle tools die je nodig hebt om een professionele en hoogwaardige mix te maken!&amp;nbsp;Mixing en Mastering is een combinatie van &#039;technische vaardigheid&#039; en &#039;artistieke finesse&#039; - en je moet beide ontwikkelen om top resultaten te bereiken. In deze workshop wordt de kunst en de wetenschap van het mixen en masteren in Ableton Live verkend. Aan de hand van een bestaande track leer je alles over ‘4D Mixing’, mixing workflow en tips &amp;amp; tricks om het mix proces te versnellen. Alle mixing tools en -technieken komen aan bod: compressie, EQ, panning, reverb, Drum Buss device, en nog veel meer… Aan het einde van deze workshop heb je een beter begrip van hoe je geweldig klinkende 4-dimensionale mixen kunt maken.&amp;nbsp;Programma&amp;nbsp;Preparing to Mix - een blik op de tools die je nodig hebt om een goede mix te maken&amp;nbsp;Translation - hoe maak je mixen die goed klinken op elk systeem?&amp;nbsp;De 4 dimensies van een mix - het begrijpen van de verschillende dimensies van een mix en de tools die gebruikt worden om ermee te werken.&amp;nbsp;Mixing in Ableton Live - Ableton Live’s specifieke concepten en workflows voor het opbouwen van een perfecte mix&amp;nbsp;PluginsSpecifieke Tips &amp;amp; Tricks voor het mixen van beats, bass, synths, vocals, ...&amp;nbsp;Exporteer je mix - Nu het goed klinkt, wat moet ik doen?&amp;nbsp;Mastering - Wat is het, en wat is het niet? Heb ik het nodig, en hoe doe ik het?&amp;nbsp;Prijs: €152 / Leerlingen Conservatorium Kortrijk &amp;amp; jambox gebruikers: €102 (mail naar muziekcentrum@kortrijk.be) &amp;nbsp;/ Uitpas € 32"
  },
  {
    "Title": "TRIPLE BILL: BERTRAND CUILLER &amp; FRANCESCO TRISTANO + GOMEZ",
    "DateString": "2026-02-28T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/triple-bill-bertrand-cuiller-francesco-tristano-gomez",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f6de/4a/74ff59f8ee3df5eda6433fc25a8c1137261bfe84.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "De Luxemburgse pianovirtuoos Francesco Tristano en de Franse meesterklavecinist Bertrand Cuiller brengen voor de eerste keer samen een programma over de muzikale eeuwen heen.&amp;nbsp;Het lijkt misschien een bijzondere combinatie, het toetsengeweld van een moderne vleugel tegenover de frêle en breekbare klank van het klavecimbel, maar de twee virtuozen vullen elkaar heel goed aan en stelden een programma samen waarin die tegenstelling net versterkend werkt. Ze worden ook technisch ondersteund: de instrumenten worden op een respectvolle manier uitversterkt en in balans gebracht.&amp;nbsp;Op het programma: een spelletje muzikaal ping-pong met werken van Bach, Byrd, Gibbons, Froberger en Tristano zelf.&amp;nbsp;Deze werken vormen de basis van een muzikale uitwisseling tussen twee muzikanten met totaal verschillende achtergronden: ze dagen elkaar uit, zoeken elkaars grenzen op en laten de sonoriteit van beide instrumenten samensmelten tot een dialoog tussen traditie en hedendaags experiment.&amp;nbsp;Een vingervlugge tête-à-tête waarin virtuositeit en verrassing ten volle uitgespeeld worden!&amp;nbsp;&amp;nbsp;Aftershow GOMEZGomez is een fictief personage dat leeft tussen droom en het hiernamaals. Hij reist door een klankwereld vol harpen, banjo’s, casio’s, lapsteelgitaren en mystieke beats. De muziek van Gomez is een mengeling van zachte, vloeiende of pulserende klanken in een volledig ondefinieerbaar hybride genre.&amp;nbsp;De set voor diatonische harp, lapsteelgitaar en elektronica werd oorspronkelijk gecomponeerd als onderdeel van de geluidskunstinstallatie “one of us” van kunstenares Inger Elisabeth Gleditsch, opgebouwd uit afval uit zeeën en rivieren.&amp;nbsp;Met de steun van het Huis van het Groothertogdom Luxembourg in Brussel"
  },
  {
    "Title": "MATINEE: REGINALD MOBLEY",
    "DateString": "2026-03-01T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-reginald-mobley",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/85f7/65/5754636c9dc542bb6a2249b83886459090cf400c.jpg",
    "Location": "Concertstudio",
    "Description": "De glinsterende stem van een contratenorNet zoals Bach, Mozart en Beethoven de ruggengraat vormden van het West-Europese muzikale canon, ontstond aan de overkant van de Atlantische Oceaan in de Amerikaanse koloniën een ander fundament: slavenliederen en negrospirituals. Deze muziek, geboren uit pijn en hoop, groeide uit tot de bron van ragtime, barbershop, jazz, gospel, blues, rock en zelfs techno en elektronische muziek. De universaliteit en kracht van deze traditie heeft zich wereldwijd verspreid en onze muzikale geschiedenis voorgoed veranderd.De Amerikaanse contratenor Reginald Mobley, genomineerd voor een Grammy en geroemd om zijn ‘glinsterende stem’, verkent dit erfgoed in een nieuw samengesteld programma samen met de Franse pianist Baptiste Trotignon. Ze brengen liederen van zwarte componisten als H.T. Burleigh, Florence Price en J. Rosamond Johnson, op teksten van grootheden zoals Langston Hughes en Paul Laurence Dunbar. Dit repertoire verscheen ook op het album Spirituals, uitgebracht door ALPHA Classics, Gramophone Label of the Year 2020."
  },
  {
    "Title": "SYMFONIEORKEST VLAANDEREN &amp; KORTRIJKS SYMFONISCH ORKEST: Schubert X Mozart",
    "DateString": "2026-03-01T16:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/symfonieorkest-vlaanderen-kortrijks-symfonisch-orkest-schubert-x-mozart",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4655/b0/ca101e9b4723287461f2d837835e208644e9f37e.jpg",
    "Location": "Sint-Elisabethkerk",
    "Description": "Twee orkesten in perfecte harmonieHet Kortrijks Symfonisch orkest bijt de spits van dit concert af met muziek van Gabriel Fauré: de Pelléas et Mélisande Suite. Deze suite, gecomponeerd in 1898 als toneelmuziek bij het symbolistische stuk van Maurice Maeterlinck, ademt een sfeer van verfijnde melancholie.&amp;nbsp;Uit de suite worden drie delen gebracht: eerst de ingetogen Prélude (Quasi adagio), gevolgd door de sierlijke Sicilienne (Allegretto molto moderato), en tot slot het indringende La Mort de Mélisande (Molto adagio).&#039;&amp;nbsp;Een selectie die de essentie van Faurés poëtische en ingetogen stijl belichaamt. Het voorprogramma duurt ongeveer 15 minuten en zet meteen de toon voor een concert dat balanceert tussen lyrische schoonheid en de reflectie op vergankelijkheid.&amp;nbsp;Mozart&#039;s Klarinetconcerto is het laatste werk dat hij voltooide in 1791, het jaar waarin hij stierf op amper vijfendertigjarige leeftijd. En wat ons betreft zijn mooiste.&amp;nbsp;"
  },
  {
    "Title": "Trail up North: RAGAZZE QUARTET + ICTUS STRING TRIO",
    "DateString": "2026-03-06T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/trail-up-north-ragazze-quartet-ictus-string-trio",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/75fc/0d/63a7807dec3ddeb1530bbee694629c0eed17f3ba.jpg",
    "Location": "Concertstudio",
    "Description": "Ictus – Laure M. Hiendl&amp;nbsp;Loops, samples, patronen: overgeërfd uit de pop- en elektrocultuur behoren nieuwe tools nu tot de gereedschapskist van componisten uit de klassieke traditie.&amp;nbsp;Chronochromatic Variations III is een laatromantische evocatie. Laure M. Hiendl gebruikt melodieën uit een strijktrio van de Anglo-Ierse componist E.J. Moeran (1894–1950), die zijn opgeknipt, geloopt, bewerkt en opnieuw samengevoegd. Het resultaat is, in Hiendls eigen woorden, ‘een geanimeerd stilleven’: een stilgezette klank die verwijst naar een nostalgie naar het Engelse pastorale, maar ons onderhuids toch verontrust in zijn uitvoering.Aisha Orazbayeva, viool - Victor Guaita, altviool - Geert De Bièvre,&amp;nbsp;cello"
  },
  {
    "Title": "NIGHT AIR @ Transfo Zwevegem met o.a. Natasha Pirard, Suzan Peeters &amp; Marilou Dejans,...",
    "DateString": "2026-03-07T15:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/night-air-transfo-zwevegem-met-o-a-natasha-pirard-suzan-peeters-marilou-dejans",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7e6e/f9/8e1251929df354d0c6d60ba5f937572938fa84d7.jpg",
    "Location": "Transfo Zwevegem",
    "Description": "Night Air kleurt niet alleen graag buiten de lijntjes, het probeert die lijn gewoon te verleggen. Het experimentele minifestival binnen Festival Kortrijk brengt nationale en internationale artiesten uit verschillende genres samen op de Transfo Zwevegem. De verschillende tot de verbeelding sprekende locaties van de voormalige elektriciteitscentrale worden omgetoverd tot concertzalen, op maat gemaakt van de performances die we er presenteren.&amp;nbsp;Als bezoeker kies je zelf wat je ziet: een ticket geeft toegang tot het volledige programma."
  },
  {
    "Title": "MATINEE: I SOLISTI - &#039;Nothing Happens, Twice&#039;",
    "DateString": "2026-03-08T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-i-solisti-nothing-happens-twice",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/608c/09/36e1448442b595cf1245fa5314bd49c7c1fa28a7.jpg",
    "Location": "Concertstudio",
    "Description": "Zoeken naar wat zich in leegte verstopt&amp;nbsp;Emile Souvagie – I SOLISTI Next Generation&amp;nbsp;In 1953 opende John Cage de piano, maar besloot geen toets aan te raken. Datzelfde jaar liet Samuel Beckett vier acteurs de scène betreden om hen te laten wachten op iets dat wellicht nog altijd moet komen. Beiden braken met de erfenis van hun respectieve kunstvormen en maakten voor het eerst van de leegte een protagonist.In ‘Nothing happens, twice’ vragen twee acteurs en drie muzikanten zich af waarom beide kunstvormen tegelijkertijd tot stilstand leken te komen en wat dat vertelt over onze wereld. Als jonge kunstenaars in een tijdsgewricht met nieuwe krampen kijken ze naar de stilte tussen de woorden, de ruimte tussen de noten, de leegte en wat zich daar verstopt.Deze voorstelling zit in het CUBO-aanbod van Schouwburg Kortrijk. Word CUBO-lid en krijg onbeperkt toegang tot podium- en filmaanbod in Kortrijk voor slechts €20 per maand. CUBO tickets worden gecontroleerd aan de ingang. Deze voorstelling maakt deel uit van Festival Kortrijk 2026.&amp;nbsp;"
  },
  {
    "Title": "FIREPLACE",
    "DateString": "2026-03-08T14:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/fireplace-3",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/d9a5/0f/288575d8c1d087ccc4227f292de12ff05f1e8b28.jpg",
    "Location": "H. Hart Kortrijk",
    "Description": "Op de slotdag van het tweede weekend van Festival Kortrijk nemen jonge muzikale avonturiers het over tijdens het sfeervolle minifestival Fireplace. Op zondagmiddag worden bezoekers getrakteerd op korte, maar krachtige liveoptredens van opkomend talent. De conservatoria van Brussel, Gent, Mons en Lille kiezen elk twee van hun beste masterstudenten of ensembles, die hun meest sprankelende repertoire delen. Verwacht een kleurrijke mix van stijlen: van jazz tot pop, van barok tot hedendaagse klanken – een fascinerende staalkaart van de nieuwe generatie muzikanten.&amp;nbsp;Fireplace staat voor concerten van twintig minuten, verspreid over verrassende, unieke locaties. Jij bepaalt je eigen route en laat je meevoeren op een ontdekkingsreis, waarin elk muzikaal pad je iets anders laat ervaren. Perfect voor jong en oud!&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "EX NIHILO",
    "DateString": "2026-03-08T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ex-nihilo",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f07e/2d/7d430565940e55891cf69337f69176a482b95f60.jpg",
    "Location": "Abby Kortrijk",
    "Description": "Het recital van Brecht Valckenaers vormt een doorlopend muzikaal geheel met drie lagen. Centraal staat Musica Ricercata van György Ligeti, een reeks van elf korte composities waarin de jonge Ligeti experimenteerde met de meest eenvoudige muzikale bouwstenen. Elk deel voegt een nieuwe noot toe, waardoor stap voor stap een rijker klankuniversum ontstaat – van pure eenvoud naar steeds complexere structuren.&amp;nbsp;Tussen deze delen weeft Valckenaers twee aanvullende lijnen: korte werken van 20e-eeuwse componisten die verwant zijn aan Ligeti’s zoektocht, en vijf gloednieuwe intermezzi die hij speciaal voor dit recital componeerde. Het resultaat is een gelaagd programma dat het verleden, het heden en de toekomst met elkaar verbindt. Zo ontstaat een spannende dialoog tussen Bartóks invloed, Ligeti’s vernieuwingsdrang en Valckenaers’ eigen creatieve stem.&amp;nbsp;"
  },
  {
    "Title": "SIEM REAP",
    "DateString": "2026-03-12T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/siem-reap",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/411a/af/f0c392f8e6decc5173361737a45b31ec4ddfac25.jpg",
    "Location": "De Kreun Café",
    "Description": "Wishin&#039; I Was Fishin&#039;Siem Reap is het soloproject van Gilles Demolder (bekend van Oathbreaker en Wiegedood). Samen met Wim Coppers (Wiegedood, Crouch) en Jasper Hollevoet (Ventilateur) verkent hij thema’s als mannelijkheid, familie en relaties. Dat gebeurt in een trage, intense en warme sound die doet denken aan bands als Spain, The Microphones, Codeine en Slint.Na het uiteenvallen van Oathbreaker en een stukgelopen relatie begon Demolder nummers te schrijven die nergens anders pasten. Met enkel een laptop en goedkope microfoons ontstond Siem Reap en het zelf opgenomen debuut Now What? (2023). Lo-fi, pijnlijk direct en biechtend in toon, klonk het als een mengeling van dagboekfragmenten en dronken voicemails — een meedogenloos eerlijke blik op de ruïnes van zijn twintiger jaren.In 2025 verschijnt opvolger Wishin’ I Was Fishin’, dit keer uitgebracht op zijn eigen label Heimlich Manoeuvres. De intimiteit blijft, maar het geluid opent zich: rijker, dynamischer en voller dankzij de bijdragen van Coppers (drums) en Hollevoet (bas). De nummers blijven geworteld in confessional songwriting en vervormde folk, met Demolders droge gevoel voor humor als rode draad.De songs van Siem Reap zijn geen klaagzangen, maar wrang-komische verhalen die schipperen tussen humor en verdriet. Demolder zet zichzelf neer als antiheld — met veel zelfspot en eerlijkheid — en schrijft over trauma, relaties en alledaagse absurditeit.Het klinkt minder zwaar dan zijn metalverleden, maar de intensiteit blijft, dit keer verpakt in vreemde beelden, nachtelijke monologen en een wrange glimlach die de spiegel voorhoudt.&amp;nbsp;Support: Ignatz&amp;nbsp;Ignatz is het alter ego van de Belgische muzikant Bram Devens. De naam komt uit de Krazy Kat-strips van George Herriman (1910), waarin Ignatz de muis graag bakstenen naar Krazy Kat gooit – iets wat Krazy Kat als liefde ziet. Ignazt komt zijn nieuwe plaat voorstellen die uitkomt in januari ‘I don’t know’&amp;nbsp;Devens neemt die naam aan voor zijn eigen stapel “bakstenen”: sobere, emotionele songs vol effecten, tapeslijtage, improvisatie en spontaniteit. Zijn muziek vertrekt uit een minimale folkbasis, doet denken aan V.U. of Henry Flynt, maar klinkt omgekeerd en losgezongen, met ruwe versieringen, verstrengelde loops en een stem die wegzakt in een gebarsten drawl.Naast zijn solowerk speelde hij met de band De Stervende Honden, die begin 2023 stopte met optreden."
  },
  {
    "Title": "MARIA ISKARIOT",
    "DateString": "2026-03-13T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/maria-iskariot",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/3d64/99/624cf3ee66385fb7fa8140392a1a1f5a9730fb84.jpg",
    "Location": "De Kreun",
    "Description": "Maria Iskariot is de patroonheilige van betwistbaar gedrag. Het is punkrock uit Gent. Lawaaierig strofe, refrein, strofe. Liefde voor de onbeminden, vijgen na Pasen, maar in de eerste plaats een knieval voor de zondaars. Zoals het een band op platenlabel Burning Fik (Hang Youth, Gotu Jim) betaamt poogt Maria Iskariot een greintje hoop te vinden in schier allesomvattende hopeloosheid. Gelijke delen paniekaanval, pseudofilosofisch pamflet en vlam-in-de-pan nodigt de punkband uit Vlaanderen eenieder die zich eveneens op de limieten begeeft uit met hen te komen rellen – in een gecontroleerde setting welteverstaan. En niets slopen hoor, want er is al zoveel kapot.Hun EP EN/EN kwam uit op het Nederlandse label Burning Fik en ze zijn bekroond als winnaars van Humo’s Rock Rally 2024. Dat jaar speelde ze meer dan 100 concerten in binnen- en buitenland. &amp;nbsp;Maria Iskariot is niet alleen een punkband, maar ook een artistiek en maatschappelijk statement. Ze laten zien dat Nederlandstalige punk niet alleen nostalgisch hoeft te zijn, maar ook urgent en vernieuwend kan klinken.Op 31 oktober 2025 releasen ze hun debuutplaat Wereldwaan, die nu al door critici wordt beschouwd als een tijdloze cultplaat die de wanen van de dag tegen het licht van de eeuwigheid houdt.&amp;nbsp;support: StakattakStakattak is het Belgische familie trash pop trio en de zelfverklaarde voorloper van Raout Rock. Verwacht nummers uitgekookt tot de essentie en een explosieve liveshow met een minimale set-up. Drums, gitaar en zang verwringen de realiteit tot een onweerstaanbare trip."
  },
  {
    "Title": "SYNTHLAB",
    "DateString": "2026-03-14T14:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/synthlab",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/c352/5b/38691d0c625c972c6d39be68f245e791ca70101d.jpg",
    "Location": "De Kreun",
    "Description": "Synthlab met Janus Coorevits - zaterdag 14/03Tijdens deze workshop neemt Janus Coorevits je mee in de wereld van synthesizers. Leer hoe de intussen iconische Compact Disk Dummies-sounds ontstaan en hoe je zelf unieke klanken kunt creëren. Janus deelt zijn kennis over de basisprincipes van synths en demonstreert verschillende kleuren en texturen op zijn eigen collectie synths.&amp;nbsp;"
  },
  {
    "Title": "CHANTAL ACDA &amp; THE NORTH SEA DRIFTERS",
    "DateString": "2026-03-14T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/chantal-acda-the-north-sea-drifters",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/ff20/90/b9e06930f6c9ed91bc3be9390a00d546bb9caadc.jpg",
    "Location": "Kerk Sint-Denijs",
    "Description": "Op 3 mei 2024 verscheen Chantal Acda’s nieuwste album, Silently Held.Deze release sluit aan bij haar eerdere muzikale avonturen, waaronder Let Your Hands Be My Guide (2013), The Sparkle In Our Flaws (2015), Bounce Back (2017), Puwawau (2019) en Saturday Moon (2021). Elk van deze albums vond wereldwijd weerklank.In de stille omhelzing van de muziek onthult Chantal een rauwe en eerlijke reflectie op kwetsbaarheid, waar fouten en gevoelens een plek mogen krijgen. Silently Held biedt een toevluchtsoord en nodigt luisteraars uit deel te worden van een stille gemeenschap, waar de subtiliteiten van het mens-zijn centraal staan. Met elke noot en elk woord creëert Acda een ruimte waarin imperfecties niet alleen worden erkend, maar ook gevierd. Zo ontstaat een diepe, intieme verbinding tussen artiest en publiek.Het album klinkt als een getuigenis van de schoonheid die schuilt in onze gebreken en gevoelens, en nodigt ons uit om deze met gratie en oprechtheid te omarmen.Het project wordt live gebracht door Frederik Madou op contrabas, Eric Thielemans op drums, Hendrik Lasure op piano en Chantal Acda op gitaar en zang."
  },
  {
    "Title": "Matinee: Liederzeit - Die schöne Müllerin",
    "DateString": "2026-03-15T11:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/matinee-liederzeit-die-schone-mullerin",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0b14/93/9f4b866c3c76df4a7fe5437fc3acee88a50292c3.jpg",
    "Location": "Concertstudio",
    "Description": "Franz Schubert –&amp;nbsp;Die schöne Müllerin D795&amp;nbsp;Die schöne Müllerin&amp;nbsp;behoort tot de absolute meesterwerken van&amp;nbsp;Franz Schubert&amp;nbsp;en van de romantische liedkunst. Deze ontroerende cyclus voltooide de 26-jarige Franz Schubert in november 1823 – die toen leed aan een slechte gezondheid en periodes van twijfel aan zichzelf. Deze liedcycli vertelt het&amp;nbsp;lot&amp;nbsp;van een jonge molenaarsgezel die hopeloos verliefd wordt op de mooie dochter van de molenaar.Schuberts muziek vangt op sublieme wijze het verlangen, de jaloezie, het verdriet en de berusting van de jonge man. Het resultaat is een&amp;nbsp;meeslepende innerlijke reis&amp;nbsp;– intiem, pijnlijk mooi en universeel herkenbaar."
  },
  {
    "Title": "YONG YELLO",
    "DateString": "2026-03-18T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/yong-yello",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/49e4/9c/930ba5b72ff38c851f690cbffebbee35412df701.jpg",
    "Location": "De Kreun",
    "Description": "Yong Yello is de alias van rapper en producer Yello Staelens. In een vorig leven was hij lid van het legendarische hiphopcollectief Eigen Makelij, waar hij samenwerkte met onder anderen Tourist LeMC. Later groeide hij uit tot de vaste producer van Glints.&amp;nbsp;Vandaag is Yong Yello niet minder dan de kroonprins van het Antwerpse lied. Zijn muziek? Een broeierige cocktail van 90s-hiphop, soul, funk en filmsoundtracks uit de jaren ’60 en ’70. Voeg daar de pen van een chansonnier en het oor voor een poprefrein aan toe, en je hebt Yello: groovy én gevoelig.In 2020 haalde hij met zijn single ‘Als Ge Slaapt’ de finale van De Nieuwe Lichting, en dat bleek slechts het voorspel. Met zijn debuutplaat ‘Marcel &amp;amp; Het Magnetisme Van De Goot’ (2021) dropte hij bommen als Cirkels, Waanzin en Luchtkasteel. Het publiek ging massaal overstag: uitverkochte zalen, festivalweides die “Yelloooooo” scandeerden, en een welverdiende MIA-nominatie in de categorie Hip-Hop/R&amp;amp;B.Fast forward naar 2025: vier jaar later bevestigt Yong Yello zijn status met de nieuwe single ‘Ik moet dringend op vakantie’ – een titel die klinkt als een WhatsApp-status, maar ook best letterlijk te nemen is. De track is de voorbode van zijn langverwachte tweede album, dat dit najaar verschijnt. En hij komt het op 18 maart live bij ons voorstellen!De song snijdt een hyperactueel thema aan: een workaholic op het randje van een burn-out, slapeloos, gestrest, maar toch stug blijven doordoen – herkenbaar voor pakweg een kwart van de Belgen. Terwijl 20% ondertussen slaappillen knabbelt, stelt Yong Yello de vraag: werken we om te leven, of leven we om te werken?Zoals altijd verpakt Yong Yello zware maatschappelijke thema’s met ironie in aanstekelijke melodieën, terwijl zijn typische, cinescope hip hop sound wordt verrijkt met vintage samba.&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "TUTU PUOANE",
    "DateString": "2026-03-19T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/tutu-puoane",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0449/85/3e8e41080452bd94d1c45cb4f996c85df98db5ca.jpg",
    "Location": "Concertstudio",
    "Description": "Tickets on sale 02/06, vanaf 17 uur.Jazz Cats ClubshowPoëzie op jazztonenZangeres Tutu Puoane (geboren in Zuid-Afrika maar sinds 2005 woonachtig in Antwerpen) liep bijna tien jaar rond met de dichtbundel ‘In A Ribbon Of Rhythm’ van haar land- en leeftijdsgenoot Lebo Mashile, wiens poëzie een uniek en zeer persoonlijk inzicht biedt in de realiteit en emotionele wereld van een jonge zwarte Afrikaanse vrouw van de eerste post-Apartheidsgeneratie. Telkens wanneer Tutu de gedichten las, hoorde ze muziek.&amp;nbsp;Uiteindelijk schreef ze een aantal songs op basis van de bundel, met als resultaat een repertoire op haar eigen Afrikaanse kruispunt van jazz, singer-songwriting en soul.&amp;nbsp;&amp;nbsp;De muziek vormt de basis voor een dubbel-albumproject getiteld &#039;Wrapped In Rhythm&#039;, waarvan het eerste deel in 2024 werd uitgebracht in een productie van de Amerikaanse muzikant/bassist/producer Larry Klein (Joni Mitchell, Tracy Chapman, Herbie Hancock ...) en dat warm werd ontvangen, onder andere met 3 South African Jazz Awards in Tutu’s thuisland.Volume twee is een samenwerking met het wereldberoemde en Grammy-winnende Nederlandse Metropole Orkest (Vince Mendoza, Jacob Collier, Lizz Wright ...), dat op unieke wijze het geluid van klassiek ensemble combineert met bigband, voorzien van arrangementen van de Belgische trompettist en arrangeur Bert Joris. De release is gepland na zomer 2025.&amp;nbsp;Wanneer Tutu Puoane optreedt, stellen de open en losse structuren van het repertoire haar en haar band in staat de nummers vrij, geïmproviseerd en communicatief aan te pakken. Met haar prachtige stem, nuchtere charisma en natuurlijke communicatievermogen, verovert ze moeiteloos het hart van elk publiek. &amp;nbsp;Deze voorstelling zit in het CUBO-aanbod van Schouwburg Kortrijk. Word CUBO-lid en krijg onbeperkt toegang tot podium- en filmaanbod in Kortrijk voor slechts €20 per maand. CUBO tickets worden gecontroleerd aan de ingang."
  },
  {
    "Title": "ZLDR",
    "DateString": "2026-03-20T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/zldr-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/58de/19/0ac4f400c403c01388ad0f3383fbaa315ec98143.jpg",
    "Location": "De Kreun",
    "Description": "Album release show van debuutalbum &#039;Broederlijk Helen&#039;.Half Belgisch, half Frans én een muzikale uppercut. Opkomend&amp;nbsp;talent ZLDR brengt onvergetelijke liveshows. Maak kennis met de gebroeders Thomas &amp;amp; Julien Jacquemain en hun producer Lennert Declercq. Met krullend kapsel, een uniek, persoonlijk verhaal en sterke invloed uit de Brusselse en Franse hip-hop scene, denk Le 77, ISHA &amp;amp; Stikstof, breken ze grenzen. Hun shows? Rauw, vurig en altijd in directe verbinding met het publiek, hun grootste bron van energie. Met Franco-Belgische tracks die binnen knallen, sleuren ze elke toeschouwer mee. Op het podium, klimmend op een stelling of midden in de crowd: ZLDR gaat altijd tot het uiterste. Als winnaars van Sound Track en Lotto Wild Talent en optredens naast o.a. Brihang, Ploegendienst,&amp;nbsp;‘t Hof van Commerce, Doodseskader, Bob Vylan en Low G, groeit ZLDR razendsnel uit tot een unieke hiphop-act die je niet meer kunt negeren."
  },
  {
    "Title": "MUZIEKBARBAR",
    "DateString": "2026-03-23T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/muziekbarbar-11",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/b562/c4/344b57a8684da5c79fa6f52fb1c21243591ec818.jpg",
    "Location": "Wilde Westen, Kortrijk",
    "Description": "tracks, demofeedback &amp;amp; drinks&amp;nbsp;1 keer per maand worden Track en De Kreun op maandagavond dé ontmoetingsplek voor al wie actief muziek maakt, creëert of versterkt. Muzikanten, producers, DJ’s, geluidswizards,… Jong of oud, amateur of pro: iedereen is welkom.Laat je nieuwste track of demo knallen door het professionele soundsystem van De Kreun of in de opnamestudio in Track. Wissel tips en tricks uit. Geef en krijg feedback. Ontmoet muziekmakers aan de bar, met een drankje erbij. De Muziekbarbar gaat afwisselend door in De Kreun en in de opnamestudio van Muziekcentrum Track.Dit seizoen nodigen we regelmatig een externe muzikant of producer uit om gericht feedback te geven. We kondigen die telkens vooraf aan via onze socials.We openen telkens vanaf 19u, het einde is voorzien rond 22u. Je hoeft niet in te schrijven, kom gewoon af! Wil je zeker op de hoogte blijven van de Muziekbarbars?&amp;nbsp;Word dan zeker lid van onze Whatsappgroep.Onze workshops zijn een samenwerking tussen Muziekcentrum Track &amp;amp; Wilde Westen.Data en locatie:29/09/25 - Track20/10/25 - De Kreun17/11/25 - Concerstudio TrackDeze editie is Johannes Leroy [FR] te gast. Leroy is een multi-instrumentalist, die via Loopstation en andere hardware live solo-performances geeft. Op deze muziekbarbar toont hij verschillende formules om muziek te maken met piano, bas, percussie-samples, live percussie, tablet en live spel met een MPC. Na de guest-talk is er nog even tijd om zoals steeds eigen muziek te beluisteren.15/12/25 - Opnamestudio23/02/26 - Track23/03/26 - De Kreun20/04/26 - Track18/05/26 - De Kreun&amp;nbsp;"
  },
  {
    "Title": "GRÉGOIRE GERSTMANS - Piano Day",
    "DateString": "2026-03-26T19:30:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/gregoire-gerstmans-piano-day",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7bb3/f1/13866277f38038cec9bdbc7383f37e94b0eb6fa3.jpg",
    "Location": "Uitzicht",
    "Description": "Al generaties lang wordt de liefde voor muziek doorgegeven in de familie Gerstmans. Grootvader Julien was violist en oprichter van de Muziekacademie van Hannuit. Hij liet Grégoire als 7–jarige op zijn piano spelen. Eric, Grégoires vader, speelde altviool, wat hem van het Filharmonisch Orkest van Luik naar Alain Bashung, William Sheller en Robert Wyatt bracht.&amp;nbsp;In zijn eigen muziek gaat Grégoire op zoek naar de puurheid en schoonheid van de vroege pianomuziek, maar evenzeer naar de naïviteit van zijn vroege jeugd. In een snelle maatschappij vertraagt Grégoire Gerstmans bewust de tijd. Alleen met zijn piano, ergens tussen moderniteit en respect voor traditie, haalt hij de droom in ons allemaal naar boven door de minimalistische puurheid van zijn melodie.&amp;nbsp;Zijn belangrijkste artistieke referenties zijn Arvo Pärt, Aphex Twin en Philip Glass, maar ook Bill Viola en Yves Klein.Voor Piano Day brengt hij een volledig akoestische set en presenteert hij zijn debuutalbum Hypnagogie dat verscheen op PIAS.&amp;nbsp;"
  },
  {
    "Title": "ERTEBREKERS",
    "DateString": "2026-03-26T20:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ertebrekers-1",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7cc7/eb/8905c5da351cb8515fd2f778e00080728bb941b6.jpg",
    "Location": "De Kreun",
    "Description": "‘Waar hangen die dekselse Ertebrekers toch uit?’ Je hoorde het – als je goed luisterde – fluisteren onder fans. Met het onderliggende ietwat angstige sentiment: ze zijn toch niet gesplit? In een vlaag van verstandsverbijstering en een krachtige ‘Schluss damit!’? Wel, in het geheel niet. Ze leven nog. Kwamen uit hun hibernatie als vurige vlinders, met een nieuw album … ‘Cocon’. Al is er in die Ertebrekers-cocon toch het een en het ander veranderd.&amp;nbsp;Bijna tien jaar geleden lieten ze ‘Otel’ op de mensheid los – met de bekende single ‘De Zji’ nestelden ze zich in een niche waar ze meteen king waren – om drie jaar later – met ‘Crème’ – dat verhaal lekker verder te zetten. Ja, corona wierp wat roet in het eten, al wisten Ertebrekers hun plaat wel te verzilveren met de singles ‘Paranoïa’ en ‘Shimokitazawa’ …&amp;nbsp;&amp;nbsp;En nu zijn ze er weer. Met dat verschil: Flip Kowlier maakt geen deel meer uit van de band. Of dat de harten van Peter Lesage en Jeffrey Bearelle brak? Neen. Of zoals Lesage het zelf verwoordt: “Jammer, zeker. Maar het is geen sinecure om drie succesvolle bands én een solocarrière te combineren: ’t Hof Van Commerce, Flips nieuwe soloplaat én een nieuw album van Ertebrekers … Flip speelt wel nog mee op twee songs, ‘Kon ik maar een beetje beter dansen’ en ‘El Narcistico’. De andere songs komen uit de koker van Jeffrey en mezelf.”&amp;nbsp;Waar de vorige Ertebrekers-platen nog een groter singer-songwriteraandeel hadden, konden Bearelle en Lesage het soul-laken nu volledig naar zich toetrekken: het resultaat is een compromisloze plaat – meer soul &amp;amp; disco, funk en hip-hop-georiënteerd, zeker wat de tempo’s en beats betreft – waarop de stem van Bearelle mooi blendt met de melodieuze arrangementen van Lesage. Twee soulbrothers in één ruimte, dat geeft coole resultaten. ‘Cocon’ is rijk gearrangeerd, met een knipoog naar oude en nieuwe soul-legends. Een plaat die mikt op de benen én op het hart, want ook qua thematiek laten Lesage en Bearelle in hun hart kijken.&amp;nbsp; &amp;nbsp;&amp;nbsp;support: HONEYHONEY is een instrumentaal trio, dat ontstond uit jarenlange vriendschap en connectie als ritmesectie. eclectische grooves, lyriek en lekker eten vormen de voedingsbodem voor hun eigen muzikale taal — met echo’s van Al Green, D’Angelo en Ahmad Jamal. HONEY is Lukas Somers op gitaar, Gerben Brys op bas en Olivier Penu op drums.&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "RAMONES ALIVE – 50 jaar Ramones",
    "DateString": "2026-03-27T19:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/ramones-alive-50-jaar-ramones",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/acc9/9b/8d19f872eb1791adb33665672416b1dacfa5aefc.jpg",
    "Location": "De Kreun",
    "Description": "RAMONES ALIVE – 50 jaar Ramones (1976)&amp;amp; 25 YEARS THAT’S ALL PUNKS! (genoeg redenen om te vieren dus!)De legendarische debuutplaat Ramones viert haar 50ste verjaardag, en dat vraagt om een ode met punkattitude! Ramones Alive brengt het iconische album integraal op het podium, met de energie en rauwe bravoure die het verdient.Het collectief bestaat uit topmuzikanten uit de Benelux-rockscene: Marco Roelofs (Heideroosjes) op zang, Bart Nederhand (Peter Pan Speedrock) op drums, Oeds Beydals (The Devil’s Blood / Iron Jinn) op gitaar en Harold Gielen (Legion of the Damned) op bas. Samen bundelen ze hun uiteenlopende karakters in een vurige liefdesverklaring aan pure rock ’n roll.In 2024 toerden ze al langs Belgische en Nederlandse zalen met een greep uit vijftig jaar Ramones-classics. Dit keer keren ze terug met een frisse insteek, maar dezelfde compromisloze energie. Verwacht een strakke, explosieve show die recht naar de kern van punkrock gaat.One, two, three, four! Gabba Gabba Hey!&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "JAZZ CATS 2026",
    "DateString": "2026-03-28T17:00:00+0100",
    "Url": "https://www.wildewesten.be/nl/event/jazz-cats-2026",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/623f/f7/200b7c47cf732831695cc45000fa4fcb711723af.png",
    "Location": "Muziekcentrum Track &amp; De Kreun",
    "Description": "Op 28 maart transformeren we voor de zevende maal De Kreun en Muziekcentrum Track om tot een broeinest van jazz.&amp;nbsp;Zoals elk jaar gooien we de conventionele jazzregels overboord en varen we zo ver buiten de lijntjes dat je achteraf zou kunnen denken: “Jazz? Waar?”. Eén ding is zeker: je oren krijgen een all-you-can-eat buffet van experimenten voorgeschoteld, en je gaat gegarandeerd muzikaal voldaan naar huis.&amp;nbsp;"
  },
  {
    "Title": "LICHTTECHNIEK VOOR BEGINNERS",
    "DateString": "2026-04-01T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/lichttechniek-voor-beginners",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/aee3/2a/06f156e30a962fa568d067b0b935bec27b8d7dc5.jpg",
    "Location": "De Kreun",
    "Description": "Leer alle basics van de lichttechniek en ga aan de slag met een lichttafel, een lichtplan en veel meer! Altijd al eens achter een lichttafel willen staan en een concertzaal tot leven willen wekken door het bedienen de spots op een podium? Tijdens deze cursus leer je alle basics van de lichttechniek. Hoe werkt een lichttafel, wat voor lichtbronnen zijn er, wat zijn de belangrijkste do’s en dont’s als het op kleuren aankomt en wat houdt deze job nog meer in buiten het uitdenken van een lichtplan en het bedienen van de tafel. Er is geen voorkennis nodig.Dit is een tweedelige lessenreeks, de eerste vindt plaats op 1 april en de tweede op 8 april. Telkens van 19 - 22 uur."
  },
  {
    "Title": "PSYCHONAUT",
    "DateString": "2026-04-02T20:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/psychonaut-2",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/6cdd/72/033865a2f0dd746b638bb5583754a137f471456c.jpg",
    "Location": "De Kreun",
    "Description": "Tickets on sale vanaf 31/10, 10u!De Belgische psychedelische post-metalband Psychonaut is al jaren een toonaangevende kracht binnen de moderne heavy music. Hun traditionele trio-opstelling maskeerde lang de compositorische kracht, verhalende diepgang en intense livepresence waarmee ze het genre blijven vernieuwen.Na hun indrukwekkende doorbraak met Unfold the God Man (2020) en het spiritueel geladen Violate Consensus Reality (2022), stond de band op festivals als Alcatraz, Rock Herk, Boomtown, Soulcrusher, Roadburn Redux en A Colossal Weekend, en deelde het podium met o.a. Amenra, Brutus en The Ocean.Het nieuwe album World Maker ontstond toen gitarist/zanger Stefan De Graef vader werd. Deze gebeurtenis bracht een verschuiving teweeg: van filosofische en spirituele thema’s naar persoonlijke reflecties en levenslessen voor zijn zoon — een muzikale nalatenschap van liefde. De plaat ademt een zeldzaam optimisme, met invloeden van wereldmuziek, elektronica en jazz, en gastbijdragen van Anthe Huybrechts (Anthe/Helion Creek) op o.a. Origins, waar ook Indiase tabla’s te horen zijn.&amp;nbsp;support: WIJFWijf staat voor empowerment en een goeie smack in your face. 3voor12 omschrijft noemt het iets als:&quot;Energiek gitaarwerk, heftige baslijnen en zangeres Marie die intens tekeer gaat. Stonerrock met creatieve uitstapjes richting metal en zelfs hiphoptrekjes, volledig beheerst en vol plezier.&quot;"
  },
  {
    "Title": "NENIA - REVUE BLANCHE",
    "DateString": "2026-04-03T20:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/nenia-revue-blanche",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/beac/61/e1f45c232c7065733958a8da1e4ea59fcc34b92c.jpg",
    "Location": "Concertstudio",
    "Description": "Hoe ga je om met de dood van een dierbare? Wat betekent het om voort te leven in de aanwezigheid van afwezigheid? Schuilt er hoop in herinnering, in de kunsten, in de ontmoeting met de ander? En is elk afscheid ook echt een nieuw begin? Na het meeslepende Misia&amp;nbsp;maakt het ensemble Revue Blanche een nieuwe voorstelling met audiokunstenaar Katharina Smets. Nenia – letterlijk ‘lied voor de doden’ – houdt het midden tussen concert, hoorspel en klankgedicht. Componist Frederik Neyrinck schrijft een gloednieuwe partituur op maat van dit unieke kwintet. Daarbij laat hij zich inspireren door Monteverdi’s opera L’Orfeo,&amp;nbsp;over de mythische dichter-zanger die afdaalt in de onderwereld om zijn geliefde terug te halen. Katharina Smets, de vier musici en videaste Lise Bruyneel gidsen de luisteraar door een magisch-realistische wereld tussen droom en parabel, duisternis en licht.&amp;nbsp;"
  },
  {
    "Title": "REHAB INVITES CARBON MUSIC",
    "DateString": "2026-04-03T21:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/rehab-invites-carbon-music",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/cb56/5f/f3fdc47e13c92942a79df3865e64579dca959eb4.png",
    "Location": "De Kreun",
    "Description": "JUBEIJubei is a highly respected electronic music producer and DJ, known for his precise, no-nonsense approach. Rising to prominence with Metalheadz in 2010, he made history by releasing nine tracks in a single year. His debut album To Have &amp;amp; Have Not was widely acclaimed for its cinematic yet club-ready sound. In 2021, he founded his own label, Carbon Music, launching it successfully with the track Show Me alongside dBridge. Jubei continues to push the boundaries of drum &amp;amp; bass with a forward-thinking vision and sound.&amp;nbsp;SP:MCSP:MC has been a leading drum &amp;amp; bass MC for over two decades, gaining recognition after legendary MC GQ invited him and Jubei to perform at Camden’s Emcee Sessions in 2001. He built his reputation through extensive touring with Friction and as dBridge’s preferred MC, while hosting events for top labels like Metalheadz, Shogun Audio, Hospital Records, and many more.&amp;nbsp;Known for versatility and quality, SP:MC has been consistently recognized in awards, including Best MC at the D&amp;amp;BArena Awards in 2011, and remains one of the most respected voices in the scene.&amp;nbsp;TyroneTyrone is a Newcastle‑born drum &amp;amp; bass producer and DJ known for his deep, rolling sound and razor‑sharp production. After first emerging as part of the trio Chroma, he has built a strong solo identity with releases on influential labels including Metalheadz, Ram Records, The North Quarter, Guidance, and Carbon Music.&amp;nbsp;His tracks are a favourite among top‑tier selectors, blending weighty basslines with crisp drums and a dark, atmospheric edge. As a DJ, Tyrone brings over a decade of experience, delivering powerful sets across clubs and festivals throughout the UK and Europe.&amp;nbsp;Walk:rWalk:r is a Bristol‑based drum &amp;amp; bass producer known for his emotive, atmospheric sound and clean, rolling grooves. With releases on respected labels like Soulvent, Shogun Audio, and Guidance, he has quickly become a standout voice in the scene.On stage, Walk:r delivers DJ sets that flow effortlessly between liquid, deep rollers, and more driving selections. His performances are known for their smooth progression, emotional depth, and an instinctive sense of groove that keeps dancefloors locked in from start to finish.&amp;nbsp;Sisley &amp;amp; BenOneShotSisley &amp;amp; BenOneShot are a must-see duo on the belgium Drum and Bass scene. This explosive tandem is known for their powerful and energetic sets, capable of electrifying any crowd. Their unique style spans from jungle to “dancefloor killers”, “rolling steppers” and soulful drum and bass, always seeking out the rhythms that make people move.Regularly featured at the biggest Drum and Bass events in Belgium, they’ve made their mark at Dour, Tomorrowland and Starwarz, to name just a few. With a perfect blend of musicality and raw energy, their performances strike a delicate balance between power and harmony. Each performance is a thrilling journey, with seamless transitions and a high energy atmosphere.&amp;nbsp;MC MUSHGhent-based lyrical wizard MC MUSH, is one of the most distinctive voices in the Belgian Drum &amp;amp; Bass scene.Active since the early 2000s, MC MUSH has collaborated with nearly every major player and A-list artist in the international DnB community. Star Warz, Tomorrowland, Dour, Rampage... the list of iconic events he has enhanced with his vocals, presence and crowd control is virtually endless!&amp;nbsp;ResidentsTwogun &amp;amp; .ComLikewize&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "ADMIRAL FREEBEE",
    "DateString": "2026-04-04T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/admiral-freebee-3",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1a9a/b3/377d4bba0aaef1d4fa731b97ee7075b3edec1186.jpg",
    "Location": "De Kreun",
    "Description": "Tickets on sale vanaf 7/11, 11u.&amp;nbsp;Waarom zijn er eigenlijk geen speeltuinen voor volwassenen? Tom Van Laere, aka Admiral Freebee, vraagt het zich oprecht af. Een plek waar men even aan niks hoeft te denken en onbevangen kan spelen, pure fun! Met eenzelfde gevoel sloot hij vorig jaar de jubileumtour rond zijn tijdloze debuutplaat af: dit spelplezier met deze band, dat gaan we vasthouden. Meteen weer het repetitiehok en de studio in en spelen vanuit de buik. Gitaar omgorden, voet op het pedaal en gaan. Resultaat? Tien tracks die volgend voorjaar in plaatvorm verschijnen, en nu al een vooruitgeschoven single om de smaakpapillen te prikkelen, Q&amp;amp;A With Myself. Een uptempo, groovy rocktrack van net geen 3 minuten, met dansbare gitaren en synths, en enkele welgemikte HEYs die denkbeeldige air punches begeleiden. Complexloos, zo klinkt de speeltuin van Admiral Freebee, terwijl het inhoudelijk over ghosten zou kúnnen gaan:&amp;nbsp;Questions, I have a few&amp;nbsp;Answers I have none&amp;nbsp;The only thing I know is that I know nothing&amp;nbsp;The only thing I want is for you to come back home&amp;nbsp;Q&amp;amp;A With Myself kondigt de komst aan van Admiral Freebee’s achtste studioalbum, opvolger van The Gardener uit 2021. Het album verschijnt begin 2026."
  },
  {
    "Title": "KING KONG invites MATT SASSARI",
    "DateString": "2026-04-05T22:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/king-kong-invites-matt-sassari",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/4ace/af/c1c9985c1752a1b157f377c1e674cfed3bde7bf2.jpg",
    "Location": "De Kreun",
    "Description": "MATT SASSARIMatt Sassari (born March 8, 1992, Marseille, France) is a rising star in the French techno scene. With releases on SCI+TEC, Tronic, Bitten, Deeperfect, and more, he has quickly established himself as a strong and versatile producer. His career began with Potobolo Records, where, alongside Ron Costa, he released over 15 tracks that opened doors to labels like Sincopat and Time Has Changed.Deeperfect, Stefano Noferini’s imprint, recognized his talent early on, resulting in 9 releases, remixes, and Beatport production packs. Matt continues to collaborate with top artists such as Ant Brooks, Miguel Bastida, Spencer K, and Enrico Sangiuliano, releasing on labels including Bitten, Rusted, Kinetika, Alleanza, and Rawthentic.A self-made artist, Matt co-founded his own imprint, Panterre Musique, with Matt Mor, showcasing his personal vision of techno. Inspired by legends like John Digweed, Richie Hawtin, Carl Cox, Dubfire, and Laurent Garnier, his groove transcends genres, captivating audiences far beyond the techno world. The best is yet to come for Matt Sassari.&amp;nbsp;FRED HUSHFRED HUSH is a key name in Belgium’s house and techno underground. After years of performing across Belgium, Eastern Europe and Asia, he developed a versatile sound that blends acid techno, melodic house and trancy elements. His productions have been released on respected labels such as Relief, Fokalm, Sonar Kollektiv, Materia, Viva Music UK and Rush Hour.He gained international recognition with the cult classic “Open Your Eyes”, recently remastered and added to major Spotify playlists. Fred also runs the labels Secret and Fantasia Artists with Triple Vision (NL) and Decks (DE), continuing to shape his own musical identity beyond traditional genres.On stage, he has performed at Babylon Festival, OZORA, Elrow @ Extrema Outdoor, Nature One, Aquasella, and iconic clubs like Berghain, Space, Pacha and Tomorrowland. He hosts nights at Magazine Club (FR) and King Kong Club (BE), and frequently appears at leading Belgian venues such as Lagoa and Kompass.&amp;nbsp;&amp;nbsp;+ WOODRUFF + VILALICA"
  },
  {
    "Title": "ZU + DÄLEK",
    "DateString": "2026-04-16T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/zu-dalek",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/acc9/d8/b1364fa56a22d60121778dafcecc227a52d1e050.jpg",
    "Location": "De Kreun",
    "Description": "Double bill: ZU + DÄLEK (+ after DJ TBA)ZUZu is een van de meest eigenzinnige en grensverleggende bands van Europa. Sinds hun ontstaan in 1997 transformeert het Italiaanse trio invloeden uit metal, noise, elektronica, prog en hedendaagse muziek tot een volledig eigen, razend intense sound. Pitchfork omschreef hen ooit als “honderd bands in één” – en toch onmiskenbaar Zu.Door de jaren heen werkten ze samen met een indrukwekkende lijst iconen, waaronder Mike Patton, David Tibet, Tatsuya Yoshida, leden van Fugazi, The Melvins en Einstürzende Neubauten.Op 9 januari 2026 verschijnt Ferrum Sidereum, hun nieuwe album op House of Mythology, geproduceerd door Marc Urselli. De eerste single “Golgotha” laat horen dat Zu nog altijd even compromisloos en verrassend klinkt. Zoals John Zorn het verwoordde: “A powerful and expressive music that totally blows away what most bands do these days.”&amp;nbsp;DÄLEKDälek reist al meer dan twintig jaar langs de randen van hiphop. Het duo – MC dälek en Mike Mare – bouwt dikke beats, gruizige drones en gelaagde noise om teksten die hard, helder en ongefilterd binnenkomen. Hun sound is donker, intens en eigenzinnig: hiphop als slagveld, waar shoegaze, industrial en politieke urgentie elkaar ontmoeten.In 2026 verschijnt hun nieuwe album: terug naar de essentie, zonder ballast. MPC 3000, vervormde gitaren, directe energie – alles in dienst van de track, niets teveel. Muziek dat je voelt in je ribbenkast: rauw, scherp en tot op het bot uitgepuurd."
  },
  {
    "Title": "FOUTLOOS",
    "DateString": "2026-04-19T20:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/foutloos",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/8030/ed/9b09b600880f6489418ec75503686c666cc267b4.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowᖴOᑌTᒪOOᔕ is een instrumentaal trio dat bestaat uit Esther Coorevits (Nemø ensemble, Tourist LeMC), Jonas Bruyneel (momoyo, Philemon, Vincent Coomans) en Renaud Debruyne (Mirek Coutigny, Mergel). In Foutloos gaan sferische improvisaties op altviool samen met funky baslijnen en snedige hiphopgrooves. Verwacht je aan verrassende akkoordenprogressies, gewaagde tempowissels en een verfrissende sound die de grenzen van genres oprekt.&amp;nbsp;&quot;The mood is sparkling, bright, full of life. This is modern, fresh, and groovy from the first second.&quot;&amp;nbsp;Dystopian (IT)&amp;nbsp;"
  },
  {
    "Title": "VIDEOMAPPING VOOR LIVE MUZIEK",
    "DateString": "2026-04-22T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/videomapping-voor-live-muziek",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/e9c3/12/ab37a3ab6f109ad13ad9743638f2434865828972.jpg",
    "Location": "De Kreun",
    "Description": "Over video mappingVideo mapping - ook wel projection mapping genoemd - is een techniek waarbij (vaak raar gevormde) objecten worden omgevormd tot een projectiescherm.Via beweging en aanpassingen in het beeld worden stilstaande objecten - zoals gebouwen, decors, ... - tot leven gewekt. De techniek wordt vaak toegepast bij elektronische muziek (als decor) en als advertentietechniek. De techniek laat je toe zelf creatief om te spelen met objecten/ruimtes. Ideaal om je fuif / project / jeugdhuis net dat ietsje meer te geven! In deze workshop leer je de basistechnieken van video mapping┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈► Timing en locatie:- 22 april 2026 - 19u tot 23u- De Kreun concertzaal┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈► Begeleider: Thomas Delbeke aka TheloocaThomas Delbeke aka @Thelooca projecteert bewegende beelden op haast alles, behalve projectieschermen. Van mapping, maskings tot volledige installaties doet hij er alles aan om het traditionele 16:9 formaat te vermijden.Een overzicht van zijn werk kun je vinden op www.thelooca.be !┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈► Praktisch + hoe inschrijven + meer info? &amp;nbsp;Ervaring in het digitaal bewerken van beeldmateriaal is niet vereist! Vooral goesting om creatief aan de slag te gaan is nodig! Wat je nodig hebt? Een laptop (mac of windows is hetzelfde) met daarop geïnstalleerd: de trial versie van Resolume Arena (http://resolume.com/download/)&amp;nbsp;"
  },
  {
    "Title": "SCOTT MCCLOUD",
    "DateString": "2026-05-08T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/scott-mccloud",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/0f34/54/1fbe088fb0a859c3adbce8dbc5018f5316bca3f9.jpg",
    "Location": "De Kreun Café",
    "Description": "Scott McCloud (Girls Against Boys, Soulside, Paramount Styles, AGRIO) brengt begin 2026 zijn eerste soloalbum Make it to Forever uit via God Unknown Records.&amp;nbsp;Voor McCloud zijn relaties gesprekken: soms vluchtig, soms levenslang, soms stilgevallen om later weer verder te gaan. Een magisch optreden met Girls Against Boys in Athene liet zo’n onuitwisbare indruk achter dat hij er jaren later besloot een plaat op te nemen. Athene werd decor én tijdcapsule.De songs draaien rond herinneringen, romances en ideeën die blijven bewegen. Over muziek als gesprek — tussen riffs, vragen, antwoorden en grapjes — en uiteindelijk het langste gesprek van allemaal: dat met jezelf.Het album werd opgenomen door Dimitris Dimitriades in Zero Gravity Studios (Athene) en begon als een rauw experiment: stem en akoestische gitaar, puur en kwetsbaar. Tijdens latere bezoeken groeiden de songs, met gastmuzikanten, zonder die intimiteit te verliezen.Scott McCloud was in de late jaren ’80 gitarist bij Soulside (Dischord) en richtte in de jaren ’90 Girls Against Boys op (Touch &amp;amp; Go, DGC).&amp;nbsp;"
  },
  {
    "Title": "JEROEN LEENDERS",
    "DateString": "2026-05-09T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/jeroen-leenders",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/cb9f/3c/459d9645c8021d225a5c683a1a2aeb140e916514.jpg",
    "Location": "De Kreun",
    "Description": "&amp;nbsp;De nieuwe generatie raast eraanGeschiedenis is een trein die genadeloos doordendert. Die onderweg denkbeelden verslindt om er nieuwe voor in de plaats te zetten. Jeroen beseft als geen ander dat hij deel uitmaakt van een generatie die met één been in het verleden en het andere in de toekomst staat. Een verleden waarin alles duidelijk was maar niemand echt vrij. Waarin het privilege van de één betaald werd met het ongemak van de ander.&amp;nbsp;&amp;nbsp;Hoe heftig zijn mede-dinosaurussen zich ook verzetten tegen hun uitsterven, het zijn hooguit de laatste stuiptrekkingen van een gedoemd bestaan. Aan de horizon kondigt de nieuwe, multipolaire wereld zich aan waarin geen grootmachten bestaan, waarin identiteit een hoogstpersoonlijke aangelegenheid is en waarin ook dieren personen zijn.&amp;nbsp;Anders dan voorheen volgen de veranderingen elkaar in razend tempo op. Je tijd uitzitten met je oude manier van bestaan is hoe langer hoe minder een optie. Haak aan en grijp de laatste kaartjes, want wie niet mee is raakt hopeloos achterop.&amp;nbsp;‘Laatste Kaartjes’ is een zaalshow voor wie de dingen liever niet aan het toeval overlaat, met afgewerkte grappen op volle snelheid. Uiteraard zal het er anarchistisch aan toe gaan. Jeroen streeft er immers naar de mens al lachend te laten instemmen met zaken waar die het stellig mee oneens is.&amp;nbsp;"
  },
  {
    "Title": "MATINEE: VICE VERSA",
    "DateString": "2026-05-10T11:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/matinee-vice-versa",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/f1e1/27/87e8a477858c57b758ed7016b3c5de8d5514b77d.jpg",
    "Location": "Concertstudio",
    "Description": "Jazz door drie compositorische genieënVice Versa ontstond uit de nood van Belgische pianist Bram De Looze (LABtrio, Joey Baron, Hank Roberts) om met artiesten samen te werken die als een natuurlijke aanvulling aanvoelen. Al snel vond hij met de New Yorkse meesterdrummer Eric McPherson (Jackie Mclean, Andrew Hill, Fred Hersch) en het Berlijnse contrabastalent Felix Henkelhausen (Jim Black, Nate Wooley, Lotte Anker) twee gelijkgezinden: compositorische genieën met een eindeloze ritmische vindingrijkheid.Dit veelzijdige, experimenterende trio legt de lat hoog wat betreft expressieve interpretatie en inventieve creativiteit. Verwacht uitzonderlijke benaderingen waarbij de muzikale regels voortdurend veranderen zonder aan continuïteit en dynamiek in te boeten. Verwacht, kortom, een intrigerende muzikale synthese waarbij de geest van traditionele jazz spontaan opduikt tijdens een intuïtieve ontdekkingsreis geleid door vrije improvisatie.Debuutalbum ‘Vice Versa’ verscheen in 2023 bij Dox Records. In januari 2025, toen Bram De Looze Artist in Residence was op het Brussels Jazz Festival in Flagey, namen ze hun tweede album live op voor een uitverkochte Studio 1. Hun nieuwe album verschijnt begin 2026 bij het Nederlandse Challenge Records."
  },
  {
    "Title": "JEROEN LEENDERS - EXTRA SHOW",
    "DateString": "2026-05-10T20:15:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/jeroen-leenders-extra-show",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/7ad8/24/9e29c888e4366d2f001a69535dbe85a1c504a829.jpg",
    "Location": "De Kreun",
    "Description": "Geschiedenis raast voort als een trein. Wie geen ticketje richting toekomst heeft, is gedoemd achter te blijven met zijn of haar oude manier van leven. Gelukkig vindt Jeroen Leenders dat allemaal maar om te lachen. En hij hoopt dat jij al lachend zal instemmen met de zaken waar je het eigenlijk niet mee eens bent.&amp;nbsp;Geschiedenis is een trein die genadeloos doordendert. Die onderweg denkbeelden verslindt om er nieuwe voor in de plaats te zetten. Jeroen beseft als geen ander dat hij deel uitmaakt van een generatie die met één been in het verleden en het andere in de toekomst staat. Een verleden waarin alles duidelijk was maar niemand echt vrij. Waarin het privilege van de één betaald werd met het ongemak van de ander.  &amp;nbsp;&amp;nbsp;Hoe heftig zijn mede-dinosaurussen zich ook verzetten tegen hun uitsterven, het zijn hooguit de laatste stuiptrekkingen van een gedoemd bestaan. Aan de horizon kondigt de nieuwe, multipolaire wereld zich aan waarin geen grootmachten bestaan, waarin identiteit een hoogstpersoonlijke aangelegenheid is en waarin ook dieren personen zijn. Anders dan voorheen volgen de veranderingen elkaar in razend tempo op. Je tijd uitzitten met je oude manier van bestaan is hoe langer hoe minder een optie. Haak aan en grijp de laatste kaartjes, want wie niet mee is raakt hopeloos achterop. &amp;nbsp;&amp;nbsp;‘Laatste Kaartjes’ is een zaalshow voor wie de dingen liever niet aan het toeval overlaat, met afgewerkte grappen op volle snelheid. Uiteraard zal het er anarchistisch aan toe gaan. Jeroen streeft er immers naar de mens al lachend te laten instemmen met zaken waar die het stellig mee oneens is. &amp;nbsp;Dit is een zittende voorstelling.&amp;nbsp;&amp;nbsp;"
  },
  {
    "Title": "MICAH P. HINSON",
    "DateString": "2026-05-14T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/micah-p-hinson",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/60d6/70/e0096afaa33ccc0f4a1645e1bb5e805a2167eb6e.jpg",
    "Location": "De Kreun",
    "Description": "Na een geslaagde passage op Sonic City 2025 keert Micah P. Hinson terug naar Kortrijk!Begin 2020 stond Micah P. Hinson op het punt de muziek definitief achter zich te laten. De Amerikaans-Spaanse singer-songwriter, die toen al tien lovend ontvangen albums op zijn naam had en een trouwe schare fans, voelde zich creatief vastgelopen en kampte met een diepe depressie.De uitbraak van de COVID-19-pandemie bracht onverwacht ruimte voor reflectie. Hinson nam zich één duidelijke beslissing voor: voortaan zou hij alleen nog schrijven over het heden. Maar eerst moest hij afsluiten. Hij dook zijn archieven in en werkte nummers af die hij de voorbije 25 jaar had geschreven. Het resultaat was I Lie to You, zijn elfde album: een laatste terugblik, het einde van een hoofdstuk en tegelijk het begin van een nieuw tijdperk.I Lie to You betekent ook een belangrijk keerpunt in zijn carrière. Voor het eerst werkte Hinson samen met een externe producer: Alessandro “Asso” Stefana (PJ Harvey, Mike Patton). Die hielp de songs te ontdoen van franjes en terug te brengen tot hun emotionele kern. Via Stefana kwam Hinson bovendien terecht bij Ponderosa Music Records, het gerenommeerde Italiaanse label waar ook Patti Smith, Blonde Redhead en zijn vroege helden The Jesus and Mary Chain thuis zijn.Voor fans van: Sonic Youth, Dinosaur Jr., The Cure"
  },
  {
    "Title": "TUUR FLORIZOONE &amp; ANU JUNNONEN",
    "DateString": "2026-05-17T20:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/tuur-florizoone-anu-junnonen",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/1923/77/7dcaad93d91fcc8a72e599e2b13b547c7738b37c.jpg",
    "Location": "HOF",
    "Description": "Jazz Cats clubshowAnu Junnonen en Tuur Florizoone vormen al 20 jaar een uniek muzikaal duo. Hun liveoptredens zijn bekend van een eigentijdse crossover tussen jazz, hippe folk, diepgaande emotie en een portie humor. De Finse origines van Anu laten zich duidelijk voelen in haar composities. De samenwerking met de creatieve en virtuoze accordeonist Tuur Florizoone is dan ook op haar lijf geschreven. Tuur is een muzikale duizendpoot die zijn stempel heeft gedrukt op tal van indrukwekkende projecten.De samenwerking van Anu en Tuur begon tijdens hun studies aan het conservatorium van Brussel. Met de groep &#039;aNoo&#039; hebben ze samen twee albums uitgebracht: “The Luckless lands of the North” (Homerecords 2007) en &quot;Sinipiika” (Prova Records 2011). Voortbouwend op deze hechte band gaan de twee muzikanten nu op zoek naar nieuwe spelletjes, nieuwe woorden, risicovolle acrobatiek en gedurfde combinaties. Jazz, improvisatie, folk, techno of tango, alles is een bron van inspiratie. Met hun originele duo-formule (zang en accordeon) willen ze buiten de gebaande paden treden, weg van alledaagse geluiden.&amp;nbsp;"
  },
  {
    "Title": "STIMULAR X 10 YEAR MADBACK RECORDS",
    "DateString": "2026-06-06T19:30:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/stimular-x-10-year-madback-records",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/b866/9d/dd0c2ea8b5d99665b2accac4a4de49467446b160.jpg",
    "Location": "De Kreun",
    "Description": "SAVE THE DATE!&amp;nbsp;Techno - Industrial - Hardcore - Gabber - Rave// Limited capacity. You don&#039;t want to miss this one!// Early bird tickets on sale now!&amp;nbsp;Line-up TBA soon!&amp;nbsp;"
  },
  {
    "Title": "LEGENDS OF ROCK TRIBUTE FESTIVAL - Nirvana, Pearl Jam, Green Day...",
    "DateString": "2026-10-02T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/legends-of-rock-tribute-festival-nirvana-pearl-jam-green-day",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/503e/84/ff4059a3b64eca4db37942d1d216ffd7a00e0baa.jpg",
    "Location": "De Kreun",
    "Description": "Op vrijdag 2 oktober 2026 komt de internationale LEGENDS of ROCK Tribute Tour naar De Kreun in Kortrijk met een spectaculaire Grunge/Punk/Rock-editie. De No.1 tribute bands van Nirvana, Pearl Jam, Green Day en Soundgarden/ Audioslave spelen op indrukwekkend authentieke wijze alle hits en de beste albumsongs van hun muzikale helden. Met dynamische lichtshows en special effects en in een perfecte ambiance zorgen deze top bands met passie en volle overgave voor een aaneenschakeling van indrukwekkende concerten met vele muzikale hoogtepunten.&amp;nbsp;Kinderen tot en met 11 jaar komen gratisKinderen tot en met 14 jaar komen met begeleider"
  },
  {
    "Title": "BIZKIT PARK",
    "DateString": "2026-10-10T19:00:00+0200",
    "Url": "https://www.wildewesten.be/nl/event/bizkit-park-2",
    "ImageUrl": "https://www.wildewesten.be/media/cache/default_uitdatabank/upload/media/default/cb3e/12/2d1b42fe9c9383c9da2b0d7a47b557a078a2c4bc.jpg",
    "Location": "De Kreun",
    "Description": "Bizkit Park&amp;nbsp;brengt op spectaculaire wijze hulde aan één van de meest illustere sub genres uit de alternatieve muziek: NU-METAL.Alle classics uit dit weergaloze tijdperk passeren de revue in een wervelende en naadloze set. Limp Bizkit, Korn, System of a Down, Linkin Park, Slipknot, Papa Roach, Deftones, Disturbed, ..&amp;nbsp;Ze moeten er allemaal aan geloven.Nu-Metal heeft voor de soundtrack van een hele generatie gezorgd. Welke millennial is nu niet vertrouwd met de middelvinger van Fred Durst, de stem van Chester Bennington of het masker van Corey Taylor? Daarnaast zorgde het voor het laatste bolwerk van de zware gitaar in de mainstream. Elke dag snoeiharde riffs en beukende drums op radio en tv. Vandaag is dit praktisch ondenkbaar geworden.Hoog tijd dus voor een passend eerbetoon! Bizkit Park neemt de taak met duizelingwekkend enthousiasme ter harte. &#039;Keep on rollin&#039; baby, you know what time it is.’"
  }
]