[
  {
    "Title": "Ertebrekers (try-out)",
    "DateString": "2026-01-30T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/ertebrekers-try-out/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/ertebrekers-try-out-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>ERTEBREKERS</h3>\n<p><strong>Try-out van de nieuwe plaat.</strong></p>\n<p>Ze zijn terug! Alé, grotendeels toch. De heerlijke, zwoele West-Vlaamse soul van Ertebrekers keert terug naar 4AD met een nieuwe plaat, maar met één groot verschil: Flip Kowlier maakt geen deel meer uit van de band. </p>\n<p>Of dat de harten van Peter Lesage en Jeffrey Bearelle brak? Neen. Of zoals Lesage het zelf verwoordt: “Jammer, zeker. Maar het is geen sinecure om drie succesvolle bands én een solocarrière te combineren:’t Hof Van Commerce, Flips nieuwe soloplaat én een nieuw album van Ertebrekers&#8230; Flip speelt wel nog mee op twee songs, ‘Kon ik maar een beetje beter dansen’ en ‘El Narcistico’. De andere songs komen uit de koker van Jeffrey en mezelf.”</p>\n<p>Je zou de totstandkoming van de nieuwe plaat een beetje kunnen beschouwen als een geval van ‘reculer pour mieux sauter’. Dat Kowlier andere horizonten opzocht, gaf meer ruimte aan de songsmid Lesage die het album een iets nadrukkelijker soul-signatuur gaf. Waar de vorige Ertebrekers-platen nog een groter singer-songwriter aandeel hadden, konden Bearelle en Lesage het soullaken nu volledig naar zich toetrekken: het resultaat is een compromisloze plaat–meer soul &amp; disco, funk en hip-hop-georiënteerd, zeker wat de tempo’s en beats betreft–waarop de stem van Bearelle mooi blendt met de melodieuze arrangementen van Lesage. Twee soulbrothers in één ruimte, dat geeft coole resultaten.</p>\n<p>De plaat is rijk gearrangeerd, met een knipoog naar oude en nieuwe soul-legends. Een plaat die mikt op de benen én op het hart, want ook qua thematiek laten Lesage en Bearelle in hun hart kijken.“Waar we voorheen nog iets meer tongue-in-cheek-humor de plaat binnensmokkelden, leunen we qua thema’s nu iets dichter aan bij zaken waar we allemaal mee bezig zijn; er is meer zelfreflectie, meer introspectie en meer zelfliefde. De jongensachtige branie is er nog steeds, maar er hangt een laagje serieux over, zonder zwaar op de hand te klinken.”</p>\n<p>Het allereerste concert van Ertebrekers 2.0 is op vrijdag 30 januari bij 4AD. Tickets zijn nu te koop!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/ertebrekers/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/search/top?q=ertebrekers\">Facebook</a></p>"
  },
  {
    "Title": "Motsus + Idealus Maximus",
    "DateString": "2026-01-31T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/motsus-idealus-maximus/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/motsus-idealus-maximus-1.png",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>MOTSUS</h3>\n<p><strong>Release show van de nieuwe plaat &#8216;ATLAS&#8217;.</strong></p>\n<p>Dat er in de IJzer veel chemische substanties rondzwemmen, is een publiek geheim. Maar in Oudenburg moeten er nog veel kwaadaardigere viezigheden dobberen. Het stonertrio <strong>MOTSUS</strong> ontstond in die polderstad in 2012 en is sindsdien bezig zich een weg te banen door de heavy underground met een compromisloze mix van <strong>stonerriffs, hedendaagse sludge metal en oldschool doom</strong>. Dodelijk zwaar en traag, een beetje zoals de Belgische begrotingsonderhandelingen, maar soms ook messcherp snel en onverzettelijk.</p>\n<p><strong>ATLAS</strong> markeert een belangrijke evolutie voor het trio. Het album, opgenomen in de <strong>Dunk!Studio’s</strong> in Zottegem en gemixt en gemasterd door <strong>Karl Daniel Lidén</strong>, neemt je mee op een sonische reis van intieme akoestische fluisteringen tot gedurfde nieuwe composities die dieper terrein verkennen binnen doom en atmosferische klanken. De <strong>releaseshow bij 4AD</strong> bevat een speciale uitvoering van de volledige “Exploder”-saga, waarbij “Exploder Pt. I” van Oumuamua (2018) naadloos overgaat in “Exploder Pt. II” van het nieuwe album—een carrière-overspannend verhaal dat voor het eerst als één geheel wordt gespeeld.</p>\n<p>Na <strong>Oumuamua</strong> (2018, uitgebracht via Polderrecords) deelde MOTSUS podia op festivals zoals de Gentse Feesten en <strong>Alcatraz</strong>, waarmee ze een reputatie opbouwden voor fysieke, fundamenten-doen-trillen­de liveshows.</p>\n<p><strong>De releaseshow bestrijkt de volledige catalogus van de band—van hun rauwe demo’s uit 2014, via de interstellaire zwaarte van Oumuamua, tot het gloednieuwe ATLAS-materiaal dat integraal wordt uitgevoerd.</strong></p>\n<p><a target='_blank' href=\"https://www.instagram.com/motsus_be/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/MOTSUS.BE\">Facebook</a></p>\n<h3>Idealus Maximus</h3>\n<p><strong>Instrumentaal rocktrio.</strong></p>\n<p>Opgericht in 2004 door <strong>Fanio (drums), Erik (gitaar) en Pablo (bas)</strong>, heeft Idealus Maximus in de voorbije twee decennia een stevige reputatie opgebouwd binnen de Belgische stoner- en instrumentale rockscene. Bekend om hun hypnotiserende, door riffs gedreven klanklandschappen, deelde de band het podium met hun grootste inspiratiebronnen, waaronder <strong>Karma To Burn en The Atomic Bitchwax</strong>, en speelde ze op festivals zoals <strong>Yellowstock en Roadkill</strong>.</p>\n<p>Hun meest recente wapenfeit, <strong>Loofbos</strong> uit 2022 (uitgebracht via Polderrecords), toonde het vakmanschap van het trio in het opbouwen van atmosferische, psychedelische passages die uitmonden in verpletterende geluidsmuren.</p>\n<p>Met kersverse studiotracks op zak belooft Idealus Maximus een krachtige performance die naadloos aansluit bij de instrumentale doomesthetiek van MOTSUS. Verwacht verpletterende riffs, hypnotiserende grooves en het soort dynamische, instrumentale storytelling dat hen al meer dan twintig jaar een vaste waarde maakt in de Belgische heavy-muziekscene.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/idealusmaximus/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/IdealusMaximus\">Facebook</a></p>"
  }
]