[
  {
    "Title": "Knotwilg Festival",
    "DateString": "2026-05-09T16:00:00.0000000",
    "Url": "https://www.4ad.be/event/knotwilg-festival/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/knotwilg-festival-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<p><strong>Het iconische Knotwilg Festival komt in 2026 naar Diksmuide! Knotwilg Records is het label dat bekendstaat als een portaal naar experimentele muziek en obscure acts. De volledige line-up zal binnenkort bekend worden gemaakt!</strong></p>\n<p><em>Tot nu toe aangekondigd: Eternal Music Society, pFeM en Split Apex!</em></p>\n<h3>ETERNAL MUSIC SOCIETY (swe)</h3>\n<p>Eternal Music Society is een Zweedse supergroep die is ontstaan uit de vruchtbare experimentele scene van Göteborg en Malmö, gecentreerd rond het visionaire Discreet-label. De band verenigt leden van enkele van de meest eigenzinnige undergroundprojecten van het afgelopen decennium:  Enhet För Fri Musik (Discreet), Skeppet, Frihet, Neutral, Leda (Knotwilg) en Kröppskanedom (Morc).  Elk bekend om het verleggen van de grenzen van vrije muziek, drone en avant-rock.</p>\n<p>Samen vormen ze een collectief dat de ruwe geest van improvisatie omzet in een dichte, hypnotiserende wervelstroom van fuzzy noiserock. Hun geluid draait om gruizige, overstuurde gitaren, een diep groovende bas en onophoudelijk repetitieve drumpatronen die samensmelten tot een trance-achtige puls. De twee drummers zorgen niet alleen voor strakke ritmes, maar creëren ook een subtiele, bijna psycho-akoestische fasewerking die de grens tussen structuur en chaos doet vervagen. Verslavende, repeterende riffs golven op en neer, met een euforische kracht die uitnodigt tot wat je alleen maar ‘cloud-busting psych headbanging’ kunt noemen.</p>\n<p>In aanloop naar het festival brengt Knotwilg Records een gelimiteerde LP van de groep uit, voorzien rond februari/maart 2026. Na hun in eigen beheer uitgebrachte debuutsingle Eternal Return / Impasse (2025) belooft dit album de meeslepende live-energie van de band in volle analoge glorie vast te leggen.</p>\n<p>Selectieve discografie:<br />Eternal Return / Impasse7” (eigen beheer, 2025)<br />TBALP (Knotwilg Records, 2026)<br />Voor liefhebbers van: Water Damage, France, Spacemen 3 / Loop, Shellac, Steve Reich</p>\n<p><a target='_blank' href=\"https://eternalmusicsociety.bandcamp.com/\">Bandcamp</a></p>\n<h3>PFEM (fr)</h3>\n<p>Brutalistische gitaarnoise in haar puurste vorm. pFeM is het compromisloze duo van Pierre Faure (Sun Stabbed, La Morte Young) en Erik Minkkinen (Sister Iodine), twee zwaargewichten uit de Franse experimentele ondergrond. Hun geluid: aangetaste feedbacklagen en massieve drones die traag verschuiven, instorten en weer herrijzen als aardplaten in beweging.</p>\n<p>Tijdens Knotwilg Festival gaan ze de confrontatie aan met de IJzer in een sidderend bombardement van gitaargolven dat de oevers van Diksmuide uitdaagt. Houdt 4AD stand? Natuurlijk. Maar niet zonder trillingen in de fundamenten.</p>\n<p>Voor het eerst op een Belgisch podium.<br />Zware guitardrones. Kom voorbereid.</p>\n<p>Greep uit de discografie:<br />pFeM – Before Rising Waters(Knotwilg Records, 2024)<br />Sun Stabbed – In Girum Imus Nocte Et Consumimur Igni(Doubtful Sounds, 2020)<br />Sister Iodine – Hollozone(Nashazphone, 2023)<br />Voor fans van: Surface of the Earth, Sunn O))), Gate, Flying Saucer Attack (de harde variant)</p>\n<p><a target='_blank' href=\"https://dysmusie.bandcamp.com/\">Bandcamp</a></p>\n<h3>SPLIT APEX (UK)</h3>\n<p>Het uithollen van krabbepoten is een ambacht dat even precies en intens is als het wegschrapen van overtollige klanken uit een songstructuur. Precies dát beheerst Split Apex als geen ander.<br />Het duo Peter Blundell en Jussi Palmussari bouwt aan een wereld van diepe, pulserende baslijnen, minimale, poëtische maar dreigende vocals, inventieve elektronica, noisy doch ingehouden gitaarimplosies, gedragen door subtiele, trefzekere ritmes. Muziek die niet aandikt, maar uitbeent; niet stapelt, maar snijdt.</p>\n<p>Echo’s van Blundells verleden bij Mosquitoes sijpelen onmiskenbaar door en voelen tegelijk als een logisch vervolg. Hun debuut-LP Thoughts In 3D (Ever/Never) werkt hypnotiserend, bezwerend en haast ademloos: gedeconstrueerde postpunkdub die je dwingt te luisteren tussen de klanken, op zoek naar houvast.</p>\n<p>Referentiepunten lijken te ontbreken, tot ze zich plots aandienen. Een uitgemergelde Shadow Ring. Public Image Ltd. ten tijde van Metal Box. En ja, zelfs een onwaarschijnlijke alliantie tussen Throbbing Gristle en Captain Beefheart voelt hier niet vergezocht.</p>\n<p>Split Apex past naadloos binnen het universum van Knotwilg Festival: compromisloos, intens en eigenzinnig. Net als pFeM en Eternal Music Society is hun optreden een primeur en exclusief voor België (en omstreken).</p>\n<p><a target='_blank' href=\"https://evernever-records.bandcamp.com/album/thoughts-in-3d\">Thoughts In 3D (Ever/Never)</a> | <a target='_blank' href=\"https://knotwilg.bandcamp.com/album/reverse-drift-reverse-charge\">Bandcamp</a></p>"
  }
]