[
  {
    "Title": "Johnny Dowd",
    "DateString": "2026-03-06T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/johnny-dowd/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/johnny-dowd-3.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>Johnny Dowd (vs)</h3>\n<p><strong>Amerikaanse alt-country legend.</strong></p>\n<p>Johnny Dowd is een Amerikaanse singer-songwriter die sinds de jaren negentig een eigenzinnige positie inneemt binnen de alt-country en americana. Zijn muziek laveert tussen country, blues, punk en spoken word, altijd gekleurd door een duistere flair en een vaak cynische (of realistische) blik op het leven.</p>\n<p>Pas op latere leeftijd begon Dowd aan zijn muzikale pad — rond zijn veertigste, in Ithaca, New York, waar hij zijn eerste nummers schreef. Zijn debuutalbum Wrong Side of Memphis uit 1995 bezorgde hem meteen een cultstatus. Recensenten omschrijven hem als “Willie Nelson die verandert in Mr. Hyde” en prijzen zijn gruizige stem, gitzwarte humor en nietsontziende teksten.</p>\n<p>In de jaren die volgden bracht Dowd bijna twintig albums uit, tourde hij door de VS en Europa, en werkte hij samen met onder meer The Mekons, Sally Timms en Jon Langford. Zijn meest recente plaat, Is Heaven Real? (How Would I Know?), grijpt terug op de soul en R&amp;B uit zijn jeugd in Oklahoma en Memphis, maar dan met zijn kenmerkend eigenwijze stijl.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/johnny.dowd/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/JohnnyDowdOfficial\">Facebook</a></p>\n<h3>Ciska Ciska</h3>\n<p><strong>Beloftevolle Belgische songwriter.</strong></p>\n<p>De 25-jarige Ciska Dhaenens uit Gent is bezig met een stevige doorbraak in het muzieklandschap. Samen met haar band maakt ze breekbare, maar toch krachtige songs, geïnspireerd door persoonlijke idolen als Julia Jacklin, Big Thief en Aldous Harding.</p>\n<p>Debuutsingle ‘Biotope’ is alvast een sterke opener waarmee ze elke reviewsite het voorbije jaar naar meer liet hunkeren. Intussen werken Ciska en haar band hard aan de eerste volledige plaat. Dhaenens: “Met de release van mijn debuutalbum wil ik een levenshoofdstuk vol twijfels en angsten afsluiten. Ik durf mezelf en mijn kwetsbaarheid eindelijk op een piëdestal te plaatsen en daar zal het album ook symbool voor staan. Voor mij voelt het aan als één groot coming-of-ageverhaal.”</p>\n<p>Ciska Ciska veroverde al heel wat straffe podiumplekken, o.a. op Best Kept Secret, Leffingeleuren en AFF. Blogsite Dansende Beren classificeert haar tot Grote Beer van Morgen. Om maar te zeggen: kom vroeg en ontdek beloftevol talent van eigen bodem!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/ciska_ciska_/\">Instagram</a></p>"
  },
  {
    "Title": "Emma Hessels + Aghogho",
    "DateString": "2026-03-07T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/emma-hessels-aghogho/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/emma-hessels-aghogho-3.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<p><strong>Concerten ten voordele van Punt vzw, in het kader van Internationale Vrouwendag.</strong><br /><em>Per verkocht ticket doneert 4AD €5 aan Punt vzw, een organisatie die slachtoffers ondersteunt van alle vormen van seksueel geweld.</em></p>\n<h3>Emma Hessels</h3>\n<p><strong>Grote Belgische belofte met intieme nummers die stevig binnenkomen.</strong></p>\n<p>Emma Hessels is langzaam maar zeker de muzikale harten van het land aan het veroveren. Sinds haar selectie als laureaat van Sound Track in 2023 bewijst ze voor steeds meer publiek dat ze een artieste is om stevig in het vizier te houden. Ze stond al op Best Kept Secret en mocht het voorprogramma verzorgen van Cat Power en Mavis Staples.</p>\n<p>Gewapend met een gitaar en haar kenmerkende stem balanceert ze moeiteloos over de diepste kloven van verlangen, liefde en eenzaamheid. Kleine nummers over universele thema’s, die regelmatig een krop in de keel bezorgen.</p>\n<p>Haar debuut-EP ‘Constant Distance’ verscheen onlangs bij Unday Records.<br />Luminous Dash over die plaat: “Constant Distance is een stevige binnenkomer van een artiest die aan het begin staat van een veelbelovende carrière.”</p>\n<p>Live met band op 07.03.26 bij 4AD!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/emmahessels/\">Instagram</a></p>\n<h3>Aghogho</h3>\n<p><strong>Soul, afropop en funky vibes.</strong></p>\n<p>Met Aghogho wil Caro Abutoh haar Nigeriaanse roots en muzikale nieuwsgierigheid verkennen, en tegelijk ook mensen in beweging brengen. Ze bracht onlangs haar debuut-EP 17 uit en maakt warme, ritmische afropop die meteen een zomers gevoel geeft.</p>\n<p>Samen met Simon Pas (drums), Michiel Los (gitaar), Julia Warmerdam (trompet) en Caro zelf (zang &amp; bas) ontstond Aghogho tijdens een residentie in Het Bos. De naam Aghogho – Caro’s Nigeriaanse naam – betekent ‘kind van God’.</p>\n<p>Caro zingt al van jongs af aan en ontwikkelde haar muzikale stijl tijdens haar opleiding Kleinkunst aan het Conservatorium van Antwerpen. Haar muziek is warm, ritmisch en experimenteel, en doet denken aan artiesten als Nilüfer Yanya en Zap Mama.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/__aghogho__/\">Instagram</a></p>"
  },
  {
    "Title": "Sophie Straat",
    "DateString": "2026-03-20T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/sophie-straat/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/sophie-straat-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>SOPHIE STRAAT (nl)</h3>\n<p><strong>Moeilijke onderwerpen, straffe songs en vooral recht door zee.</strong></p>\n<p>Ze maakte een bliksemstart met haar carrière dankzij haar debuut-ep <strong>&#8216;’T Is Niet Mijn Schuld&#8217;</strong> (2020), waarmee ze een Edison won. Voor haar debuutalbum <strong>&#8216;Smartlap Is Niet Dood&#8217;</strong> (2023) volgden nominaties voor 3FM Awards, Edisons en de Amsterdamprijs voor de Kunst. </p>\n<p>De ep <strong>&#8216;Gebroken Spiegels&#8217;</strong> verscheen in 2024 en bestaat uit één lang lied, opgenomen met het Metropole Orkest. Volgens De Groene Amsterdammer is het “zeldzaam groots opgezet en gedurfd”. Binnen een paar jaar groeide Sophie Straat zo uit tot “het boegbeeld van de generatie twintigers die maatschappelijk betrokken is” (de Volkskrant) en verzamelde haar muziek meer dan vijftien miljoen streams. </p>\n<p>De band maakte indruk op festivals van ITGWO tot BKS, en van Wildeburg tot Lowlands en Pukkelpop – maar ook met uitverkochte clubtours en het eigen festival Protestfest: al drie jaar op rij in een volledig uitverkocht Paradiso, Amsterdam.</p>\n<p>Naast haar muziek maakt Sophie als multidisciplinair kunstenaar ook artwork, foto’s en films, zoals de korte film Mooier Als Je Lacht, die draait om drie albumsongs. </p>\n<p>Ze komt mét band en een album vol nieuwe muziek naar Diksmuide.<br />Revolutie en protest op vrijdag 20 maart bij 4AD!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/sophiestraat/\">Instagram</a></p>\n<h3>Fritzi (nl)</h3>\n<p><strong>Melancholische, elektronische pop.</strong></p>\n<p>Fritzi experimenteert erop los en glipt tussen genres door, maar als we er toch een naam aan willen geven, zetten we ons geld op ‘melancholische, elektronische pop’. Met haar zelfgeproduceerde bassen en scherpe beats creëert ze een mix van harmonie en emotie die je meeneemt in haar leefwereld van een jonge vrouw in de grote stad. Samen met Groove God Jaïr Darnoud en Kiki Margari brengt ze een liveshow die diep, rauw en extreem dansbaar is. Kom vroeg, blijf laat!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/f.ritzi/\">Instagram</a></p>"
  }
]