[
  {
    "Title": "EYEHATEGOD",
    "DateString": "2026-06-23T18:30:00.0000000",
    "Url": "https://www.4ad.be/event/eyehategod/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/eyehategod.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>EYEHATEGOD (vs)</h3>\n<p>Tijd om nog eens absolute levende legendes op ons podium te halen. <strong>EYEHATEGOD</strong> is al sinds 1988 het toonbeeld van de <strong>Southern sludge metal</strong> en komt helemaal naar het meest verdoemde verdoemishoekje van het land: Diksmuide!</p>\n<p>Debuutplaat <strong>&#8216;In the Name of Suffering&#8217;</strong> uit 1990 maakte de belofte van zijn titel waar met gekwelde zang, logge powerchords, misantropische teksten en slepende sludgeriffs die zich ontvouwen tot explosies van hardcorepunksnelheid. EYEHATEGOD ontpopte zich al snel tot een van de sleutelfiguren van de NOLA-scene, een positie die ze verder verankerden met hun tweede album <strong>&#8216;Take as Needed for Pain&#8217;</strong> (1993), een feest van ellende, doordrenkt in diepe sludge. Die lijn wordt doorgetrokken op <strong>&#8216;Dopesick&#8217;</strong> (1996), dat balanceert tussen lange, verstikkende doomnummers en kortere, met punk doordrenkte tracks, met Mike Williams’ stem als verbindend element — aangedreven door een leven vol brute pech en nog rampzaligere keuzes. Onmiskenbaar een van de kernplaten binnen het sludgegenre en verplichte luisterkost voor liefhebbers.</p>\n<p>Hun meest recente plaat <strong>&#8216;A History of Nomadic Behaviour&#8217;</strong> (2021) kwam voort uit de driejarige tour waar ze in 2017 op vertrokken en de twee jaar durende pandemie vol politieke woelingen en eindeloze hypocrisie. Het resultaat is een combinatie van door blues doordrenkte en met benzine overgoten vervormde klanken, bestaande uit grotendeels mid-tempo nummers, doorboord met schrijnende pijn en ontredderde woede.</p>\n<p>In 2026 trekken ze opnieuw de lange baan op, met <strong>Mike IX Williams</strong> op zang, <strong>Jimmy Bower</strong> op gitaar, <strong>Gary Mader</strong> op bas en <strong>Aaron Hill</strong> aan de drums. Een essentiële band om op je &#8216;heb ik ooit nog live gezien&#8217;-bingokaart te doorstrepen!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/eyehategodnola/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/OfficialEyeHateGod\">Facebook</a></p>"
  }
]