[
  {
    "Title": "Luminous Belge",
    "DateString": "2026-02-06T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/luminous-belge/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/luminous-belge.png",
    "Location": "Muziekclub 4AD",
    "Description": "<p><strong>We vieren, samen met Luminous Dash, de Week van de Belgische Muziek met Malfait, Head on Stone, Gros Coeur en Dj François du Painlait!</strong></p>\n<h3>MALFAIT</h3>\n<p>Malfait laat elektronica en indie samensmelten tot een unieke en meeslepende sound. Atmosferische synths, pulserende drums en een stem die je niet meer loslaat staan garant voor een ware sonische trip. Met invloeden van Britse indie tot Bicep en M83 creëert Malfait een ervaring die tegelijk dansbaar en melancholisch is.<br />De producer en zanger werkte in het verleden onder de naam LXNGTN. Met zijn door house geïnspireerde livesets speelde hij onder meer op Tomorrowland en Amsterdam Dance Event.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/malfait_music/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/profile.php?id=61566791594775\">Facebook</a></p>\n<h3>HEAD ON STONE</h3>\n<p>Head on Stone is het soloproject van Nele Janssen (Peuk), waarop ze een totaal andere kant van haar persoonlijkheid laat zien. Met enkel haar stem en een piano neemt ze de luisteraar mee in haar diep persoonlijke wereld. De songs zijn tegelijk fantasierijk en integer, droevig en hoopvol, virtuoos en afwijkend.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/headonstonemusic/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/headonstone\">Facebook</a></p>\n<h3>GROS COEUR</h3>\n<p>De Brussels-Luikse band GROS COEUR serveert heerlijk vettige, tropisch-psychedelische rock. Na hun debuutalbum ‘Gros Disque’ (2023) trokken ze door heel Europa, met honderden shows op de fijnste festivals, waar ze hun sterke livereputatie nog verder wisten te versterken.<br />Dit voorjaar bracht het viertal de single en video ‘Sacrifice’ uit: acht minuten gezonde waanzin en een voorsmaakje van hun tweede album ‘Vague Scélérate’, dat enkele weken geleden het levenslicht zag. Een heerlijk geschift Belgisch feest om de avond af te sluiten!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/groscoeurband/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/GrosCoeurBand\">Facebook</a></p>"
  },
  {
    "Title": "A.A. Williams + Spotlights",
    "DateString": "2026-02-07T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/a-a-williams-spotlights/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/a-a-williams-spotlights-2.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>A.A. Williams (vk)</h3>\n<p><strong>Overweldigende post-rock en duistere folk.</strong></p>\n<p>Na haar indrukwekkende debuut op <strong>Roadburn</strong> heeft de Britse <strong>A.A. Williams</strong> een straffe opmars gemaakt binnen de internationale muziekscene. Met een sound die laveert tussen post-rock, neoklassiek en donkere folk, tourde ze inmiddels met zwaargewichten als Cult of Luna, Explosions In The Sky, Russian Circles, Sleep Token en The Sisters of Mercy. Intussen bouwde ze ook aan een eigen parcours, met als hoogtepunt een soloshow in de iconische Queen Elizabeth Hall in Londen.</p>\n<p>Williams’ albums <strong>Forever Blue</strong> (2020) en <strong>As The Moon Rests</strong> (2022) konden op heel wat applaus rekenen van zowel pers als publiek. Haar meeslepende songs, doordrenkt van melancholie en intensiteit, maken van haar een unieke artieste met een eigen stempel.</p>\n<p>Tijdens de lockdown verraste ze met <strong>Songs From Isolation</strong>, een intieme coverplaat die lof oogstte van niemand minder dan Robert Smith (The Cure) en Billy Corgan (Smashing Pumpkins). Haar samenwerking met de Japanse post-rockband <strong>MONO</strong> (Exit in Darkness) en haar klassieke herwerking van haar debuut-EP in het adembenemende arco tonen haar veelzijdigheid als multi-instrumentalist en componist. Ze bracht net ook een live-EP uit van haar <strong>Audiotree-sessie</strong>, een mooi voorproefje de live-ervaring in februari.</p>\n<p>A.A. Williams en 4AD, het gaat een hele mooi combinatie worden.</p>\n<p><em>Voor fans van o.a. MONO, Emma Ruth Rundle, This Will Destroy You en Chelsea Wolfe.</em></p>\n<p><a target='_blank' href=\"https://www.instagram.com/aawilliamsmusic/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/aawilliamsmusic\">Facebook</a></p>\n<h3>Spotlights (vs)</h3>\n<p><strong>Sfeervolle, brute en straffe post-metal.</strong></p>\n<p>Klaar voor je nieuwe favoriete ontdekking?<br />Spotlights is een bijzonder Amerikaans trio dat doom vermengt met <strong>shoegaze, post-rock koppelt aan sludge</strong> en bovenal op zoek gaat naar een dromerige, melodieuze trip.</p>\n<p>Hun muziek is sfeervol – misschien zelfs romantisch – maar tegelijkertijd ruw, bruut en loeizwaar. Verwacht hier geen agressieve, schreeuwende New Yorkers: ze onderscheiden zich met een pure kracht die eerder een dromerige klankenwereld oproept dan één vol haat.</p>\n<p>My Bloody Valentine meets Smashing Pumpkins. Misschien zoiets – maar dan weer helemaal anders. Ze mochten al mee op tour met Deftones en deelden het podium met Melvins, Hum, Glassjaw en Pelican. Het beroemde Ipecac Recordings nam hen onder zijn vleugels, met Seismic (2017) en Love and Decay (2019) als resultaat.</p>\n<p>De verwachtingen zijn hoog – kom op tijd!</p>\n<p><a target='_blank' href=\"https://www.instagram.com/spotlightsmusic/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/spotlightsband\">Facebook</a></p>"
  },
  {
    "Title": "Scott Hepple and The Sun Band",
    "DateString": "2026-02-13T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/scott-hepple-and-the-sun-band/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/scott-hepple-and-the-sun-band-1.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>Scott Hepple and The Sun Band (vk)</h3>\n<p><strong>Old school rock-&#8216;n-roll!</strong></p>\n<p>Tijd om de rock terug in rock-‘n-roll te zetten. Scott Hepple and The Sun Band doet precies dat: old school rock met frisse teksten van een straffe, jonge songwriter. Deze Britse knapen brengen aanstekelijke psychedelische garagerock en zijn getekend bij het gerenommeerde label Rise Above/Popclaw Records.</p>\n<p>Ze werken hard aan hun carrière, met resultaat. Na het in eigen beheer uitbrengen van twee platen in 2023 en 2024 kondigden ze een mooie tour aan, met zelfs een concert bij Jack White’s <strong>Third Man Records</strong> in Londen. Dit jaar brachten ze hun derde plaat English Mustard uit.</p>\n<p>Louder Than War over die plaat: <em>“Na drie albums laat English Mustard een volwassenheid en zelfvertrouwen horen in hun muziek. Ze weten een heerlijk levendig, direct en opwindend geluid neer te zetten. (…) De band vermengt invloeden en riffs uit de jaren ’60 en ’70 – van heavy tot folk – met een moderne gevoeligheid die zorgt voor een spannende mix. De drums zijn krachtig en energiek, de bas dreunend, de gitaren rauw en fel, en de zang is urgent en vol passie.”</em></p>\n<p>English Mustard werd geproduceerd door Liam Watson (bekend van The White Stripes, Tame Impala, Electric Wizard) in Mike Oldfields Tilehouse Studios, volledig met analoge apparatuur. Ze trekken op tour met de plaat — en ze hebben onze uitnodiging niet afgeslagen.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/scottheppleandthesunband/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/scotthepplemusic\">Facebook</a></p>\n<h3>Liquid Silver</h3>\n<p><strong>Psychrock van eigen West-Vlaamse bodem.</strong></p>\n<p>Deze vier West-Vlaamse rockers nemen je mee op een trip die tijd en ruimte doet vervagen met hun heerlijke psychedelische klanken. Vaak trippy, soms ook heavy, met invloeden van Black Sabbath, Hawkwind en Slift, en alles daartussen.</p>\n<p>Met een publieksprijs op Red Rock Rally, airplay op radiozender Willy, concerten bij onder meer Campo Solar, Wilde Westen en Cactus en supportshows voor onder meer RHEA en Crooked Steps op hun cv, bouwen ze gestaag aan een onmiskenbare livereputatie.</p>\n<p>Kom vroeg en support your local scene!</p>\n<p><a target='_blank' href=\"https://luminousdash.be/interview/liquid-silver-als-ik-naar-muziek-luister-wil-ik-iets-voelen-of-dat-nu-oorpijn-hartpijn-of-panische-angst-is-maakt-niet-uit/\">Interview Luminous Dash</a> | <a target='_blank' href=\"https://www.instagram.com/liquidsilverband/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/liquidsilverband\">Facebook</a></p>"
  },
  {
    "Title": "Ão (try-out)",
    "DateString": "2026-02-20T19:30:00.0000000",
    "Url": "https://www.4ad.be/event/ao-try-out-2/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/ao-try-out-2.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<p>Ão heeft zichzelf de afgelopen jaren stevig op de kaart gezet in België en Europa. Hun genre-overschrijdende muziek – die reist langs <strong>elektronica, artpop, saudade en alternative Latin</strong> – is uniek in zijn soort. Een hybride sound die door dit viertal compleet zelf is uitgevonden.</p>\n<p>Frontvrouw <strong>Brenda Corijn</strong>, die put uit haar Mozambikaans-Portugese roots, zingt zowel in het Portugees als in het Engels. Haar warme stem versmelt met het zuiderse gitaarspel van <strong>Siebe Chau</strong>, de gelaagde elektronica van <strong>Jolan Decaestecker</strong> en <strong>Bert Peyffers</strong>’ eclectische percussiewerk.</p>\n<p>In 2023 brachten ze de prachtplaat <strong>&#8216;Ao Mar&#8217;</strong> uit, waarmee we ze ook voor een uitverkochte try-out mochten ontvangen. De plaat werd hier en op veel andere plekken grijsgedraaid; het concert werd er eentje om te koesteren.</p>\n<p>In 2026 zijn ze terug (van helemaal niet weggeweest te zijn) om de definitieve doorbraak vast te leggen met <strong>&#8216;Malandra&#8217;</strong>: een ode aan complexiteit, veelvormigheid en aan het zoeken in al haar gedaanten. Aan schaamte en glans, chaos en rust, liefde en escapisme.</p>\n<p>Wellicht voor een laatste keer in zo’n ongelooflijk klein Belgisch clubje te beleven.</p>\n<p><a target='_blank' href=\"https://www.facebook.com/ao.band.ao\">Facebook</a> | <a target='_blank' href=\"https://www.instagram.com/ao.band/\">Instagram</a></p>"
  }
]