[
  {
    "Title": "Stinstage Takeover: Kameel + FC Atlaska",
    "DateString": "2026-04-04T18:30:00.0000000",
    "Url": "https://www.4ad.be/event/stinstage-takeover-kameel-fc-atlaska/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/stinstage-takeover-kameel-fc-atlaska.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<p><strong>STINSTAGE TAKEOVER</strong>: we geven opnieuw de sleutels van onze club uit handen. Dit keer is het aan de heren van STINSTAGE!</p>\n<h3>FC ATLASKA</h3>\n<p>FC Atlaska speelt ritmische roadtripmuziek. Mochten de Vlaamse Ardennen iets dichter bij de evenaar liggen, schreven deze Gents-Gaverse exoten er ongetwijfeld de gepaste soundtrack voor.<br />Met hun debuut-EP ‘Rhythms from the Schelde Valley’, geproduceerd door Jasper Segers (o.a. Sylvie Kreusch), zet FC Atlaska meteen een eigenzinnige stempel. Hun eerste single ‘I See You Turn East’ ademt sixties-psychedelica en meditatieve snaarklanken, terwijl opvolger ‘Two Moons Away’ je meeneemt op een dromerige, kosmische trip met echo’s van Pink Floyd, Khruangbin en Balthvs.</p>\n<p><a target='_blank' href=\"https://www.youtube.com/watch?v=ywNllz1w030\">YOUTUBE</a> | <a target='_blank' href=\"https://fcatlaska.bandcamp.com\">BANDCAMP</a></p>\n<h3>KAMEEL</h3>\n<p>Kameel is terug!<br />Het avontuurlijke trio van Hans Mullens, Patrick Steenaerts en Geert Roelofs presenteert hun derde langspeler “Variomatic”. Verwacht een meeslepende mix van jazz, rock, elektronica en improvisatie, altijd met die herkenbare filmische ondertoon.</p>\n<p>Met dit nieuwe album, geïnspireerd door electroclash, schuift Kameel elektronica nadrukkelijker naar voren en voegen ze voor het eerst ook vocale nummers toe – een frisse dimensie in hun eigenzinnige geluid.<br />Na de eerdere releases Barkas (2020) en Trugschluss (2023) bewijst Kameel opnieuw dat ze grenzen verleggen en genres doen samensmelten.<br />Live vertaalt zich dat in een avond vol energie: dansbaar, verrassend en onweerstaanbaar.</p>\n<p>Een unieke band. Een unieke avond. Mis het niet!</p>\n<p><a target='_blank' href=\"https://youtu.be/dalHZG7nbc0?si=veg3H1I-M9XYT3P\">YOUTUBE</a> | <a target='_blank' href=\"https://luminousdash.be/live/kameel-geel-cc-de-werft-31-10-2025\">REVIEW LUMINOUS DASH</a></p>\n<h3>STINSTAGE DJ&#8217;S</h3>\n<p>Voor wie houdt van verrassende feestjes zijn de eigenzinnige Stinstage DJ’s geen onbekenden meer. Dit dynamische duo bracht inmiddels diverse pubs, clubs en festivals op temperatuur. In hun eclectische sets hoor je zowel jong, onontdekt talent als invloedrijke bands die wat in de plooien van de muziekgeschiedenis zijn verdwenen. Alles wat rockt, swingt, doet heupwiegen of de boel laat knallen, krijgt een plaats in hun sets. Onder het motto “No rules, great music” duiken ze diep in de betere rock, garage, punk, funk, soul, jazz, ska, surf, blues, country, rockabilly en aanverwante rootsgenres.</p>\n<p><a target='_blank' href=\"http://www.mixcloud.com/Stinstage\">MIXCLOUD</a> | <a target='_blank' href=\"https://www.facebook.com/Stinstage\">FACEBOOK</a></p>"
  },
  {
    "Title": "Faze + Yesnomaybe",
    "DateString": "2026-04-11T18:30:00.0000000",
    "Url": "https://www.4ad.be/event/faze-yesnomaybe/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/faze-yesnomaybe.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>Faze (ca)</h3>\n<p><strong>Chaotische punk-rock-hardcore-dans-ennogvannallesband uit Canada.</strong></p>\n<p>Deze bonte bende uit het levendige Montréal maakt nietsontziende hardcorepunk met psych-invloeden en verslavende ritmes. Samengesteld uit leden met uiteenlopende muzikale achtergronden &#8211; crust, hardcore, punk en psych &#8211; belichaamt hun sound de chaotische energie van een Canadese sneeuwstorm, met een scheurende trombone die er met alle moeite bovenuit stijgt.</p>\n<p>Faze staat symbool voor de geest van Montréal en haar indrukwekkende harcordepunkscene, en is bovenal een <strong>must-see-live-band</strong>! Must, zeggen we!</p>\n<p><a target='_blank' href=\"http://\">Instagram</a> | <a target='_blank' href=\"https://fazefazefaze.bandcamp.com/album/big-upsetter\">Bandcamp</a></p>\n<h3>Yesnomaybe</h3>\n<p><strong>Melodieuze punkrock en een alles-moet-kapot-attitude.</strong></p>\n<p>De vier heren van Yesnomaybe wonnen in 2024 <strong>‘De Nieuwe Lichting</strong>’ van <strong>Studio Brussel</strong> en zijn sindsdien aan een stevige veroveringstocht bezig. Met hun rauwe <strong>90’s punkrock en grunge</strong>, sterke attitude en scherpe teksten komen ze je op een podium bij jou in de buurt een geweten recht in je muil schoppen. Ontbrak nog in hun lijst: Diksmuide. Fixen we: jazeker.</p>\n<p>Frontman <strong>Ferre Achten</strong> laat er alvast geen twijfel over bestaan: <em>“Het doel is de Belgische muziekscene helemaal overhoop te halen. Of dat gaat lukken? Zeker!”</em> Kom het zelf ontdekken op 11 april. Zweet, chaos en een ‘what the fuck?’-gevoel gegarandeerd.</p>\n<p><a target='_blank' href=\"https://www.facebook.com/yesnomaybe420/?locale=nl_BE\">Facebook</a> | <a target='_blank' href=\"https://www.instagram.com/yesnomaybe._/\">Instagram</a></p>"
  },
  {
    "Title": "Primitive Man + Bloed + Kollaps",
    "DateString": "2026-04-17T18:00:00.0000000",
    "Url": "https://www.4ad.be/event/primitive-man-bloed-kollaps/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/12/primitive-man-bloed-kollaps.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>Primitive Man (vs)</h3>\n<p><strong>Amerikaanse doomdenkers komen met nieuwe plaat &#8216;Observance&#8217; naar Diksmuide.</strong></p>\n<p>Ethan McCarthy, Jonathan Campos en Joe Linden zijn al sinds 2012 over de hele wereld muzikale breinen aan het smelten. Ze combineren sludge metal, doom en noise rock tijdens energieke en krachtige liveconcerten die gegarandeerd een blijvende indruk nalaten. Ze werden in korte tijd cultartiesten binnen het genre, zo&#8217;n band die we tot in de verdoemenis zullen blijven afspelen.</p>\n<p>De nieuwe plaat Observance is anders dan hoe we Primitive Man tot nu toe kennen. Met motieven en symbolen die doorheen de teksten en het artwork (dat ook door McCarthy werd gemaakt) terugkeren, en geïnspireerd door het werk van Tongo Eisen-Martin – specifiek Blood on the Fog – biedt McCarthy geen antwoorden, hij probeert enkel zijn ervaringen te delen. Persoonlijke en professionele valkuilen worden onderzocht tegen de achtergrond van een gebroken sociaal contract dat het leven van de werkende klasse vernietigt. Terwijl partijpolitiek de media domineert, is er een meer insidieuze verdeeldheid die McCarthy bezighoudt, aangezien hij achtervolgd wordt door technofeodalisme en de toekomst van mensenrechten en sociale onrust.</p>\n<p>Ondanks dat ze meer leunen naar hun experimentele kant, behouden PRIMITIVE MAN een stevige grip op het zware geluid dat hen al jaren definieert. Observance is nog steeds een uitdagend album, dat de aandacht van de luisteraar op elke draai vereist. Het geluid van Observance is doordrongen van een nieuw element voor de band – verdriet. Toch beschrijft McCarthy dit als het meest positieve PRIMITIVE MAN-album tot nu toe; zelfs terwijl ze de karkassen van desillusie uitpluizen, blijven ze een uitweg zoeken, een pad naar het licht.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/primitivemandoom/\">Instagram</a> | <a target='_blank' href=\"https://www.instagram.com/primitivemandoom/\">Facebook</a> | <a target='_blank' href=\"https://www.youtube.com/watch?v=F1E50l2Ttx4\">Live on Audiotree</a></p>\n<h3>Bloed (be)</h3>\n<p><strong>Beloftevol project van de broers Toon (Mother) en Tuur (Mother), en hun zus Fieke (Lightspeed, Ratmosphere) Soete.</strong></p>\n<p>Synth- en industrial metal van eigen bodem waar we nog zéér veel van gaan horen. De familie Soete begon pas in 2022 met hun schrijfsessies, maar het duurde niet lang voor ze hun eigen sound en identiteit wisten te vinden. In 2023 schopten ze het al meteen tot winnaar van Sound Track, de wedstrijd die 4AD samen met de rest van de Vlaamse muzieksector elke twee jaar organiseert. Sindsdien hebben ze al menig concertzaal omver mogen knallen, nu is het éindelijk aan ons. Een band die je boven alles live moet komen ervaren. Afkomen dus!<br /><a target='_blank' href=\"https://www.instagram.com/bloedband/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/bloedband\">Facebook</a></p>\n<h3>Kollaps (aus)</h3>\n<p><strong>Bijzonder industrial-project van down under.</strong></p>\n<p>Kollaps is een Australisch post-industrieel project wiens geschiedenis onlosmakelijk verbonden is met geweld—zowel als onderwerp als fysieke werkwijze. Gevormd aan de rand van ineenstorting en persoonlijke desintegratie, heeft de band een reputatie opgebouwd voor optredens die confronterend, ascetisch en onwrikbaar zijn in hun toewijding aan realisme. De band is recentelijk verhuisd naar IJsland, een stap die de voortdurende zoektocht naar isolatie, ernst en een ongenadigere creatieve omgeving weerspiegelt.</p>\n<p>Hun concerten draaien om een set van instrumenten en gereedschappen die uit lijkenhuizen afkomstig zijn: bloed- en speekselbesmeurde hoofdsteunen, kniestukken, hackzagen, keel-expanders, en andere apparaten die ooit werden gebruikt om het menselijk lichaam te manipuleren, openen en te weerhouden. Deze objecten zijn niet symbolisch. Ze functioneren als percussie-instrumenten en structurele componenten in de performance, waarbij ze het residu van hun oorspronkelijke doel meenemen in de sonische architectuur van het project. Mentale voorbereiding voor deze set is aangeraden.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/kollapsmusic/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/Kollapsmusic\">Facebook</a></p>"
  },
  {
    "Title": "La Jungle",
    "DateString": "2026-04-24T18:30:00.0000000",
    "Url": "https://www.4ad.be/event/la-jungle/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2026/01/la-jungle.jpg",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>La Jungle</h3>\n<p><strong>Extra drummer, extra dansen.</strong></p>\n<p>Wanneer we een e-mail krijgen van de heren van La Jungle, met daarin het blije nieuws dat een extra drummer (bij ons beter bekend als Landrose) hen zal vervoegen voor een nieuw project, hebben wij maar één antwoord: WANNEER?</p>\n<p>We zinderen nog altijd na van hun machtige passage op ons WATER&amp;4-festival afgelopen zomer, maar nu schakelt La Jungle nog een versnelling hoger. Het duo wordt een trio met hun zevende studioalbum: <strong>‘An Order Of Things’</strong>. Negen nummers die gezamenlijk werden geschreven in Bergen, aan de oevers van de altijd onheilspellende La Trouille, en opgenomen in de bossen van Normandië. In 2026 stellen Roxie, Jim en hun vriend Da, na 750 duo-shows, een andere orde der dingen voor.<br /><strong>Dubbele kick, dubbele snare, drievoudige trance.</strong> Altijd dansend.</p>\n<p>‘An Order Of Things’ verschijnt op 17 april 2026 via Hyperjungle Recordings, het label dat door de band zelf werd opgericht.</p>\n<p>Wij zijn enthousiast. Héél enthousiast.</p>\n<p><a target='_blank' href=\"https://lajungle.bandcamp.com/\">Bandcamp</a> | <a target='_blank' href=\"https://www.instagram.com/lajungleband\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/lajungleband\">Facebook</a></p>\n<h3>Stakattak</h3>\n<p><strong>Family trashpop trio.</strong></p>\n<p>Minimalistisch, explosief en wild als een hondsdolle hond. Da’s wat we onthouden na een eerste livebeleving met het Belgische trashpop-punktrio <strong>Stakattak</strong>. Nick Defour, Lotte Beckwé en Thijs Beckwé maken al sinds 2017 wilde geluidsgolven met hun korte, catchy en onvoorspelbare nummers.</p>\n<p>Vorig jaar brachten ze hun vierde plaat <strong>&#8216;Bullseye in the Opera&#8217;</strong> uit en verstevigden ze hun positie als vaste waarde binnen de Europese undergroundscene. Hoog tijd dat ze bij ons komen demonstreren wat zo’n onofficiële award precies wil zeggen.</p>\n<p><a target='_blank' href=\"https://stakattak.bandcamp.com/album/bullseye-in-the-opera\">Bandcamp</a> | <a target='_blank' href=\"https://www.instagram.com/stakattakofficial/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/stakattakofficial\">Facebook</a></p>"
  },
  {
    "Title": "Kiss The Anus Of A Black Cat",
    "DateString": "2026-04-25T18:30:00.0000000",
    "Url": "https://www.4ad.be/event/kiss-the-anus-of-a-black-cat/",
    "ImageUrl": "https://www.4ad.be/wp-content/uploads/2025/11/kiss-the-anus-of-a-black-cat-1.png",
    "Location": "Muziekclub 4AD",
    "Description": "<h3>KISS THE ANUS OF A BLACK CAT</h3>\n<p><strong>Terug in haar oorspronkelijke bezetting!</strong></p>\n<p>Na een tijdje missing in action te zijn, gaat Kiss the Anus of a Black Cat terug op pad voor een speciale reeks reünieconcerten met zijn oorspronkelijke folkensemble om de 15e verjaardag te vieren van het alom geprezen album Hewers of Wood and Drawers of Water! De première is voor Roadburn Festival; het zou bijna illegaal zijn om 4AD niet in de reeks op te nemen. Correctie: het zou absoluut illegaal zijn.</p>\n<p>KTAOABC is het project van de Belgische songwriter en multi-instrumentalist Stef Heeren, onlangs nog bij ons op bezoek met Use Knife. De band ontstond begin jaren 2000 in Gent en blonk uit met haar hypnotische, duistere en psychedelische folk en de zwevende stem van Heeren.</p>\n<p>De eerste platen If The Sky Falls, We Shall Catch Larks (2005), An Interlude to the Outermost (2007) en The Nebulous Dreams (2008) leverden KTAOABC meteen een trouwe groep fans op binnen de alternatieve muziekscene. De release van de plaat Hewers of Wood and Drawers of Water in 2010 zorgde voor een definitieve cultstatus, waarbij de band hun hypnotische folksound wist te transformeren tot oerdegelijke songwriting.</p>\n<p>In de jaren die volgden breidde Heeren’s band geleidelijk zijn klankpalet uit, waarbij ze opschoven naar meer elektronische texturen en postpunk-invloeden, met Stefs stem en hun duistere psychedelische sound als de kern van het werk van de band op de albums Weltuntergangsstimmung (2012) en To Live Vicariously (2015).</p>\n<p>Met deze nieuwe tournee speelt KTAOABC niet alleen de 15 jaar oude cultplaat, maar gaat de band ook dieper in op haar roots en de nummers die hun eerdere jaren bepaalden.</p>\n<p><a target='_blank' href=\"https://www.instagram.com/kisstheanusofablackcatofficial/\">Instagram</a> | <a target='_blank' href=\"https://www.facebook.com/kisstheanusofablackcat\">Facebook</a></p>"
  }
]